#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ИспользоватьПланированиеОстатков = ПолучитьФункциональнуюОпцию("ИспользоватьПланированиеОстатков");
	
	Если Объект.ПланированиеПотребностей Тогда
		ТипПланирования = 1;
	ИначеЕсли Объект.ПланированиеОстатков Тогда
		ТипПланирования = 2;
	КонецЕсли;
	
	Если Не ИспользоватьПланированиеОстатков
		И Не Объект.ПланированиеОстатков Тогда
		Элементы.ТипПланирования.СписокВыбора.Удалить(2);
	КонецЕсли;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ПланированиеПотребностей =  ТипПланирования = 1;
	Объект.ПланированиеОстатков = ТипПланирования = 2;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти
