///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Вызывается из одноименной процедуры одноменного справочника для настройки заголовка формы
// 
// Параметры:
// 	Форма - УправляемаяФомрма - Источник возникновения события
Процедура ОбновитьЗаголовокФормыШаблоныЭтикетокИЦенников(Форма, Наименование) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

#КонецОбласти