
// ОткрытьПодробнееОФормах()
//
&НаКлиенте
Процедура ОткрытьПодробнееОФормах(Команда)
	
	Если Элементы.СправочникСписок.ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(,НСтр("ru='Выберите отчет!';uk='Виберіть звіт!'"));
		Возврат;
	КонецЕсли;
		
	Если ЭтоГруппа(Элементы.СправочникСписок.ТекущаяСтрока) Тогда
		ПоказатьПредупреждение(,НСтр("ru='Функция недоступна для группы отчетов!';uk='Функція недоступна для групи звітів!'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НачальноеЗначениеВыбора", Элементы.СправочникСписок.ТекущаяСтрока);
	
	ФормаПодробнееОФормах = РегламентированнаяОтчетностьКлиент.ПолучитьОбщуюФормуПоИмени("ПодробнееОбОтчете", ПараметрыФормы, ЭтаФорма);
	ФормаПодробнееОФормах.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ФормаПодробнееОФормах.Открыть();
	
	
КонецПроцедуры // ОткрытьПодробнееОФормах()

// ЭтоГруппа()
//
&НаСервере
Функция ЭтоГруппа(Элемент)
	
	Возврат Элемент.ЭтоГруппа;
	
КонецФункции // ЭтоГруппа()

// СправочникСписокВыбор()
//
&НаКлиенте
Процедура СправочникСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	РеквизитыОтчета = ВыбратьНаСервере(Элементы.СправочникСписок.ТекущаяСтрока);
	
	Если НЕ РеквизитыОтчета = Неопределено Тогда
		Закрыть(РеквизитыОтчета);
	КонецЕсли;
			
КонецПроцедуры // СправочникСписокВыбор()

// ПолучитьРеквизитыОтчета()
//
&НаСервере
Функция ПолучитьРеквизитыОтчета(Элемент)
	
	РеквизитыОтчета = Новый Структура;
	РеквизитыОтчета.Вставить("Ссылка", Элемент.Ссылка);
	РеквизитыОтчета.Вставить("ИсточникОтчета", Элемент.ИсточникОтчета);
	
	Возврат РеквизитыОтчета;
			
КонецФункции // ПолучитьРеквизитыОтчета()

// Выбрать()
//
&НаКлиенте
Процедура Выбрать(Команда)
	
	РеквизитыОтчета = ВыбратьНаСервере(Элементы.СправочникСписок.ТекущаяСтрока);
	
	Если НЕ РеквизитыОтчета = Неопределено Тогда
		Закрыть(РеквизитыОтчета);
	КонецЕсли;
	
КонецПроцедуры // Выбрать()

// ВыбратьНаСервере()
//
&НаСервере
Функция ВыбратьНаСервере(Элемент)

	Если НЕ ЭтоГруппа(Элемент) Тогда
		
		Возврат ПолучитьРеквизитыОтчета(Элемент);
				
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ВыбратьНаСервере()
