
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	НаименованиеПриИзмененииСервер()
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПередЗаписьюСервер()
КонецПроцедуры

&НаСервере
Процедура НаименованиеПриИзмененииСервер()
	
	Если ПустаяСтрока(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.НаименованиеДляНалоговыхДокументов) Тогда
		Объект.НаименованиеДляНалоговыхДокументов = Объект.Наименование;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюСервер()
	
	Если НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СокрЛП(Объект.Префикс)) Тогда 
		Объект.Префикс = "";
	КонецЕсли; 
	
КонецПроцедуры
