Процедура ПоказатьНовости(Параметры = Неопределено) Экспорт
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура("ЗапускПриСтарте", Ложь);
	КонецЕсли;
	Если НЕ НСИСВызовСервера.ЕстьПравоДоступаНаОбработку("НСИСНовости") Тогда
	   Возврат;
	КонецЕсли; 
	ОткрытьФорму("Обработка.НСИСНовости.Форма", Параметры, ,);
	
КонецПроцедуры

Процедура ПоказатьКалендарьБухгалтера(Параметры = Неопределено) Экспорт
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура("ЗапускПриСтарте", Ложь);
	КонецЕсли;
	Если НЕ НСИСВызовСервера.ЕстьПравоДоступаНаОбработку("НСИСКалендарьБухгалтера") Тогда
	   Возврат;
	КонецЕсли; 
	ОткрытьФорму("Обработка.НСИСКалендарьБухгалтера.Форма", Параметры);
	
КонецПроцедуры

Процедура ВыполнитьОбновлениеДанных(Параметры = Неопределено) Экспорт
	
	Если Параметры = Неопределено Тогда
		Параметры = Новый Структура("ЗапускПриСтарте", Ложь);
	КонецЕсли;	
	Если НЕ НСИСВызовСервера.ЕстьПравоДоступаНаОбработку("НСИСАвтозапускЗагрузки") Тогда
	   Возврат;
	КонецЕсли; 
	ОткрытьФорму("Обработка.НСИСАвтозапускЗагрузки.Форма", Параметры);
	
КонецПроцедуры

Процедура ПослеНачалаРаботыСистемы() Экспорт
	
	Параметры = Новый Структура("ЗапускПриСтарте", Истина);
	
	ПоказатьНовости(Параметры);
	ПоказатьКалендарьБухгалтера(Параметры);
	ВыполнитьОбновлениеДанных(Параметры);
	
КонецПроцедуры
