
#Область ПрограммныйИнтерфейс

#Область ПроцедурыВнесенияИВыемкиДС

// Создает документ ВнесениеДенежныхСредствВКассуККМ.
//
// Параметры:
//  ВходныеДанные - Структура - Структура данных с реквизитами создаваемого документа.
//
// Возвращаемое значение:
//  ДокументСсылка.ВнесениеДенежныхСредствВКассуККМ - Созданный документ.
//
Функция СоздатьДокументВнесениеДенежныхСредствВКассуККМ(ВходныеДанные) Экспорт
	
	НовыйДокумент = Документы.ВнесениеДенежныхСредствВКассуККМ.СоздатьДокумент();
	
	НовыйДокумент.Дата              = ТекущаяДатаСеанса();
	НовыйДокумент.Организация       = ВходныеДанные.Организация;
	НовыйДокумент.Касса             = ВходныеДанные.Касса;
	НовыйДокумент.КассаККМ          = ВходныеДанные.КассаККМ;
	НовыйДокумент.СуммаДокумента    = ВходныеДанные.СуммаДокумента;
	НовыйДокумент.Валюта            = ВходныеДанные.Валюта;
	НовыйДокумент.ДокументОснование = ВходныеДанные.ДокументОснование;
	НовыйДокумент.Кассир            = Пользователи.ТекущийПользователь();
	
	НовыйДокумент.Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(НовыйДокумент.Организация);
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат НовыйДокумент.Ссылка;
	
КонецФункции

// Создает документ ВыемкаДенежныхСредствИзКассыККМ.
//
// Параметры:
//  ВходныеДанные - Структура - Структура данных с реквизитами создаваемого документа.
//
// Возвращаемое значение:
//  ДокументСсылка.ВыемкаДенежныхСредствИзКассыККМ - Созданный документ.
//
Функция СоздатьДокументВыемкаДенежныхСредствИзКассыККМ(ВходныеДанные) Экспорт
	
	НовыйДокумент = Документы.ВыемкаДенежныхСредствИзКассыККМ.СоздатьДокумент();
	
	НовыйДокумент.Дата           = ТекущаяДатаСеанса();
	НовыйДокумент.Организация    = ВходныеДанные.Организация;
	НовыйДокумент.Валюта         = ВходныеДанные.Валюта;
	НовыйДокумент.КассаККМ       = ВходныеДанные.КассаККМ;
	НовыйДокумент.СуммаДокумента = ВходныеДанные.СуммаДокумента;
	НовыйДокумент.Кассир         = Пользователи.ТекущийПользователь();
	
	НовыйДокумент.Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(НовыйДокумент.Организация);
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат НовыйДокумент.Ссылка;
	
КонецФункции

#КонецОбласти

#Область Прочее

// Перегруппировать кнопки формы
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма
//  ЭлементыНаПерегруппировку - Массив из КнопкаФормы - Массив элементов формы на перегруппировку.
//
Процедура ПерегруппироватьКнопкиФормы(Форма, ЭлементыНаПерегруппировку) Экспорт
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить("ГруппаНижняяКоманднаяПанельОперацииНадЧеком",   Новый Массив);
	Соответствие.Вставить("ГруппаНижняяКоманднаяПанельКонтекстныеКоманды", Новый Массив);
	Соответствие.Вставить("ГруппаНижняяКоманднаяПанельОплата",             Новый Массив);
	
	УдаленныеЭлементы = Новый Массив;
	Для Каждого Элемент Из ЭлементыНаПерегруппировку Цикл
		Если УдаленныеЭлементы.Найти(ЭлементыНаПерегруппировку.Найти(Элемент)) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		// Удаление добавленных ранее элементов формы
		Декорация = Форма.Элементы.Найти(Элемент.Имя + "Декорация" + "Дубль");
		Если Декорация <> Неопределено Тогда
			Индекс = ЭлементыНаПерегруппировку.Найти(Декорация);
			Если Индекс <> Неопределено Тогда
				УдаленныеЭлементы.Добавить(Индекс);
			КонецЕсли;
			Форма.Элементы.Удалить(Декорация);
		КонецЕсли;
		Если СтрЗаканчиваетсяНа(Элемент.Имя, "ДекорацияДубль") Тогда
			Форма.Элементы.Удалить(Элемент);
			Продолжить;
		КонецЕсли;
		Для Каждого КлючИЗначение Из Соответствие Цикл
			Если Найти(Элемент.Родитель.Имя, КлючИЗначение.Ключ) Тогда
				КлючИЗначение.Значение.Добавить(Элемент);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из Соответствие Цикл
	
		Индекс = 0;
		НомерГруппы = 1;
		ИзмененыЭлементы = Ложь;
		Для Каждого Элемент Из КлючИЗначение.Значение Цикл
			
			Форма.Элементы.Переместить(Элемент, Форма.Элементы[КлючИЗначение.Ключ + НомерГруппы]);
			
			Если Не Элемент.Видимость Тогда
				Продолжить;
			КонецЕсли;
			
			ИзмененыЭлементы = Истина;
			Индекс = 1 - Индекс;
			Если Индекс = 0 Тогда
				НомерГруппы = НомерГруппы + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ИзмененыЭлементы И Индекс = 1 Тогда
			СозданныйЭлемент = ДобавитьЭлемент(Форма, Элемент.Имя + "ДекорацияДубль", КлючИЗначение.Ключ, НомерГруппы);
			ЗаполнитьЗначенияСвойств(СозданныйЭлемент, Элемент,, "Имя");
			СозданныйЭлемент.Видимость = Истина;
			СозданныйЭлемент.Доступность = Ложь;
			СозданныйЭлемент.Заголовок = " ";
		КонецЕсли;
		
		Если Не ИзмененыЭлементы Тогда
			Дельта = 0;
		Иначе
			Дельта = 1;
		КонецЕсли;
		
		Если НомерГруппы < 4 Тогда
			Для Индекс = НомерГруппы + Дельта По 4 Цикл
				ИмяЭлемента = КлючИЗначение.Ключ + Индекс;
				Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Форма.Элементы, ИмяЭлемента) Тогда
					Форма.Элементы[ИмяЭлемента].Видимость = Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если НомерГруппы + Дельта = 1 Тогда
			ИмяЭлемента = "Разделитель" + КлючИЗначение.Ключ;
			Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Форма.Элементы, ИмяЭлемента) Тогда
				Форма.Элементы[ИмяЭлемента].Видимость = Ложь;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПоместитьКомандыПечатиВоВсеДействия(ГруппаФормы, КнопкиПечати)
	
	Для Каждого КнопкаПечати Из ГруппаФормы.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(КнопкаПечати) = Тип("ГруппаФормы") Тогда
			ПоместитьКомандыПечатиВоВсеДействия(КнопкаПечати, КнопкиПечати);
		Иначе
			КнопкиПечати.Добавить(КнопкаПечати);
			КнопкаПечати.Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Настроить команды печати
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма.
//
Процедура НастроитьКомандыПечати(Форма) Экспорт
	
	КнопкиПечати = Новый Массив;
	ПоместитьКомандыПечатиВоВсеДействия(Форма.Элементы.ПодменюПечать, КнопкиПечати);
	
	КомандыПечати = Новый Массив;
	Для Каждого КнопкаПечати Из КнопкиПечати Цикл
		КомандаФормы = Форма.Команды[КнопкаПечати.ИмяКоманды]; // КомандаФормы
		КомандыПечати.Добавить(
			Новый Структура("Заголовок, ИмяКоманды", КомандаФормы.Заголовок, КнопкаПечати.ИмяКоманды));
	КонецЦикла;
	Форма.АдресКомандПечатиВоВременномХранилище = ПоместитьВоВременноеХранилище(КомандыПечати, Форма.УникальныйИдентификатор);
	
КонецПроцедуры

// Настроить быстрые товары и горячие клавиши
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  Выборка - ВыборкаИзРезультатаЗапроса
//
Процедура НастроитьБыстрыеТоварыИГорячиеКлавиши(Форма, Выборка) Экспорт
	
	Если Форма.ГорячиеКлавишиНастроены Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Форма, "БыстрыеТовары")
		И Форма.БыстрыеТовары.Количество() = 0 Тогда
		
		БыстрыеТовары = Выборка.БыстрыеТовары.Получить(); // см. Справочники.ГорячиеКлавиши.ФормаЭлемента.БыстрыеТовары
		
		Если БыстрыеТовары.Количество() > 0 Тогда
			
			Для Каждого СтрокаТЧ Из БыстрыеТовары Цикл
				
				Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
					
					ИмяКнопки = "БыстрыйТовар_" + БыстрыеТовары.Индекс(СтрокаТЧ);
					
					НоваяКоманда = Форма.ЭтотОбъект.Команды.Добавить(ИмяКнопки);
					НоваяКоманда.Действие = "ВыбранБыстрыйТовар";
					Если ЗначениеЗаполнено(СтрокаТЧ.Заголовок) Тогда
						НоваяКоманда.Заголовок = СтрокаТЧ.Заголовок;
					Иначе
						НоваяКоманда.Заголовок = Строка(СтрокаТЧ.Номенклатура);
					КонецЕсли;
					НоваяКоманда.Отображение               = ОтображениеКнопки.Текст;
					НоваяКоманда.ИзменяетСохраняемыеДанные = Истина;
					НоваяКоманда.СочетаниеКлавиш           = Новый СочетаниеКлавиш(Клавиша[СтрокаТЧ.Клавиша], СтрокаТЧ.Alt, СтрокаТЧ.Ctrl, СтрокаТЧ.Shift);
					
					НоваяКнопка = Форма.Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), Форма.Элементы.ФормаГорячиеКлавишиБыстрыеТовары);
					НоваяКнопка.ТолькоВоВсехДействиях = Истина;
					НоваяКнопка.ИмяКоманды = НоваяКоманда.Имя;
					
					НовыйТовар = Форма.БыстрыеТовары.Добавить();
					ЗаполнитьЗначенияСвойств(НовыйТовар, СтрокаТЧ);
					НовыйТовар.ИмяКоманды = НоваяКоманда.Имя;
					
				КонецЕсли;
				
			КонецЦикла;
			
			ЗапросДополнительныеДанныеОБыстрыхТоварах = Новый Запрос(
			"ВЫБРАТЬ
			|	Товары.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ Товары
			|ИЗ
			|	&Товары КАК Товары
			|;
			|ВЫБРАТЬ
			|	Товары.Номенклатура КАК Номенклатура,
			|	СправочникНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры
			|ИЗ
			|	Товары КАК Товары
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
			|		ПО Товары.Номенклатура = СправочникНоменклатура.Ссылка");
			
			ЗапросДополнительныеДанныеОБыстрыхТоварах.УстановитьПараметр("Товары", Форма.БыстрыеТовары.Выгрузить(,"Номенклатура"));
			
			ВыборкаДополнительныеДанныеОБыстрыхТоварах = ЗапросДополнительныеДанныеОБыстрыхТоварах.Выполнить().Выбрать();
			
			Пока ВыборкаДополнительныеДанныеОБыстрыхТоварах.Следующий() Цикл
				
				Отбор = Новый Структура("Номенклатура", ВыборкаДополнительныеДанныеОБыстрыхТоварах.Номенклатура);
				НайденныеСтрокиБыстрыеТовары = Форма.БыстрыеТовары.НайтиСтроки(Отбор);
				Для Каждого СтрокаБыстрогоТовара Из НайденныеСтрокиБыстрыеТовары Цикл
					СтрокаБыстрогоТовара.ТипНоменклатуры = ВыборкаДополнительныеДанныеОБыстрыхТоварах.ТипНоменклатуры;
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЭлементыФормыСКомандами = Новый ТаблицаЗначений;
	ЭлементыФормыСКомандами.Колонки.Добавить("Элемент");
	ЭлементыФормыСКомандами.Колонки.Добавить("ИмяКоманды");
	Для каждого ЭлементФормы Из Форма.Элементы Цикл
		Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ЭлементФормы, "ИмяКоманды") И ЗначениеЗаполнено(ЭлементФормы.ИмяКоманды) Тогда
			НоваяСтрока = ЭлементыФормыСКомандами.Добавить();
			НоваяСтрока.Элемент = ЭлементФормы;
			НоваяСтрока.ИмяКоманды = ЭлементФормы.ИмяКоманды;
		КонецЕсли;
	КонецЦикла;
	
	КомандыФормы = Выборка.КомандыФормы.Получить(); // см. Справочники.ГорячиеКлавиши.ФормаЭлемента.КомандыФормы
	Для Каждого СтрокаТЧ Из КомандыФормы Цикл
		
		Команда = Форма.Команды.Найти(СтрокаТЧ.Команда);
		Если Команда = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовоеСочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша[СтрокаТЧ.Клавиша], СтрокаТЧ.Alt, СтрокаТЧ.Ctrl, СтрокаТЧ.Shift);
		СтароеСочетаниеКлавишПредставление = ОбщегоНазначенияУТ.ПредставлениеСочетанияКлавиш(Команда.СочетаниеКлавиш);
		НовоеСочетаниеКлавишПредставление  = ОбщегоНазначенияУТ.ПредставлениеСочетанияКлавиш(НовоеСочетаниеКлавиш);
		
		НоваяКоманда = Команда;
		Если НовоеСочетаниеКлавишПредставление <> СтароеСочетаниеКлавишПредставление Тогда
			
			НоваяКоманда = Форма.ЭтотОбъект.Команды.Добавить(СтрокаТЧ.Команда + СтрЗаменить(Новый УникальныйИдентификатор, "-", "_"));
			НоваяКоманда.Действие                  = Команда.Действие;
			НоваяКоманда.ИзменяетСохраняемыеДанные = Команда.ИзменяетСохраняемыеДанные;
			НоваяКоманда.Картинка                  = Команда.Картинка;
			НоваяКоманда.Отображение               = Команда.Отображение;
			НоваяКоманда.Подсказка                 = Команда.Подсказка;
			НоваяКоманда.Заголовок                 = СтрЗаменить(Команда.Заголовок, СтароеСочетаниеКлавишПредставление, НовоеСочетаниеКлавишПредставление);
			НоваяКоманда.СочетаниеКлавиш           = НовоеСочетаниеКлавиш;
			
			НайденныеЭлементыФормы = ЭлементыФормыСКомандами.НайтиСтроки(Новый Структура("ИмяКоманды", Команда.Имя));
			Для Каждого ЭлементФормы Из НайденныеЭлементыФормы Цикл
				ЭлементФормы.ИмяКоманды = НоваяКоманда.Имя;
				ЭлементФормы.Элемент.ИмяКоманды = НоваяКоманда.Имя;
			КонецЦикла;
			
		КонецЕсли;
		
		Если СтрокаТЧ.Скрывать Тогда
			
			НайденныеЭлементыФормы = ЭлементыФормыСКомандами.НайтиСтроки(Новый Структура("ИмяКоманды", Команда.Имя));
			Для Каждого ЭлементФормы Из НайденныеЭлементыФормы Цикл
				ЭлементФормы.Элемент.Видимость = Ложь;
			КонецЦикла;
			
			ИмяКнопки = "ГорячаяКлавиша_" + КомандыФормы.Индекс(СтрокаТЧ);
			
			НоваяКнопка = Форма.Элементы.Добавить(ИмяКнопки, Тип("КнопкаФормы"), Форма.Элементы.ФормаГорячиеКлавиши);
			НоваяКнопка.ТолькоВоВсехДействиях = Истина;
			НоваяКнопка.ИмяКоманды = НоваяКоманда.Имя;
			НоваяКоманда.Заголовок = СтрЗаменить(Команда.Заголовок, СтароеСочетаниеКлавишПредставление, "");
			
		КонецЕсли;
		
	КонецЦикла;
	
	Форма.ГорячиеКлавишиНастроены = Истина;
	
КонецПроцедуры

// Процедура - Подписать горячие клавиши на кнопках
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма.
//
Процедура ПодписатьГорячиеКлавишиНаКнопках(Форма) Экспорт
	
	Для каждого Команда Из Форма.Команды Цикл
		ПредставлениеСочетанияКлавиш = ОбщегоНазначенияУТ.ПредставлениеСочетанияКлавиш(Команда.СочетаниеКлавиш);
		Если СтрНайти(Команда.Заголовок, ПредставлениеСочетанияКлавиш) = 0 Тогда
			Команда.Заголовок = Команда.Заголовок + Символы.ПС + ПредставлениеСочетанияКлавиш;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Создает документ ВыемкаДенежныхСредствИзКассыККМ
//
// Параметры:
//  ЧекККМ  - ДокументСсылка.ЧекККМ - Чек ККМ, для которого требуется получить отчет о розничных продажах.
//
// Возвращаемое значение:
//   ДокументСсылка.ОтчетОРозничныхПродажах - Найденный документ или пустая ссылка на отчет о розничных продажах.
//
Функция ПолучитьОтчетОРозничныхПродажахПоЧекуККМ(ЧекККМ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОтчетОРозничныхПродажах.Ссылка КАК ДокументРеализации
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	|		ПО ЧекККМ.КассоваяСмена = ОтчетОРозничныхПродажах.КассоваяСмена
	|ГДЕ
	|	ЧекККМ.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЧекККМ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДокументРеализации;
	Иначе
		Возврат Документы.ОтчетОРозничныхПродажах.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область РегламентныеЗадания

// Выполняет архивирование чеков ККМ с регистрацией события в журнале регистрации.
// Вызывается регламентным заданием.
//
Процедура АрхивированиеЧековККМ() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.АрхивированиеЧековККМ);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	КассоваяСмена.Ссылка КАК КассоваяСмена
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Проведен
	|	И КассоваяСмена.СтатусРегламентныхОпераций В (ЗНАЧЕНИЕ(Перечисление.СтатусыРегламентныхОперацийКассовойСмены.СозданОтчет))
	|");
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Архивирование чеков ККМ';uk='Архівування чеків ККМ'",ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Информация, , ,
			НСтр("ru='Начато регламентное архивирование чеков ККМ.';uk='Розпочато регламентне архівування чеків ККМ.'"));
			
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("ЗаписыватьВЖурналРегистрации", Истина);
		ПараметрыЗадания.Вставить("КассоваяСмена",                Результат.Выгрузить().ВыгрузитьКолонку("КассоваяСмена"));
		ПараметрыЗадания.Вставить("ОбработкаВыполнена",           Ложь);
		
		ВыполнитьАрхивациюЧековККМ(ПараметрыЗадания);
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Архивирование чеков ККМ';uk='Архівування чеків ККМ'",ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Информация, , ,
			НСтр("ru='Закончено регламентное архивирование чеков ККМ.';uk='Закінчено регламентне архівування чеків ККМ.'"));
	КонецЕсли;
	
КонецПроцедуры

// Выполняет удаление чеков ККМ с регистрацией события в журнале регистрации.
// Вызывается регламентным заданием.
//
Процедура УдалениеЧековККМ() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.УдалениеЧековККМ);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КассоваяСмена.Ссылка КАК КассоваяСмена
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Проведен
	|	И КассоваяСмена.Дата < &ДатаХраненияЧеков
	|	И КассоваяСмена.СтатусРегламентныхОпераций В (ЗНАЧЕНИЕ(Перечисление.СтатусыРегламентныхОперацийКассовойСмены.СозданОтчет),
	|                                                 ЗНАЧЕНИЕ(Перечисление.СтатусыРегламентныхОперацийКассовойСмены.СозданОтчетЧекиЗаархивированы))
	|";
	
	КоличествоДнейХраненияЧеков = Константы.КоличествоДнейХраненияЗаархивированныхЧеков.Получить() * 86400;
	ДатаХраненияЧеков = ТекущаяДатаСеанса() - КоличествоДнейХраненияЧеков;
	
	Запрос.УстановитьПараметр("ДатаХраненияЧеков", ДатаХраненияЧеков);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Удаление чеков ККМ';uk='Вилучення чеків ККМ'",ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Информация, , ,
			НСтр("ru='Начато регламентное удаление чеков ККМ.';uk='Розпочато регламентне вилучення чеків ККМ.'"));
		
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить("ЗаписыватьВЖурналРегистрации", Истина);
		ПараметрыЗадания.Вставить("КассоваяСмена", Результат.Выгрузить().ВыгрузитьКолонку("КассоваяСмена"));
		ПараметрыЗадания.Вставить("ОбработкаВыполнена", Ложь);
		
		ВыполнитьУдалениеЧековККМ(ПараметрыЗадания);
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Удаление чеков ККМ';uk='Вилучення чеків ККМ'",ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Информация, , ,
			НСтр("ru='Закончено регламентное удаление чеков ККМ.';uk='Закінчено регламентне вилучення чеків ККМ.'"));
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет архивирование чеков ККМ с регистрацией события в журнале регистрации.
// Вызывается регламентным заданием.
//
Процедура УдалениеОтложенныхЧековККМ() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.УдалениеОтложенныхЧековККМ);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписьЖурналаРегистрации(НСтр("ru='Удаление отложенных чеков ККМ';uk='Вилучення відкладених чеків ККМ'",ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
	                         УровеньЖурналаРегистрации.Информация, , ,
	                         НСтр("ru='Начато регламентное удаление отложенных чеков ККМ.';uk='Розпочато регламентне вилучення відкладених чеків ККМ.'"));
	
	НачатьТранзакцию();
	Попытка
		
		Выборка = ВыбратьОтложенныеЧекиККМДляУдаления();
		Пока Выборка.Следующий() Цикл
			
			ОписаниеОшибки = "";
			
			ЧекККМОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ЧекККМОбъект.Удалить();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Удаление отложенных чеков ККМ';uk='Вилучення відкладених чеків ККМ'",ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		                         УровеньЖурналаРегистрации.Ошибка, , ,
		                         НСтр("ru='Во время регламентного удаления отложенных чеков ККМ произошла ошибка.';uk='Під час регламентного вилучення відкладених чеків ККМ сталася помилка.'")
		                         + Символы.ПС + ОписаниеОшибки);
		Возврат;
		
	КонецПопытки;
	
	ЗаписьЖурналаРегистрации(НСтр("ru='Удаление отложенных чеков ККМ';uk='Вилучення відкладених чеків ККМ'",ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
	                         УровеньЖурналаРегистрации.Информация, , ,
	                         НСтр("ru='Закончено регламентное удаление отложенных чеков ККМ.';uk='Закінчено регламентне вилучення відкладених чеків ККМ.'"));
	
КонецПроцедуры

// Выполняет архивацию чеков ККМ по кассовой смене.
//
// Параметры:
//  ПараметрыЗадания  - Структура - Параметры регламентного задания
//  АдресХранилища - Строка - Адрес во временном хранилище.
//
Процедура ВыполнитьАрхивациюЧековККМ(ПараметрыЗадания, АдресХранилища="") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Истина;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЧекККМ.Ссылка КАК Ссылка,
	|	ЧекККМ.КассоваяСмена КАК КассоваяСмена
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|ГДЕ
	|	НЕ ЧекККМ.Архивный
	|	И ЧекККМ.Проведен
	|	И ЧекККМ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|	И ЧекККМ.КассоваяСмена В(&КассоваяСмена)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекККМВозврат.Ссылка,
	|	ЧекККМВозврат.КассоваяСмена
	|ИЗ
	|	Документ.ЧекККМВозврат КАК ЧекККМВозврат
	|ГДЕ
	|	НЕ ЧекККМВозврат.Архивный
	|	И ЧекККМВозврат.Проведен
	|	И ЧекККМВозврат.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|	И ЧекККМВозврат.КассоваяСмена В(&КассоваяСмена)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ОтчетОРозничныхПродажах.Ссылка, ЗНАЧЕНИЕ(Документ.ОтчетОРозничныхПродажах.ПустаяСсылка)) КАК Ссылка,
	|	ДокументКассоваяСмена.Ссылка КАК КассоваяСмена
	|ИЗ
	|	Документ.КассоваяСмена КАК ДокументКассоваяСмена
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	|		ПО ДокументКассоваяСмена.Ссылка = ОтчетОРозничныхПродажах.КассоваяСмена
	|ГДЕ
	|	ДокументКассоваяСмена.Ссылка В (&КассоваяСмена)
	|
	|ИТОГИ ПО
	|	КассоваяСмена");
	
	Запрос.УстановитьПараметр("КассоваяСмена", ПараметрыЗадания.КассоваяСмена);
	ВыборкаКассовыхСмен = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКассовыхСмен.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			Отказ = Ложь;
			
			// Первый этап. Статус смены - Закрыта, чеки заархивированы.
			КассоваяСменаОбъект = ВыборкаКассовыхСмен.КассоваяСмена.ПолучитьОбъект(); // ДокументОбъект.КассоваяСмена
			КассоваяСменаОбъект.СтатусРегламентныхОпераций = Перечисления.СтатусыРегламентныхОперацийКассовойСмены.СозданОтчетЧекиЗаархивированы;
			КассоваяСменаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			// Второй этап. Архивирование чеков и полное проведение отчета о розничных продажах.
			ВыборкаДокументов = ВыборкаКассовыхСмен.Выбрать();
			Пока ВыборкаДокументов.Следующий() Цикл
				
				БлокировкаДанных = Новый БлокировкаДанных;
				ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.ДенежныеСредстваВКассахККМ.НаборЗаписей");
				ЭлементБлокировки.УстановитьЗначение("Регистратор", ВыборкаДокументов.Ссылка);
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.ДенежныеСредстваВПути.НаборЗаписей");
				ЭлементБлокировки.УстановитьЗначение("Регистратор", ВыборкаДокументов.Ссылка);
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				БлокировкаДанных.Заблокировать();
				
			КонецЦикла;
			
			ВыборкаДокументов.Сбросить();
			Пока ВыборкаДокументов.Следующий() Цикл
				Если НЕ ВыборкаДокументов.Ссылка.Пустая() Тогда
					ДокументОбъект = ВыборкаДокументов.Ссылка.ПолучитьОбъект();
					Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ЧекККМ")
						ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ЧекККМВозврат") Тогда						

						ДокументОбъект.Архивный = Истина;
						ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
						
					ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ОтчетОРозничныхПродажах") Тогда
						ДокументОбъект.ПометкаУдаления = Ложь;
						ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли;
				Иначе
					Отказ = Истина;
					ОписаниеОшибки = НСтр("ru='По кассовой смене %КассоваяСмена% не создан Отчет о розничных продажах';uk='По касовій зміні %КассоваяСмена% не створений Звіт про роздрібні продажі'");
					ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%КассоваяСмена%", ВыборкаДокументов.КассоваяСмена);
					Если ПараметрыЗадания.Свойство("ЗаписыватьВЖурналРегистрации") И ПараметрыЗадания.ЗаписыватьВЖурналРегистрации Тогда
						ЗаписьЖурналаРегистрации(НСтр("ru='Архивирование чеков ККМ';uk='Архівування чеків ККМ'",ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
							УровеньЖурналаРегистрации.Ошибка, , ,
							НСтр("ru='Во время регламентного архивирования чеков ККМ произошла ошибка.';uk='Під час регламентного архівування чеків ККМ сталася помилка.'")
							+ Символы.ПС + ОписаниеОшибки);
					Иначе
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
					КонецЕсли;
				КонецЕсли
			КонецЦикла;
			
			Если Отказ Тогда
				ОтменитьТранзакцию();
				Результат = Ложь;
			Иначе
				ЗафиксироватьТранзакцию();
			КонецЕсли;
			
		Исключение
			
			ОтменитьТранзакцию();
			
			Результат = Ложь;
			
			ОписаниеОшибки = НСтр("ru='При архивации чеков ККМ произошла ошибка.
|Архивация чеков ККМ не выполнена.
|Дополнительное описание:
|%ДополнительноеОписание%'
|;uk='При архівації чеків ККМ сталася помилка.
|Архівація чеків ККМ не виконана.
|Додатковий опис:
|%ДополнительноеОписание%'");
			ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ДополнительноеОписание%", ИнформацияОбОшибке().Описание);
			
			Если ПараметрыЗадания.Свойство("ЗаписыватьВЖурналРегистрации") И ПараметрыЗадания.ЗаписыватьВЖурналРегистрации Тогда
				ЗаписьЖурналаРегистрации(НСтр("ru='Архивирование чеков ККМ';uk='Архівування чеків ККМ'",ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Ошибка, , ,
					НСтр("ru='Во время регламентного архивирования чеков ККМ произошла ошибка.';uk='Під час регламентного архівування чеків ККМ сталася помилка.'")
					+ Символы.ПС + ОписаниеОшибки);
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
			КонецЕсли;
			
		КонецПопытки;
	КонецЦикла;
	ПараметрыЗадания.ОбработкаВыполнена = Результат;
	
	Если НЕ ПустаяСтрока(АдресХранилища) Тогда
		ПоместитьВоВременноеХранилище(ПараметрыЗадания, АдресХранилища);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет удаление чеков ККМ по кассовой смене.
//
// Параметры:
//  ПараметрыЗадания  - Структура - Параметры регламентного задания
//  АдресХранилища - Строка - Адрес во временном хранилище.
//
Процедура ВыполнитьУдалениеЧековККМ(ПараметрыЗадания, АдресХранилища = "") Экспорт
	
	ВыполнитьАрхивациюЧековККМ(ПараметрыЗадания, АдресХранилища);
	
	УстановитьПривилегированныйРежим(Истина);
	
	УдалениеВыполнено = ПараметрыЗадания.ОбработкаВыполнена;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВозвратТоваровОтКлиента.Ссылка КАК Ссылка,
		|	ВозвратТоваровОтКлиента.ЧекККМ.КассоваяСмена КАК КассоваяСмена
		|ИЗ
		|	Документ.ВозвратТоваровОтКлиента КАК ВозвратТоваровОтКлиента
		|ГДЕ
		|	ВозвратТоваровОтКлиента.ЧекККМ.КассоваяСмена В(&КассоваяСмена)
		|	И ВозвратТоваровОтКлиента.ЧекККМ.КассоваяСмена.СтатусРегламентныхОпераций = 
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыРегламентныхОперацийКассовойСмены.СозданОтчетЧекиЗаархивированы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаявкаНаВозвратТоваровОтКлиента.Ссылка,
		|	ЗаявкаНаВозвратТоваровОтКлиента.ЧекККМ.КассоваяСмена КАК КассоваяСмена
		|ИЗ
		|	Документ.ЗаявкаНаВозвратТоваровОтКлиента КАК ЗаявкаНаВозвратТоваровОтКлиента
		|ГДЕ
		|	ЗаявкаНаВозвратТоваровОтКлиента.ЧекККМ.КассоваяСмена В(&КассоваяСмена)
		|	И ЗаявкаНаВозвратТоваровОтКлиента.ЧекККМ.КассоваяСмена.СтатусРегламентныхОпераций = 
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыРегламентныхОперацийКассовойСмены.СозданОтчетЧекиЗаархивированы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОтчетОРозничныхПродажах.Ссылка КАК Ссылка,
		|	ОтчетОРозничныхПродажах.КассоваяСмена КАК КассоваяСмена
		|ИЗ
		|	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
		|ГДЕ
		|	ОтчетОРозничныхПродажах.КассоваяСмена В(&КассоваяСмена)
		|	И ОтчетОРозничныхПродажах.КассоваяСмена.СтатусРегламентныхОпераций = 
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыРегламентныхОперацийКассовойСмены.СозданОтчетЧекиЗаархивированы)
		|	
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекККМ.Ссылка КАК Ссылка,
		|	ЧекККМ.КассоваяСмена КАК КассоваяСмена
		|ИЗ
		|	Документ.ЧекККМ КАК ЧекККМ
		|ГДЕ
		|	ЧекККМ.Проведен
		|	И ЧекККМ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
		|	И ЧекККМ.КассоваяСмена В(&КассоваяСмена)
		|	И ЧекККМ.КассоваяСмена.СтатусРегламентныхОпераций = 
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыРегламентныхОперацийКассовойСмены.СозданОтчетЧекиЗаархивированы)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекККМВозврат.Ссылка,
		|	ЧекККМВозврат.КассоваяСмена
		|ИЗ
		|	Документ.ЧекККМВозврат КАК ЧекККМВозврат
		|ГДЕ
		|	ЧекККМВозврат.Проведен
		|	И ЧекККМВозврат.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
		|	И ЧекККМВозврат.КассоваяСмена В(&КассоваяСмена)
		|	И ЧекККМВозврат.КассоваяСмена.СтатусРегламентныхОпераций = 
		|		ЗНАЧЕНИЕ(Перечисление.СтатусыРегламентныхОперацийКассовойСмены.СозданОтчетЧекиЗаархивированы)
		|
		|ИТОГИ ПО
		|	КассоваяСмена");

	Запрос.УстановитьПараметр("КассоваяСмена", ПараметрыЗадания.КассоваяСмена);
	Результат = Запрос.Выполнить();
	
	ВыборкаКассовыхСмен =Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКассовыхСмен.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			// Первый этап. Удаление чеков, отчетов о розничных продажах, чеков из возвратов.
			ВыборкаДокументов = ВыборкаКассовыхСмен.Выбрать();
			Пока ВыборкаДокументов.Следующий() Цикл
				ДокументОбъект = ВыборкаДокументов.Ссылка.ПолучитьОбъект();
				Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ВозвратТоваровОтКлиента")
					ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
					
					ДокументОбъект.ОбменДанными.Загрузка = Истина;
					ДокументОбъект.ЧекККМ = Неопределено;
					ДокументОбъект.Записать();
					
				ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ОтчетОРозничныхПродажах") Тогда
					
					ДокументОбъект.ОбменДанными.Загрузка = Истина;
					ДокументОбъект.КассоваяСмена = Неопределено;
					ДокументОбъект.Записать();
					
				ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ЧекККМ")
					ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ЧекККМВозврат") Тогда					
					
					ДокументОбъект.Удалить();
					
				КонецЕсли;
			КонецЦикла;
			
			// Второй этап. Удаление кассовых смен.
			КассоваяСменаОбъект = ВыборкаКассовыхСмен.КассоваяСмена.ПолучитьОбъект();
			КассоваяСменаОбъект.Удалить();
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			
			ОписаниеОшибки = НСтр("ru='При удалении чеков ККМ произошла ошибка.
|Удаление чеков ККМ не выполнено.
|Дополнительное описание:
|%ДополнительноеОписание%'
|;uk='При вилученні чеків ККМ сталася помилка.
|Вилучення чеків ККМ не виконано.
|Додатковий опис:
|%ДополнительноеОписание%'");
			ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ДополнительноеОписание%", ИнформацияОбОшибке().Описание);
			
			Если ПараметрыЗадания.Свойство("ЗаписыватьВЖурналРегистрации") И ПараметрыЗадания.ЗаписыватьВЖурналРегистрации Тогда
				ЗаписьЖурналаРегистрации(НСтр("ru='Удаление чеков ККМ';uk='Вилучення чеків ККМ'",ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Ошибка, , ,
					НСтр("ru='Во время регламентного удаления чеков ККМ произошла ошибка.';uk='Під час регламентного вилучення чеків ККМ сталася помилка.'")
					+ Символы.ПС + ОписаниеОшибки);
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
			КонецЕсли;
			
			УдалениеВыполнено = Ложь;
			
		КонецПопытки;
	КонецЦикла;
	
	ПараметрыЗадания.ОбработкаВыполнена = УдалениеВыполнено;
	
	Если НЕ ПустаяСтрока(АдресХранилища) Тогда
		ПоместитьВоВременноеХранилище(ПараметрыЗадания, АдресХранилища);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОткрытияИЗакрытияКассовойСмены

// Выполняет открытие кассовой смены.
//
// Параметры:
//  КассаККМ - СправочникСсылка.КассыККМ - Параметры регламентного задания
//  ОписаниеОшибки - Строка - Возвращаемое описание ошибки.
//
// Возвращаемое значение:
//  Булево - Истина, Если операция выполнена успешно.
//
Функция ОткрытьКассовуюСмену(КассаККМ, ОписаниеОшибки = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Истина;
	
	СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСмены(КассаККМ);
	
	ДатаОткрытияКассовойСмены = ТекущаяДатаСеанса();
	
	Если СтруктураСостояниеКассовойСмены.СтатусКассовойСмены = Перечисления.СтатусыКассовойСмены.Открыта Тогда
		
		// Если смена открыта, то с момента открытия должно пройти не больше чем 24 часа.
		Если СтруктураСостояниеКассовойСмены.Ошибка24Часа Тогда
			
			Результат = Ложь;
			// Вероятно, что смена была не закрыта.
			ОписаниеОшибки = ОписаниеОшибки24Часа();
			
		КонецЕсли;
		
	Иначе
		
		// Смена закрыта. Откроем новую кассовую смену.
		
		НоваяКассоваяСмена = Документы.КассоваяСмена.СоздатьДокумент();
		НоваяКассоваяСмена.Заполнить(Новый Структура("КассаККМ", КассаККМ));
		
		НоваяКассоваяСмена.Организация            = СтруктураСостояниеКассовойСмены.Организация;
		НоваяКассоваяСмена.КассаККМ               = КассаККМ;
		НоваяКассоваяСмена.Дата                   = ДатаОткрытияКассовойСмены;
		НоваяКассоваяСмена.Статус                 = Перечисления.СтатусыКассовойСмены.Открыта;
		НоваяКассоваяСмена.НачалоКассовойСмены    = ДатаОткрытияКассовойСмены;
		НоваяКассоваяСмена.ОкончаниеКассовойСмены = '00010101';
		
		Если НоваяКассоваяСмена.ПроверитьЗаполнение() Тогда
			НоваяКассоваяСмена.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			Результат = Ложь;
			ОписаниеОшибки = ПолучитьТекстОшибкиЗаполненияОтчета();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Выполняет закрытие кассовой смены.
//
// Параметры:
//  Объект - СправочникСсылка.КассыККМ, СправочникСсылка.ПодключаемоеОборудование - Касса ККМ.
//  ОписаниеОшибки - Строка - Возвращаемое описание ошибки.
//
// Возвращаемое значение:
//  ДокументСсылка.КассоваяСмена, Неопределено - Закрытая кассовая смена.
//
Функция ЗакрытьКассовуюСмену(Объект, ОписаниеОшибки = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Истина;
	
	СтруктураСостояниеКассовойСмены = ПолучитьСостояниеКассовойСмены(Объект);
	
	Если СтруктураСостояниеКассовойСмены.СтатусКассовойСмены = Перечисления.СтатусыКассовойСмены.Открыта
		Или (СтруктураСостояниеКассовойСмены.СтатусКассовойСмены = Перечисления.СтатусыКассовойСмены.Закрыта
		  И  СтруктураСостояниеКассовойСмены.СтатусРегламентныхОпераций = Перечисления.СтатусыРегламентныхОперацийКассовойСмены.ПустаяСсылка()) Тогда
		
		Если СтруктураСостояниеКассовойСмены.ДатаИзмененияСтатуса <= ТекущаяДатаСеанса() Тогда
		
			КассоваяСменаОбъект = СтруктураСостояниеКассовойСмены.КассоваяСмена.ПолучитьОбъект();
			КассоваяСменаОбъект.Статус                     = Перечисления.СтатусыКассовойСмены.Закрыта;
			КассоваяСменаОбъект.СтатусРегламентныхОпераций = Перечисления.СтатусыРегламентныхОперацийКассовойСмены.СозданОтчет;
			КассоваяСменаОбъект.ОкончаниеКассовойСмены     = ТекущаяДатаСеанса();
			Попытка
				КассоваяСменаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				
				Результат = Ложь;
				
				ОписаниеОшибки = НСтр("ru='При закрытии кассовой смены произошла ошибка.
|Дополнительное описание:
|%ДополнительноеОписание%'
|;uk='При закриття касової зміни сталася помилка.
|Додатковий опис:
|%ДополнительноеОписание%'");
				ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ДополнительноеОписание%", ИнформацияОбОшибке().Описание);
				
			КонецПопытки;
			
		Иначе
			Результат = Ложь;
			ОписаниеОшибки = НСтр("ru='При закрытии кассовой смены произошла ошибка.
|Дополнительное описание:
|Дата закрытия кассовой смены меньше даты последнего изменения статуса кассовой смены.'
|;uk='При закритті касової зміни сталася помилка. 
|Додатковий опис: 
|Дата закриття касової зміни менше дати останнього зміни статусу касової зміни.'");
		КонецЕсли;
		
	Иначе
		
		// Смена не открыта.
		
	КонецЕсли;
	
	Возврат ?(Результат, СтруктураСостояниеКассовойСмены.КассоваяСмена, Неопределено);
	
КонецФункции

// Выполняет заполнение Отчета о розничных продажах по кассовой смене.
//
// Параметры:
//  КассоваяСмена - ДокументСсылка.КассоваяСмена - Кассовая смена
//  ОписаниеОшибки - Строка - Возвращаемое описание ошибки.
//
// Возвращаемое значение:
//  ДокументСсылка.ОтчетОРозничныхПродажах - Ссылка на отчет, если операция выполнена успешно. Иначе - Неопределено.
//
Функция ЗаполнитьОтчетОРозничныхПродажахПоКассовойСмене(КассоваяСмена, ОписаниеОшибки = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Поиск отчета о розничных продажах
	ОтчетОРозничныхПродажах = НайтиОтчетОРозничныхПродажах(КассоваяСмена);
	Если ОтчетОРозничныхПродажах = Неопределено Тогда
		ОтчетОРозничныхПродажахОбъект = Документы.ОтчетОРозничныхПродажах.СоздатьДокумент();
	Иначе
		ОтчетОРозничныхПродажахОбъект = ОтчетОРозничныхПродажах.ПолучитьОбъект();
	КонецЕсли;
	
	Возврат ЗаполнитьОтчетОРозничныхПродажах(ОтчетОРозничныхПродажахОбъект, КассоваяСмена, ОписаниеОшибки);
	
КонецФункции

// Выполняет заполнение Отчета о розничных продажах по кассовой смене.
//
// Параметры:
//  ОтчетОРозничныхПродажахОбъект - ДокументОбъект.ОтчетОРозничныхПродажах - Заполняемый документ
//  КассоваяСмена - ДокументСсылка.КассоваяСмена - Кассовая смена
//  ОписаниеОшибки - Строка - Возвращаемое описание ошибки.
//
// Возвращаемое значение:
//  ДокументСсылка.ОтчетОРозничныхПродажах - Ссылка на отчет, если операция выполнена успешно. Иначе - Неопределено.
//
Функция ЗаполнитьОтчетОРозничныхПродажах(ОтчетОРозничныхПродажахОбъект, КассоваяСмена, ОписаниеОшибки = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Заполнение отчета о розничных продажах
	Попытка
		
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		// Подготовка данных.
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ЧекККМТовары.Ссылка                    КАК Ссылка,
		|	ЧекККМТовары.КлючСвязи                 КАК КлючСвязи,
		|	ЧекККМТовары.НоменклатураНабора        КАК НоменклатураНабора,
		|	ЧекККМТовары.ХарактеристикаНабора      КАК ХарактеристикаНабора,
		|	ЧекККМТовары.Номенклатура              КАК Номенклатура,
		|	ЧекККМТовары.Характеристика            КАК Характеристика,
		|	ЧекККМТовары.Серия                     КАК Серия,
		|	ЧекККМТовары.Упаковка                  КАК Упаковка,
		|	ВЫРАЗИТЬ(ВЫБОР
		|		КОГДА
		|			ЧекККМТовары.СуммаРучнойСкидки + ЧекККМТовары.СуммаАвтоматическойСкидки = 0
		|			ИЛИ ЧекККМТовары.КоличествоУпаковок = 0
		|		ТОГДА
		|			ЧекККМТовары.Цена
		|		ИНАЧЕ
		|			ЧекККМТовары.Сумма / ЧекККМТовары.КоличествоУпаковок
		|	КОНЕЦ КАК ЧИСЛО(31,2)) КАК Цена,
		|	ЧекККМТовары.СтавкаНДС                 КАК СтавкаНДС,
		|	ЧекККМТовары.КоличествоУпаковок        КАК КоличествоУпаковок,
		|	ЧекККМТовары.Количество                КАК Количество,
		|	ЧекККМТовары.Сумма                     КАК Сумма,
		|	ЧекККМТовары.Ссылка.ПодакцизныеТоварыДляКоммерческогоИспользования КАК ПодакцизныеТоварыДляКоммерческогоИспользования,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыВозвратовЧерезКассу.ВозвратВТекущуюСмену) КАК ВидВозвратаЧерезКассу,
		|	ЧекККМТовары.Ссылка.Склад              КАК Склад,
		|	ЧекККМТовары.Ссылка.Партнер            КАК Партнер,
		|	ЧекККМТовары.Помещение                 КАК Помещение,
		|	ЧекККМТовары.Продавец                  КАК Продавец,
		|	ЧекККМТовары.Ссылка.Валюта             КАК Валюта,
		|	ЧекККМТовары.Ссылка.ВидЦены            КАК ВидЦены,
		|	ЧекККМТовары.Ссылка.КассаККМ           КАК КассаККМ,
		|	ЧекККМТовары.Ссылка.Организация        КАК Организация,
		|	ЧекККМТовары.Ссылка.НалогообложениеНДС КАК НалогообложениеНДС
		|	
		|ПОМЕСТИТЬ Товары
		|	
		|ИЗ
		|	Документ.ЧекККМ.Товары КАК ЧекККМТовары
		|ГДЕ
		|	ЧекККМТовары.Ссылка.КассоваяСмена = &КассоваяСмена
		|	И ЧекККМТовары.Ссылка.Проведен
		|	И ЧекККМТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекККМТовары.Ссылка,
		|	0,
		|	ЧекККМТовары.НоменклатураНабора,
		|	ЧекККМТовары.ХарактеристикаНабора,
		|	ЧекККМТовары.Номенклатура,
		|	ЧекККМТовары.Характеристика,
		|	ЧекККМТовары.Серия,
		|	ЧекККМТовары.Упаковка,
		|	ЧекККМТовары.Цена,
		|	ЧекККМТовары.СтавкаНДС,
		|	-ЧекККМТовары.КоличествоУпаковок,
		|	-ЧекККМТовары.Количество,
		|	-ЧекККМТовары.Сумма,
		|	ЧекККМТовары.Ссылка.ПодакцизныеТоварыДляКоммерческогоИспользования,
		|	ЧекККМТовары.Ссылка.ВидВозвратаЧерезКассу,
		|	ЧекККМТовары.Ссылка.Склад,
		|	ЧекККМТовары.Ссылка.Партнер,
		|	ЧекККМТовары.Помещение,
		|	ЧекККМТовары.Продавец,
		|	ЧекККМТовары.Ссылка.Валюта,
		|	ЧекККМТовары.Ссылка.ВидЦены,
		|	ЧекККМТовары.Ссылка.КассаККМ,
		|	ЧекККМТовары.Ссылка.Организация,
		|	ЧекККМТовары.Ссылка.НалогообложениеНДС
		|ИЗ
		|	Документ.ЧекККМВозврат.Товары КАК ЧекККМТовары
		|ГДЕ
		|	ЧекККМТовары.Ссылка.КассоваяСмена = &КассоваяСмена
		|	И ЧекККМТовары.Ссылка.Проведен
		|	И ЧекККМТовары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЧекККМТовары.Ссылка               КАК Ссылка,
		|	ЧекККМТовары.НоменклатураНабора   КАК НоменклатураНабора,
		|	ЧекККМТовары.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	ЧекККМТовары.Номенклатура       КАК Номенклатура,
		|	ЧекККМТовары.Характеристика     КАК Характеристика,
		|	ЧекККМТовары.Серия              КАК Серия,
		|	ЧекККМТовары.Упаковка           КАК Упаковка,
		|	ЧекККМТовары.Цена               КАК Цена,
		|	ЧекККМТовары.СтавкаНДС          КАК СтавкаНДС,
		|	ЧекККМТовары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ЧекККМТовары.Количество         КАК Количество,
		|	ЧекККМТовары.Сумма              КАК Сумма,
		|	ЧекККМТовары.ПодакцизныеТоварыДляКоммерческогоИспользования КАК ПодакцизныеТоварыДляКоммерческогоИспользования,
		|	ЧекККМТовары.ВидВозвратаЧерезКассу КАК ВидВозвратаЧерезКассу,
		|	ЧекККМТовары.Склад              КАК Склад,
		|	ЧекККМТовары.Партнер            КАК Партнер,
		|	ЧекККМТовары.Помещение          КАК Помещение,
		|	ЧекККМТовары.Продавец           КАК Продавец,
		|	ЧекККМТовары.Валюта             КАК Валюта,
		|	ЧекККМТовары.ВидЦены            КАК ВидЦены,
		|	ЧекККМТовары.КассаККМ           КАК КассаККМ,
		|	ЧекККМТовары.Организация        КАК Организация,
		|	ЧекККМТовары.НалогообложениеНДС КАК НалогообложениеНДС
		|	
		|ПОМЕСТИТЬ СписокТоваров
		|ИЗ
		|	Товары КАК ЧекККМТовары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокТоваров.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ЧекиККМ
		|ИЗ
		|	СписокТоваров КАК СписокТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЧекиККМ.Ссылка КАК Ссылка
		|ИЗ
		|	ЧекиККМ КАК ЧекиККМ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокТоваров.Валюта КАК Валюта,
		|	СписокТоваров.ВидЦены КАК ВидЦены,
		|	СписокТоваров.КассаККМ КАК КассаККМ,
		|	СписокТоваров.Организация КАК Организация,
		|	СписокТоваров.НалогообложениеНДС КАК НалогообложениеНДС,
		|	СписокТоваров.Склад КАК Склад
		|ИЗ
		|	СписокТоваров КАК СписокТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокТоваров.НоменклатураНабора   КАК НоменклатураНабора,
		|	СписокТоваров.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	СписокТоваров.Номенклатура КАК Номенклатура,
		|	СписокТоваров.Характеристика КАК Характеристика,
		|	СписокТоваров.Серия КАК Серия,
		|	СписокТоваров.Упаковка КАК Упаковка,
		|	СписокТоваров.Цена КАК Цена,
		|	СписокТоваров.ПодакцизныеТоварыДляКоммерческогоИспользования КАК ПодакцизныеТоварыДляКоммерческогоИспользования,
		|	СписокТоваров.ВидВозвратаЧерезКассу КАК ВидВозвратаЧерезКассу,
		|	СписокТоваров.СтавкаНДС КАК СтавкаНДС
		|ИЗ
		|	СписокТоваров КАК СписокТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КассоваяСмена.ОкончаниеКассовойСмены КАК ОкончаниеКассовойСмены
		|ИЗ
		|	Документ.КассоваяСмена КАК КассоваяСмена
		|ГДЕ КассоваяСмена.Ссылка = &КассоваяСмена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЧекиККМРеализации.ЧекККМ КАК ЧекККМ,
		|	МАКСИМУМ(ОтчетОРозничныхПродажах.Ссылка) КАК ДокументРеализации
		|	
		|ПОМЕСТИТЬ ДокументыРеализации
		|
		|ИЗ	
		|	(ВЫБРАТЬ
		|		ЧекиККМ.Ссылка КАК ЧекККМ,
		|		ЧекиККМ.Ссылка.ЧекККМ.КассоваяСмена КАК КассоваяСменаРеализации
		|	ИЗ
		|		ЧекиККМ КАК ЧекиККМ
		|	ГДЕ
		|		ЧекиККМ.Ссылка ССЫЛКА Документ.ЧекККМВозврат) КАК ЧекиККМРеализации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
		|			ПО ЧекиККМРеализации.КассоваяСменаРеализации = ОтчетОРозничныхПродажах.КассоваяСмена
		|
		|СГРУППИРОВАТЬ ПО
		|	ЧекиККМРеализации.ЧекККМ
		|";
			
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("КассоваяСмена", КассоваяСмена);
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		// Формирование таблиц индексов по аналитике и номенклатуре
		ТаблицаИндексовПоАналитике = МассивРезультатов[4].Выгрузить();
		ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ТаблицаИндексовПоАналитике,"Индекс");
		
		ТаблицаИндексовПоНоменклатуре = МассивРезультатов[5].Выгрузить();
		ОбщегоНазначенияУТ.ПронумероватьТаблицуЗначений(ТаблицаИндексовПоНоменклатуре,"Индекс");
		
		ВыборкаРеквизитыКассовойСмены = МассивРезультатов[6].Выбрать();
		ВыборкаРеквизитыКассовойСмены.Следующий();
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаИндексов.Индекс КАК ИндексПоАналитике,
		|	ТаблицаИндексов.Валюта КАК Валюта,
		|	ТаблицаИндексов.ВидЦены КАК ВидЦены,
		|	ТаблицаИндексов.КассаККМ КАК КассаККМ,
		|	ТаблицаИндексов.Организация КАК Организация,
		|	ТаблицаИндексов.НалогообложениеНДС КАК НалогообложениеНДС,
		|	ТаблицаИндексов.Склад КАК Склад
		|ПОМЕСТИТЬ ИндексыПоАналитике
		|ИЗ
		|	&ТаблицаИндексовПоАналитике КАК ТаблицаИндексов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Валюта,
		|	ВидЦены,
		|	КассаККМ,
		|	Организация,
		|	НалогообложениеНДС,
		|	Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаИндексов.Индекс КАК ИндексПоНоменклатуре,
		|	ТаблицаИндексов.НоменклатураНабора   КАК НоменклатураНабора,
		|	ТаблицаИндексов.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	ТаблицаИндексов.Номенклатура КАК Номенклатура,
		|	ТаблицаИндексов.Характеристика КАК Характеристика,
		|	ТаблицаИндексов.Серия КАК Серия,
		|	ТаблицаИндексов.Упаковка КАК Упаковка,
		|	ТаблицаИндексов.Цена КАК Цена,
		|	ТаблицаИндексов.ПодакцизныеТоварыДляКоммерческогоИспользования КАК ПодакцизныеТоварыДляКоммерческогоИспользования,
		|	ТаблицаИндексов.ВидВозвратаЧерезКассу КАК ВидВозвратаЧерезКассу,
		|	ТаблицаИндексов.СтавкаНДС КАК СтавкаНДС
		|ПОМЕСТИТЬ ИндексыПоНоменклатуре
		|ИЗ
		|	&ТаблицаИндексовПоНоменклатуре КАК ТаблицаИндексов
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НоменклатураНабора,
		|	ХарактеристикаНабора,
		|	Номенклатура,
		|	Характеристика,
		|	Серия,
		|	Упаковка,
		|	Цена,
		|	ПодакцизныеТоварыДляКоммерческогоИспользования,
		|	ВидВозвратаЧерезКассу,
		|	СтавкаНДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокТоваров.НоменклатураНабора   КАК НоменклатураНабора,
		|	СписокТоваров.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	СписокТоваров.Номенклатура КАК Номенклатура,
		|	СписокТоваров.Характеристика КАК Характеристика,
		|	СписокТоваров.Серия КАК Серия,
		|	СписокТоваров.Упаковка КАК Упаковка,
		|	СписокТоваров.Цена КАК Цена,
		|	СписокТоваров.Партнер КАК Партнер,
		|	СписокТоваров.Помещение КАК Помещение,
		|	СписокТоваров.Продавец КАК Продавец,
		|	СписокТоваров.СтавкаНДС КАК СтавкаНДС,
		|	СУММА(СписокТоваров.КоличествоУпаковок) КАК КоличествоУпаковок,
		|	СУММА(СписокТоваров.Количество) КАК Количество,
		|	СУММА(СписокТоваров.Сумма) КАК Сумма,
		|	СписокТоваров.СтатьяДекларацииПоАкцизномуНалогу КАК СтатьяДекларацииПоАкцизномуНалогу,
		|	СписокТоваров.ПодакцизныеТоварыДляКоммерческогоИспользования КАК ПодакцизныеТоварыДляКоммерческогоИспользования,
		|	СписокТоваров.ВидВозвратаЧерезКассу КАК ВидВозвратаЧерезКассу,
		|	СписокТоваров.ДокументРеализации КАК ДокументРеализации,
		|	ИндексыПоАналитике.ИндексПоАналитике КАК ИндексПоАналитике,
		|	ИндексыПоНоменклатуре.ИндексПоНоменклатуре КАК ИндексПоНоменклатуре,
		|	СписокТоваров.Склад КАК Склад,
		|	СписокТоваров.Валюта КАК Валюта,
		|	СписокТоваров.ВидЦены КАК ВидЦены,
		|	СписокТоваров.КассаККМ КАК КассаККМ,
		|	СписокТоваров.Организация КАК Организация,
		|	СписокТоваров.НалогообложениеНДС КАК НалогообложениеНДС
		|ИЗ
		|	(ВЫБРАТЬ
		|		СписокТоваров.НоменклатураНабора   КАК НоменклатураНабора,
		|		СписокТоваров.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|		СписокТоваров.Номенклатура КАК Номенклатура,
		|		СписокТоваров.Характеристика КАК Характеристика,
		|		СписокТоваров.Серия КАК Серия,
		|		СписокТоваров.Упаковка КАК Упаковка,
		|		СписокТоваров.Цена КАК Цена,
		|		СписокТоваров.Партнер КАК Партнер,
		|		СписокТоваров.Помещение КАК Помещение,
		|		СписокТоваров.Продавец КАК Продавец,
		|		СписокТоваров.СтавкаНДС КАК СтавкаНДС,
		|		СписокТоваров.КоличествоУпаковок КАК КоличествоУпаковок,
		|		СписокТоваров.Количество КАК Количество,
		|		СписокТоваров.Сумма КАК Сумма,
		|	    СписокТоваров.Номенклатура.СтатьяДекларацииПоАкцизномуНалогу КАК СтатьяДекларацииПоАкцизномуНалогу,
		|	    СписокТоваров.ПодакцизныеТоварыДляКоммерческогоИспользования КАК ПодакцизныеТоварыДляКоммерческогоИспользования,
		|		СписокТоваров.ВидВозвратаЧерезКассу КАК ВидВозвратаЧерезКассу,
		|		ЕстьNULL(ДокументыРеализации.ДокументРеализации, НЕОПРЕДЕЛЕНО) КАК ДокументРеализации,
		|		СписокТоваров.Склад КАК Склад,
		|		СписокТоваров.Валюта КАК Валюта,
		|		СписокТоваров.ВидЦены КАК ВидЦены,
		|		СписокТоваров.КассаККМ КАК КассаККМ,
		|		СписокТоваров.Организация КАК Организация,
		|		СписокТоваров.НалогообложениеНДС КАК НалогообложениеНДС
		|	ИЗ
		|		СписокТоваров КАК СписокТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыРеализации КАК ДокументыРеализации
		|		ПО СписокТоваров.Ссылка = ДокументыРеализации.ЧекККМ) КАК СписокТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоАналитике КАК ИндексыПоАналитике
		|		ПО СписокТоваров.Склад = ИндексыПоАналитике.Склад
		|			И СписокТоваров.Валюта = ИндексыПоАналитике.Валюта
		|			И СписокТоваров.ВидЦены = ИндексыПоАналитике.ВидЦены
		|			И СписокТоваров.КассаККМ = ИндексыПоАналитике.КассаККМ
		|			И СписокТоваров.Организация = ИндексыПоАналитике.Организация
		|			И СписокТоваров.НалогообложениеНДС = ИндексыПоАналитике.НалогообложениеНДС
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоНоменклатуре КАК ИндексыПоНоменклатуре
		|		ПО СписокТоваров.Номенклатура = ИндексыПоНоменклатуре.Номенклатура
		|			И СписокТоваров.НоменклатураНабора = ИндексыПоНоменклатуре.НоменклатураНабора
		|			И СписокТоваров.ХарактеристикаНабора = ИндексыПоНоменклатуре.ХарактеристикаНабора
		|			И СписокТоваров.Характеристика = ИндексыПоНоменклатуре.Характеристика
		|			И СписокТоваров.Серия = ИндексыПоНоменклатуре.Серия
		|			И СписокТоваров.Упаковка = ИндексыПоНоменклатуре.Упаковка
		|			И СписокТоваров.Цена = ИндексыПоНоменклатуре.Цена
		|			И СписокТоваров.ПодакцизныеТоварыДляКоммерческогоИспользования = ИндексыПоНоменклатуре.ПодакцизныеТоварыДляКоммерческогоИспользования
		|			И СписокТоваров.ВидВозвратаЧерезКассу = ИндексыПоНоменклатуре.ВидВозвратаЧерезКассу
		|			И СписокТоваров.СтавкаНДС = ИндексыПоНоменклатуре.СтавкаНДС
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокТоваров.НоменклатураНабора,
		|	СписокТоваров.ХарактеристикаНабора,
		|	СписокТоваров.Номенклатура,
		|	СписокТоваров.Характеристика,
		|	СписокТоваров.Серия,
		|	СписокТоваров.СтавкаНДС,
		|	СписокТоваров.Упаковка,
		|	СписокТоваров.Цена,
		|	СписокТоваров.Партнер,
		|	СписокТоваров.Помещение,
		|	СписокТоваров.Продавец,
		|	ИндексыПоНоменклатуре.СтавкаНДС,
		|	СписокТоваров.СтатьяДекларацииПоАкцизномуНалогу,
		|	СписокТоваров.ПодакцизныеТоварыДляКоммерческогоИспользования,
		|	СписокТоваров.ВидВозвратаЧерезКассу,
		|	СписокТоваров.ДокументРеализации,
		|	ИндексыПоАналитике.ИндексПоАналитике,
		|	ИндексыПоНоменклатуре.ИндексПоНоменклатуре,
		|	СписокТоваров.Склад,
		|	СписокТоваров.Валюта,
		|	СписокТоваров.ВидЦены,
		|	СписокТоваров.КассаККМ,
		|	СписокТоваров.Организация,
		|	СписокТоваров.НалогообложениеНДС
		|ИТОГИ
		|	МАКСИМУМ(НоменклатураНабора),
		|	МАКСИМУМ(ХарактеристикаНабора),
		|	МАКСИМУМ(Номенклатура),
		|	МАКСИМУМ(Характеристика),
		|	МАКСИМУМ(Серия),
		|	МАКСИМУМ(Упаковка),
		|	МАКСИМУМ(Цена),
		|	МАКСИМУМ(Партнер),
		|	МАКСИМУМ(Помещение),
		|	МАКСИМУМ(Продавец),
		|	МАКСИМУМ(СтавкаНДС),
		|	МАКСИМУМ(КоличествоУпаковок),
		|	МАКСИМУМ(Количество),
		|	МАКСИМУМ(Сумма),
		|	МАКСИМУМ(ПодакцизныеТоварыДляКоммерческогоИспользования),
		|	МАКСИМУМ(СтатьяДекларацииПоАкцизномуНалогу),
		|	МАКСИМУМ(ВидВозвратаЧерезКассу),
		|	МАКСИМУМ(Склад),
		|	МАКСИМУМ(Валюта),
		|	МАКСИМУМ(ВидЦены),
		|	МАКСИМУМ(КассаККМ),
		|	МАКСИМУМ(Организация),
		|	МАКСИМУМ(НалогообложениеНДС)
		|ПО
		|	ИндексПоАналитике,
		|	ИндексПоНоменклатуре
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОплатаПлатежнымиКартами.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
		|	ОплатаПлатежнымиКартами.НомерПлатежнойКарты КАК НомерПлатежнойКарты,
		|	ОплатаПлатежнымиКартами.КодАвторизации КАК КодАвторизации,
		|	СУММА(ОплатаПлатежнымиКартами.Сумма) КАК Сумма,
		|	ИндексыПоАналитике.ИндексПоАналитике КАК ИндексПоАналитике
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЧекККМОплатаПлатежнымиКартами.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
		|		ЧекККМОплатаПлатежнымиКартами.НомерПлатежнойКарты КАК НомерПлатежнойКарты,
		|		ЧекККМОплатаПлатежнымиКартами.КодАвторизации КАК КодАвторизации,
		|		ЧекККМОплатаПлатежнымиКартами.Сумма КАК Сумма,
		|		ЧекККМОплатаПлатежнымиКартами.Ссылка.КассаККМ КАК КассаККМ,
		|		ЧекККМОплатаПлатежнымиКартами.Ссылка.Организация КАК Организация,
		|		ЧекККМОплатаПлатежнымиКартами.Ссылка.Склад КАК Склад,
		|		ЧекККМОплатаПлатежнымиКартами.Ссылка.Валюта КАК Валюта,
		|		ЧекККМОплатаПлатежнымиКартами.Ссылка.ВидЦены КАК ВидЦены
		|	ИЗ
		|		Документ.ЧекККМ.ОплатаПлатежнымиКартами КАК ЧекККМОплатаПлатежнымиКартами
		|	ГДЕ
		|		ЧекККМОплатаПлатежнымиКартами.Ссылка В
		|				(ВЫБРАТЬ
		|					ЧекиККМ.Ссылка
		|				ИЗ
		|					ЧекиККМ КАК ЧекиККМ)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЧекККМВозвратОплатаПлатежнымиКартами.ЭквайринговыйТерминал,
		|		ЧекККМВозвратОплатаПлатежнымиКартами.НомерПлатежнойКарты,
		|		ЧекККМВозвратОплатаПлатежнымиКартами.КодАвторизации,
		|		-ЧекККМВозвратОплатаПлатежнымиКартами.Сумма,
		|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.КассаККМ,
		|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.Организация,
		|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.Склад,
		|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.Валюта,
		|		ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка.ВидЦены
		|	ИЗ
		|		Документ.ЧекККМВозврат.ОплатаПлатежнымиКартами КАК ЧекККМВозвратОплатаПлатежнымиКартами
		|	ГДЕ
		|		ЧекККМВозвратОплатаПлатежнымиКартами.ОплатаОтменена
		|		И ЧекККМВозвратОплатаПлатежнымиКартами.Ссылка В
		|				(ВЫБРАТЬ
		|					ЧекиККМ.Ссылка
		|				ИЗ
		|					ЧекиККМ КАК ЧекиККМ)) КАК ОплатаПлатежнымиКартами
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоАналитике КАК ИндексыПоАналитике
		|		ПО ОплатаПлатежнымиКартами.КассаККМ = ИндексыПоАналитике.КассаККМ
		|			И ОплатаПлатежнымиКартами.Организация = ИндексыПоАналитике.Организация
		|			И ОплатаПлатежнымиКартами.Склад = ИндексыПоАналитике.Склад
		|			И ОплатаПлатежнымиКартами.Валюта = ИндексыПоАналитике.Валюта
		|			И ОплатаПлатежнымиКартами.ВидЦены = ИндексыПоАналитике.ВидЦены
		|СГРУППИРОВАТЬ ПО
		|	ОплатаПлатежнымиКартами.ЭквайринговыйТерминал,
		|	ОплатаПлатежнымиКартами.НомерПлатежнойКарты,
		|	ОплатаПлатежнымиКартами.КодАвторизации,
		|	ИндексыПоАналитике.ИндексПоАналитике
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Серии.Помещение                      КАК Помещение,
		|	Серии.Серия                          КАК Серия,
		|	Серии.Номенклатура                   КАК Номенклатура,
		|	Серии.Характеристика                 КАК Характеристика,
		|	Серии.ВидВозвратаЧерезКассу          КАК ВидВозвратаЧерезКассу,
		|	СУММА(Серии.Количество)              КАК Количество,
		|	ИндексыПоАналитике.ИндексПоАналитике КАК ИндексПоАналитике
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЧекККМСерии.Помещение КАК Помещение,
		|		ЧекККМСерии.Серия КАК Серия,
		|		ЧекККМСерии.Номенклатура КАК Номенклатура,
		|		ЧекККМСерии.Характеристика КАК Характеристика,
		|		ЗНАЧЕНИЕ(Перечисление.ВидыВозвратовЧерезКассу.ВозвратВТекущуюСмену) КАК ВидВозвратаЧерезКассу,
		|		ЧекККМСерии.Количество КАК Количество,
		|		ЧекККМСерии.Ссылка.КассаККМ КАК КассаККМ,
		|		ЧекККМСерии.Ссылка.Организация КАК Организация,
		|		ЧекККМСерии.Ссылка.Склад КАК Склад,
		|		ЧекККМСерии.Ссылка.Валюта КАК Валюта,
		|		ЧекККМСерии.Ссылка.ВидЦены КАК ВидЦены
		|	ИЗ
		|		Документ.ЧекККМ.Серии КАК ЧекККМСерии
		|	ГДЕ
		|		ЧекККМСерии.Ссылка В
		|				(ВЫБРАТЬ
		|					ЧекиККМ.Ссылка
		|				ИЗ
		|					ЧекиККМ КАК ЧекиККМ
		|				)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЧекККМВозвратСерии.Помещение,
		|		ЧекККМВозвратСерии.Серия,
		|		ЧекККМВозвратСерии.Номенклатура,
		|		ЧекККМВозвратСерии.Характеристика,
		|		ЧекККМВозвратСерии.Ссылка.ВидВозвратаЧерезКассу,
		|		ВЫБОР
		|			КОГДА ЧекККМВозвратСерии.Ссылка.ВидВозвратаЧерезКассу = ЗНАЧЕНИЕ(Перечисление.ВидыВозвратовЧерезКассу.ВозвратНеЭтойСмены)
		|				ТОГДА ЧекККМВозвратСерии.Количество
		|			ИНАЧЕ -ЧекККМВозвратСерии.Количество
		|		КОНЕЦ,
		|		ЧекККМВозвратСерии.Ссылка.КассаККМ,
		|		ЧекККМВозвратСерии.Ссылка.Организация,
		|		ЧекККМВозвратСерии.Ссылка.Склад,
		|		ЧекККМВозвратСерии.Ссылка.Валюта,
		|		ЧекККМВозвратСерии.Ссылка.ВидЦены
		|	ИЗ
		|		Документ.ЧекККМВозврат.Серии КАК ЧекККМВозвратСерии
		|	ГДЕ
		|		ЧекККМВозвратСерии.Ссылка В
		|				(ВЫБРАТЬ
		|					ЧекиККМ.Ссылка
		|				ИЗ
		|					ЧекиККМ КАК ЧекиККМ
		|				)
		|) КАК Серии
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоАналитике КАК ИндексыПоАналитике
		|		ПО Серии.КассаККМ = ИндексыПоАналитике.КассаККМ
		|			И Серии.Организация = ИндексыПоАналитике.Организация
		|			И Серии.Склад = ИндексыПоАналитике.Склад
		|			И Серии.Валюта = ИндексыПоАналитике.Валюта
		|			И Серии.ВидЦены = ИндексыПоАналитике.ВидЦены
		|СГРУППИРОВАТЬ ПО
		|	Серии.Помещение,
		|	Серии.Серия,
		|	Серии.Номенклатура,
		|	Серии.Характеристика,
		|	Серии.ВидВозвратаЧерезКассу,
		|	ИндексыПоАналитике.ИндексПоАналитике
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПодарочныеСертификаты.ПодарочныйСертификат           КАК ПодарочныйСертификат,
		|	СУММА(ПодарочныеСертификаты.Количество)              КАК Количество,
		|	СУММА(ПодарочныеСертификаты.Сумма)                   КАК Сумма,
		|	СУММА(ПодарочныеСертификаты.СуммаВВалютеСертификата) КАК СуммаВВалютеСертификата,
		|	ИндексыПоАналитике.ИндексПоАналитике                 КАК ИндексПоАналитике
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЧекККМПодарочныеСертификаты.ПодарочныйСертификат    КАК ПодарочныйСертификат,
		|		1                                                   КАК Количество,
		|		ЧекККМПодарочныеСертификаты.Сумма                   КАК Сумма,
		|		ЧекККМПодарочныеСертификаты.СуммаВВалютеСертификата КАК СуммаВВалютеСертификата,
		|		ЧекККМПодарочныеСертификаты.Ссылка.КассаККМ КАК КассаККМ,
		|		ЧекККМПодарочныеСертификаты.Ссылка.Организация КАК Организация,
		|		ЧекККМПодарочныеСертификаты.Ссылка.Склад КАК Склад,
		|		ЧекККМПодарочныеСертификаты.Ссылка.Валюта КАК Валюта,
		|		ЧекККМПодарочныеСертификаты.Ссылка.ВидЦены КАК ВидЦены
		|	ИЗ
		|		Документ.ЧекККМ.ПодарочныеСертификаты КАК ЧекККМПодарочныеСертификаты
		|	ГДЕ
		|		ЧекККМПодарочныеСертификаты.Ссылка В
		|				(ВЫБРАТЬ
		|					ЧекиККМ.Ссылка
		|				ИЗ
		|					ЧекиККМ КАК ЧекиККМ)) КАК ПодарочныеСертификаты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоАналитике КАК ИндексыПоАналитике
		|		ПО ПодарочныеСертификаты.КассаККМ = ИндексыПоАналитике.КассаККМ
		|			И ПодарочныеСертификаты.Организация = ИндексыПоАналитике.Организация
		|			И ПодарочныеСертификаты.Склад = ИндексыПоАналитике.Склад
		|			И ПодарочныеСертификаты.Валюта = ИндексыПоАналитике.Валюта
		|			И ПодарочныеСертификаты.ВидЦены = ИндексыПоАналитике.ВидЦены
		|СГРУППИРОВАТЬ ПО
		|	ПодарочныеСертификаты.ПодарочныйСертификат,
		|	ИндексыПоАналитике.ИндексПоАналитике
		|ИМЕЮЩИЕ(СУММА(ПодарочныеСертификаты.Количество) <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИндексыПоАналитике.ИндексПоАналитике          КАК ИндексПоАналитике,
		|	БонусныеБаллы.БонуснаяПрограммаЛояльности     КАК БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.ДатаНачисления                  КАК ДатаНачисления,
		|	БонусныеБаллы.ДатаСписания                    КАК ДатаСписания,
		|	БонусныеБаллы.Партнер                         КАК Партнер,
		|	СУММА(БонусныеБаллы.СуммаБонусныхБаллов)      КАК СуммаБонусныхБаллов
		|ИЗ
		|(
		|ВЫБРАТЬ
		|	БонусныеБаллы.Ссылка.КассаККМ    КАК КассаККМ,
		|	БонусныеБаллы.Ссылка.Организация КАК Организация,
		|	БонусныеБаллы.Ссылка.Склад       КАК Склад,
		|	БонусныеБаллы.Ссылка.Валюта      КАК Валюта,
		|	БонусныеБаллы.Ссылка.ВидЦены     КАК ВидЦены,
		|	БонусныеБаллы.Ссылка.Партнер     КАК Партнер,
		
		|	БонусныеБаллы.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.ДатаНачисления              КАК ДатаНачисления,
		|	БонусныеБаллы.ДатаСписания                КАК ДатаСписания,
		|	БонусныеБаллы.СуммаБонусныхБаллов         КАК СуммаБонусныхБаллов
		|ИЗ
		|	Документ.ЧекККМ.БонусныеБаллы КАК БонусныеБаллы
		|ГДЕ
		|	БонусныеБаллы.Ссылка В
		|			(ВЫБРАТЬ
		|				ЧекиККМ.Ссылка
		|			ИЗ
		|				ЧекиККМ КАК ЧекиККМ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БонусныеБаллы.Ссылка.КассаККМ    КАК КассаККМ,
		|	БонусныеБаллы.Ссылка.Организация КАК Организация,
		|	БонусныеБаллы.Ссылка.Склад       КАК Склад,
		|	БонусныеБаллы.Ссылка.Валюта      КАК Валюта,
		|	БонусныеБаллы.Ссылка.ВидЦены     КАК ВидЦены,
		|	БонусныеБаллы.Ссылка.Партнер     КАК Партнер,
		
		|	БонусныеБаллы.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.ДатаНачисления              КАК ДатаНачисления,
		|	БонусныеБаллы.ДатаСписания                КАК ДатаСписания,
		|	-БонусныеБаллы.СуммаБонусныхБаллов        КАК СуммаБонусныхБаллов
		|ИЗ
		|	Документ.ЧекККМВозврат.БонусныеБаллы КАК БонусныеБаллы
		|ГДЕ
		|	БонусныеБаллы.Ссылка В
		|			(ВЫБРАТЬ
		|				ЧекиККМ.Ссылка
		|			ИЗ
		|				ЧекиККМ КАК ЧекиККМ)
		|) КАК БонусныеБаллы
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоАналитике КАК ИндексыПоАналитике
		|		ПО БонусныеБаллы.КассаККМ = ИндексыПоАналитике.КассаККМ
		|			И БонусныеБаллы.Организация = ИндексыПоАналитике.Организация
		|			И БонусныеБаллы.Склад = ИндексыПоАналитике.Склад
		|			И БонусныеБаллы.Валюта = ИндексыПоАналитике.Валюта
		|			И БонусныеБаллы.ВидЦены = ИндексыПоАналитике.ВидЦены
		|СГРУППИРОВАТЬ ПО
		|	ИндексыПоАналитике.ИндексПоАналитике,
		|	БонусныеБаллы.ДатаНачисления,
		|	БонусныеБаллы.ДатаСписания,
		|	БонусныеБаллы.БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.Партнер
		|ИМЕЮЩИЕ
		|	СУММА(БонусныеБаллы.СуммаБонусныхБаллов) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИндексыПоАналитике.ИндексПоАналитике          КАК ИндексПоАналитике,
		|	БонусныеБаллы.БонуснаяПрограммаЛояльности     КАК БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.ДатаОплаты                  КАК ДатаОплаты,
		|	БонусныеБаллы.Партнер                         КАК Партнер,
		|	СУММА(БонусныеБаллы.СуммаБонусныхБаллов)      КАК СуммаБонусныхБаллов
		|ИЗ
		|(
		|ВЫБРАТЬ
		|	Таблица.Ссылка.КассаККМ    КАК КассаККМ,
		|	Таблица.Ссылка.Организация КАК Организация,
		|	Таблица.Ссылка.Склад       КАК Склад,
		|	Таблица.Ссылка.Валюта      КАК Валюта,
		|	Таблица.Ссылка.ВидЦены     КАК ВидЦены,
		|	Таблица.Ссылка.Партнер     КАК Партнер,
		|
		|	Таблица.Ссылка.КартаЛояльности.Владелец.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|	Таблица.Ссылка.Дата                                                 КАК ДатаОплаты,
		|	Таблица.СуммаБонусныхБалловКСписанию                                КАК СуммаБонусныхБаллов
		|ИЗ
		|	Документ.ЧекККМ.Товары КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка В
		|			(ВЫБРАТЬ
		|				ЧекиККМ.Ссылка
		|			ИЗ
		|				ЧекиККМ КАК ЧекиККМ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекККМВозврат.КассаККМ    КАК КассаККМ,
		|	ЧекККМВозврат.Организация КАК Организация,
		|	ЧекККМВозврат.Склад       КАК Склад,
		|	ЧекККМВозврат.Валюта      КАК Валюта,
		|	ЧекККМВозврат.ВидЦены     КАК ВидЦены,
		|	ЧекККМВозврат.Партнер     КАК Партнер,
		
		|	ЧекККМВозврат.КартаЛояльности.Владелец.БонуснаяПрограммаЛояльности КАК БонуснаяПрограммаЛояльности,
		|	ЧекККМВозврат.Дата                                                 КАК ДатаОплаты,
		|	-ЧекККМВозврат.СуммаБонусныхБалловКВозврату                        КАК СуммаБонусныхБаллов
		|ИЗ
		|	Документ.ЧекККМВозврат КАК ЧекККМВозврат
		|ГДЕ
		|	БонусныеБаллы.Ссылка В
		|			(ВЫБРАТЬ
		|				ЧекиККМ.Ссылка
		|			ИЗ
		|				ЧекиККМ КАК ЧекиККМ)
		|
		|) КАК БонусныеБаллы
		|
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИндексыПоАналитике КАК ИндексыПоАналитике
		|		ПО БонусныеБаллы.КассаККМ = ИндексыПоАналитике.КассаККМ
		|			И БонусныеБаллы.Организация = ИндексыПоАналитике.Организация
		|			И БонусныеБаллы.Склад = ИндексыПоАналитике.Склад
		|			И БонусныеБаллы.Валюта = ИндексыПоАналитике.Валюта
		|			И БонусныеБаллы.ВидЦены = ИндексыПоАналитике.ВидЦены
		|СГРУППИРОВАТЬ ПО
		|	ИндексыПоАналитике.ИндексПоАналитике,
		|	БонусныеБаллы.ДатаОплаты,
		|	БонусныеБаллы.БонуснаяПрограммаЛояльности,
		|	БонусныеБаллы.Партнер
		|ИМЕЮЩИЕ
		|	СУММА(БонусныеБаллы.СуммаБонусныхБаллов) <> 0
		|";
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("ТаблицаИндексовПоАналитике", ТаблицаИндексовПоАналитике);
		Запрос.УстановитьПараметр("ТаблицаИндексовПоНоменклатуре", ТаблицаИндексовПоНоменклатуре);
		
		Результат = Запрос.ВыполнитьПакет();
		
		ОплатаПлатежнымиКартами = Результат[3].Выгрузить(); // ТаблицаЗначений
		Серии                   = Результат[4].Выгрузить(); // ТаблицаЗначений
		ПодарочныеСертификаты   = Результат[5].Выгрузить(); // ТаблицаЗначений
		БонусныеБаллы           = Результат[6].Выгрузить(); // ТаблицаЗначений
		ОплатаБонуснымиБаллами  = Результат[7].Выгрузить(); // ТаблицаЗначений
	
		ОплатаПлатежнымиКартами.Индексы.Добавить("ИндексПоАналитике");
		Серии.Индексы.Добавить("ИндексПоАналитике");
		ПодарочныеСертификаты.Индексы.Добавить("ИндексПоАналитике");
		БонусныеБаллы.Индексы.Добавить("ИндексПоАналитике");
		ОплатаБонуснымиБаллами.Индексы.Добавить("ИндексПоАналитике");
		
		ВыборкаПоАналитике = Результат[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если ВыборкаПоАналитике.Количество() > 1 Тогда
			ВызватьИсключение НСтр("ru='По кассовой смене зарегистрировано несколько аналитик. Создание отчета о розничных продажах невозможно';uk='По касовій зміні зареєстровано кілька аналітик. Створення звіту про роздрібні продажі неможливо'");
		КонецЕсли;
		
		// Очистим табличные части документа.
		ОтчетОРозничныхПродажахОбъект.Товары.Очистить();
		ОтчетОРозничныхПродажахОбъект.Серии.Очистить();
		ОтчетОРозничныхПродажахОбъект.ОплатаПлатежнымиКартами.Очистить();
		ОтчетОРозничныхПродажахОбъект.ВидыЗапасов.Очистить();
		ОтчетОРозничныхПродажахОбъект.ПодарочныеСертификаты.Очистить();
		ОтчетОРозничныхПродажахОбъект.НачислениеБонусныхБаллов.Очистить();
		ОтчетОРозничныхПродажахОбъект.ОплатаБонуснымиБаллами.Очистить();
	
		Пока ВыборкаПоАналитике.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(ОтчетОРозничныхПродажахОбъект, ВыборкаПоАналитике);
			
			ВыборкаПоАналитикеНоменклатуры = ВыборкаПоАналитике.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоАналитикеНоменклатуры.Следующий() Цикл
				
				ВыборкаДетальныеЗаписи = ВыборкаПоАналитикеНоменклатуры.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					Если ВыборкаДетальныеЗаписи.Количество <> 0 Тогда
						
						СтрокаТабличнойЧастиТовары = ОтчетОРозничныхПродажахОбъект.Товары.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧастиТовары, ВыборкаДетальныеЗаписи);
						СтрокаТабличнойЧастиТовары.Цена = Окр(СтрокаТабличнойЧастиТовары.Сумма / СтрокаТабличнойЧастиТовары.КоличествоУпаковок, 15, 2);
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
			// Заполнение табличной части "Оплата платежными картами".
			МассивСтрок = ОплатаПлатежнымиКартами.НайтиСтроки(Новый Структура("ИндексПоАналитике", ВыборкаПоАналитике.ИндексПоАналитике));
			Для Каждого СтрокаТЧ Из МассивСтрок Цикл
				
				Если СтрокаТЧ.Сумма <> 0 Тогда
					СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.ОплатаПлатежнымиКартами.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);
				КонецЕсли;
				
			КонецЦикла;
			
			// Заполнение табличной части "Серии".
			МассивСтрок = Серии.НайтиСтроки(Новый Структура("ИндексПоАналитике", ВыборкаПоАналитике.ИндексПоАналитике));
			Для Каждого СтрокаТЧ Из МассивСтрок Цикл
				
				Если СтрокаТЧ.Количество <> 0 Тогда
					СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.Серии.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);
				КонецЕсли;
				
			КонецЦикла;
			
			// Заполнение табличной части "Подарочные сертификаты".
			МассивСтрок = ПодарочныеСертификаты.НайтиСтроки(Новый Структура("ИндексПоАналитике", ВыборкаПоАналитике.ИндексПоАналитике));
			Для Каждого СтрокаТЧ Из МассивСтрок Цикл
				
				Если СтрокаТЧ.Сумма <> 0 Тогда
					СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.ПодарочныеСертификаты.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);
				КонецЕсли;
				
			КонецЦикла;
			
			// Заполнение табличной части "БонусныеБаллы".
			МассивСтрок = БонусныеБаллы.НайтиСтроки(Новый Структура("ИндексПоАналитике", ВыборкаПоАналитике.ИндексПоАналитике));
			Для Каждого СтрокаТЧ Из МассивСтрок Цикл
				
				СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.НачислениеБонусныхБаллов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);
				
			КонецЦикла;
			
			// Заполнение табличной части "ОплатаБонуснымиБаллами".
			МассивСтрок = ОплатаБонуснымиБаллами.НайтиСтроки(Новый Структура("ИндексПоАналитике", ВыборкаПоАналитике.ИндексПоАналитике));
			Для Каждого СтрокаТЧ Из МассивСтрок Цикл
				
				СтрокаТабличнойЧасти = ОтчетОРозничныхПродажахОбъект.ОплатаБонуснымиБаллами.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтрокаТЧ);
				
			КонецЦикла;
			
			
			ОтчетОРозничныхПродажахОбъект.Дата            = ВыборкаРеквизитыКассовойСмены.ОкончаниеКассовойСмены;
			ОтчетОРозничныхПродажахОбъект.ЦенаВключаетНДС = ОтчетОРозничныхПродажахОбъект.ВидЦены.ЦенаВключаетНДС;
			ОтчетОРозничныхПродажахОбъект.КассоваяСмена   = КассоваяСмена;
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ПересчитатьСуммуНДСиАкцизногоНалога", ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(ОтчетОРозничныхПродажахОбъект));
			ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(ОтчетОРозничныхПродажахОбъект.Товары, СтруктураДействий, Неопределено);
			ОтчетОРозничныхПродажахОбъект.СуммаДокумента  = ЦенообразованиеКлиентСервер.ПолучитьСуммуДокумента(ОтчетОРозничныхПродажахОбъект.Товары, ОтчетОРозничныхПродажахОбъект.ЦенаВключаетНДС);
			
			ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(ОтчетОРозничныхПродажахОбъект);
			
			Если Не ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.Ответственный) Тогда
				ОтчетОРозничныхПродажахОбъект.Ответственный = Пользователи.ТекущийПользователь();
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.Подразделение) Тогда
				ОтчетОРозничныхПродажахОбъект.Подразделение = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(ОтчетОРозничныхПродажахОбъект.Ответственный, ОтчетОРозничныхПродажахОбъект.Подразделение);
			КонецЕсли;
			
			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(Документы.ОтчетОРозничныхПродажах.ПараметрыУказанияСерий(ОтчетОРозничныхПродажахОбъект));
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ОтчетОРозничныхПродажахОбъект, ПараметрыУказанияСерий);
			
			ДенежныеСредстваСервер.ЗаполнитьСтатьюДекларацииПоЕдиномуНалогу(ОтчетОРозничныхПродажахОбъект);
			ДенежныеСредстваСервер.ПересчетСуммыПоЕдиномуНалогу(ОтчетОРозничныхПродажахОбъект, ОтчетОРозничныхПродажахОбъект.СуммаДокумента);
			
			Если Не ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.НалогообложениеНДС) Тогда
				ПараметрыУчетаПоОрганизации = УчетНДСУП.ПараметрыУчетаПоОрганизации(
					ОтчетОРозничныхПродажахОбъект.Организация,
					ОтчетОРозничныхПродажахОбъект.Дата,
					ОтчетОРозничныхПродажахОбъект.Склад);
				ОтчетОРозничныхПродажахОбъект.НалогообложениеНДС = ПараметрыУчетаПоОрганизации.НалогообложениеНДСРозничнойПродажи;
			КонецЕсли;
			
			ОтчетОРозничныхПродажахЛокализация.ОбработкаЗаполнения(ОтчетОРозничныхПродажахОбъект, Неопределено, Ложь);
			
			Если ОтчетОРозничныхПродажахОбъект.Проведен Тогда
				ОтчетОРозничныхПродажахОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ОтчетОРозничныхПродажахОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
		КонецЦикла;
		
		// По кассовой смене не продано товара
		Если ВыборкаПоАналитике.Количество() = 0 Тогда
			
			ОтчетОРозничныхПродажахОбъект.Дата           = ВыборкаРеквизитыКассовойСмены.ОкончаниеКассовойСмены;
			ОтчетОРозничныхПродажахОбъект.КассоваяСмена  = КассоваяСмена;
			
			ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(ОтчетОРозничныхПродажахОбъект);
			
			// Заполняет отчет о розничных продажах данными по текущей кассовой смене.
			РеквизитыКассовойСмены = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КассоваяСмена, "КассаККМ, ФискальноеУстройство");
			Если ЗначениеЗаполнено(РеквизитыКассовойСмены.КассаККМ) Тогда
				СтруктуруСостояниеКассовойСмены = ПолучитьРеквизитыКассовойСменыНаДату(РеквизитыКассовойСмены.КассаККМ, ВыборкаРеквизитыКассовойСмены.ОкончаниеКассовойСмены);
			Иначе
				СтруктуруСостояниеКассовойСмены = ПолучитьРеквизитыКассовойСменыНаДату(РеквизитыКассовойСмены.ФискальноеУстройство, ВыборкаРеквизитыКассовойСмены.ОкончаниеКассовойСмены);
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ОтчетОРозничныхПродажахОбъект, СтруктуруСостояниеКассовойСмены, , "КассоваяСмена");
			
			Если Не ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.Ответственный) Тогда
				ОтчетОРозничныхПродажахОбъект.Ответственный = Пользователи.ТекущийПользователь();
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.Подразделение) Тогда
				ОтчетОРозничныхПродажахОбъект.Подразделение = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(ОтчетОРозничныхПродажахОбъект.Ответственный, ОтчетОРозничныхПродажахОбъект.Подразделение);
			КонецЕсли;
			
			ОтчетОРозничныхПродажахОбъект.СуммаДокумента = ЦенообразованиеКлиентСервер.ПолучитьСуммуДокумента(ОтчетОРозничныхПродажахОбъект.Товары, ОтчетОРозничныхПродажахОбъект.ЦенаВключаетНДС);
			
			ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(Документы.ОтчетОРозничныхПродажах.ПараметрыУказанияСерий(ОтчетОРозничныхПродажахОбъект));
			НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(ОтчетОРозничныхПродажахОбъект, ПараметрыУказанияСерий);
			
			ОтчетОРозничныхПродажахОбъект.СтатьяДекларацииПоЕдиномуНалогу = Неопределено;
			ОтчетОРозничныхПродажахОбъект.СуммаПоЕдиномуНалогу = 0;
			
			Если Не ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.НалогообложениеНДС) Тогда
				ПараметрыУчетаПоОрганизации = УчетНДСУП.ПараметрыУчетаПоОрганизации(
					ОтчетОРозничныхПродажахОбъект.Организация,
					ОтчетОРозничныхПродажахОбъект.Дата,
					ОтчетОРозничныхПродажахОбъект.Склад);
				ОтчетОРозничныхПродажахОбъект.НалогообложениеНДС = ПараметрыУчетаПоОрганизации.НалогообложениеНДСРозничнойПродажи;
			КонецЕсли;
			
			Если ОтчетОРозничныхПродажахОбъект.Проведен Тогда
				ОтчетОРозничныхПродажахОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ОтчетОРозничныхПродажахОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
		КонецЕсли;
		
		Возврат ОтчетОРозничныхПродажахОбъект.Ссылка;
		
	Исключение
		
		ОписаниеОшибки = НСтр("ru='При создании отчета о розничных продажах произошла ошибка.
|Дополнительное описание:
|%ДополнительноеОписание%'
|;uk='При створенні звіту про роздрібні продажі сталася помилка.
|Додатковий опис:
|%ДополнительноеОписание%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ДополнительноеОписание%", ИнформацияОбОшибке().Описание);
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Розничные продажи';uk='Роздрібні продажі'"), УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
		
		Возврат ?(ЗначениеЗаполнено(ОтчетОРозничныхПродажахОбъект.Ссылка), ОтчетОРозничныхПродажахОбъект.Ссылка, Неопределено);
		
	КонецПопытки;
	
КонецФункции 

// Выполняет закрытие кассовой смены.
//
// Параметры:
//  Объект - СправочникСсылка.КассыККМ, СправочникСсылка.ПодключаемоеОборудование - Касса ККМ.
//  ОшибкаПриСнятииZОтчета - Булево - Флаг, при закрытии смены возникла ошибка.
//  ОписаниеОшибки - Строка - Возвращаемое описание ошибки.
//
// Возвращаемое значение:
//  Массив - Массив созданных отчетов о розничных продажах.
//
Функция ВыполнитьОперациюЗакрытияКассовойСмены(Объект, ОшибкаПриСнятииZОтчета, ОписаниеОшибки = "") Экспорт
	
	МассивДокументов = Новый Массив;
	
	КассаККМФискальноеУстройство = РозничныеПродажи.КассаККМФискальноеУстройство(Объект);
	КассаККМ             = КассаККМФискальноеУстройство.КассаККМ;
	
	// Закрытие кассовой смены
	НачатьТранзакцию();
	Попытка
		
		КассоваяСмена = ЗакрытьКассовуюСмену(Объект, ОписаниеОшибки);
		Если КассоваяСмена = Неопределено Тогда
			ОтменитьТранзакцию();
			Возврат МассивДокументов;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(КассаККМ) Тогда
			ИнкассацияВыполнена = ВыполнитьАвтоматическуюИнкассациюДС(КассаККМ, ОшибкаПриСнятииZОтчета, ОписаниеОшибки);
			Если Не ИнкассацияВыполнена Тогда
				ОтменитьТранзакцию();
				Возврат МассивДокументов;
			КонецЕсли;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Розничные продажи';uk='Роздрібні продажі'",ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат МассивДокументов;
		
	КонецПопытки;
	
	Если ЗначениеЗаполнено(КассаККМ) Тогда
		
		// Удаление отложенных и чеков, по которым был зарезервирован товар.
		УдалитьОтложенныеЧеки(КассоваяСмена, ОписаниеОшибки);
		
		// Заполнение отчета о розничных продажах
		ОтчетОРозничныхПродажах = ЗаполнитьОтчетОРозничныхПродажахПоКассовойСмене(КассоваяСмена, ОписаниеОшибки);
		Если ОтчетОРозничныхПродажах = Неопределено Тогда
			Возврат МассивДокументов;
		КонецЕсли;
		
		// Архивация чеков ККМ
		Если Константы.ОперацияПриЗакрытииКассовойСмены.Получить() = Перечисления.ОперацииПриЗакрытииКассовойСмены.АрхивацияЧековККМ Тогда
			
			ПараметрыЗадания = Новый Структура;
			ПараметрыЗадания.Вставить("КассоваяСмена", КассоваяСмена);
			ПараметрыЗадания.Вставить("ОбработкаВыполнена", Ложь);
			
			ВыполнитьАрхивациюЧековККМ(ПараметрыЗадания);
			
		КонецЕсли;
		
		// Удаление чеков ККМ
		Если Константы.ОперацияПриЗакрытииКассовойСмены.Получить() = Перечисления.ОперацииПриЗакрытииКассовойСмены.УдалениеЧековККМ Тогда
			
			ПараметрыЗадания = Новый Структура;
			ПараметрыЗадания.Вставить("КассоваяСмена", КассоваяСмена);
			ПараметрыЗадания.Вставить("ОбработкаВыполнена", Ложь);
			
			ВыполнитьУдалениеЧековККМ(ПараметрыЗадания);
			
		КонецЕсли;
		
		МассивДокументов.Добавить(ОтчетОРозничныхПродажах);
		
	КонецЕсли;
	
	Возврат МассивДокументов;
	
КонецФункции

#КонецОбласти

#Область ПолучениеДанныхПродаж


#КонецОбласти

#Область ФункцииПроверкиСостоянияКассовойСмены

// Функция возвращает структуру, характеризующую состояние последней кассовой смены по кассе ККМ.
//
// Параметры:
//  Объект - СправочникСсылка.КассыККМ, СправочникСсылка.ПодключаемоеОборудование - Ссылка на кассу ККМ.
//
// Возвращаемое значение:
//  Структура - см. ОписаниеКассовойСмены
//
Функция ПолучитьСостояниеКассовойСмены(Объект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	КассаККМФискальноеУстройство = КассаККМФискальноеУстройство(Объект);
	ФискальноеУстройство = КассаККМФискальноеУстройство.ФискальноеУстройство;
	КассаККМ             = КассаККМФискальноеУстройство.КассаККМ;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассоваяСмена.Номер                      КАК НомерКассовойСмены,
	|	КассоваяСмена.Ссылка                     КАК КассоваяСмена,
	|	КассоваяСмена.Статус                     КАК СтатусКассовойСмены,
	|	КассоваяСмена.СтатусРегламентныхОпераций КАК СтатусРегламентныхОпераций,
	|	
	|	КассоваяСмена.Организация          КАК Организация,
	|	КассоваяСмена.КассаККМ             КАК КассаККМ,
	|	КассоваяСмена.ФискальноеУстройство КАК ФискальноеУстройство,
	|	
	|	ВЫБОР
	|		КОГДА КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СменаОткрыта,
	|	
	|	ВЫБОР
	|		КОГДА КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|			ТОГДА КассоваяСмена.НачалоКассовойСмены
	|		ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены
	|	КОНЕЦ КАК ДатаИзмененияСтатуса
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Проведен
	|	И ((КассоваяСмена.КассаККМ = &КассаККМ И &КассаККМ <> Неопределено)
	|	ИЛИ (КассоваяСмена.ФискальноеУстройство = &ФискальноеУстройство И &ФискальноеУстройство <> Неопределено))
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассоваяСмена.Дата УБЫВ,
	|	КассоваяСмена УБЫВ";
	
	Запрос.УстановитьПараметр("КассаККМ",             КассаККМ);
	Запрос.УстановитьПараметр("ФискальноеУстройство", ФискальноеУстройство);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ОписаниеКассовойСмены = ОписаниеКассовойСмены();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ОписаниеКассовойСмены, Выборка);
		
		Если (ТекущаяДатаСеанса() - ОписаниеКассовойСмены.ДатаИзмененияСтатуса >= 86400)
			И Выборка.СменаОткрыта Тогда
			ОписаниеКассовойСмены.Ошибка24Часа = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КассаККМ) Тогда
		ЗаполнитьОписаниеКассовойСменыПоКассеККМ(ОписаниеКассовойСмены, КассаККМ);
	КонецЕсли;
	
	Возврат ОписаниеКассовойСмены;
	
КонецФункции

// Функция возвращает структуру, характеризующую состояние кассовой смены на дату.
//
// Параметры:
//  Объект - СправочникСсылка.КассыККМ, СправочникСсылка.ПодключаемоеОборудование - Ссылка на кассу ККМ
//  ДатаВремя - Дата - Дата, на которую необходимо получить описание кассовой смены.
//
// Возвращаемое значение:
//  Структура - Структура описания кассовой смены.
//
Функция ПолучитьРеквизитыКассовойСменыНаДату(Объект, ДатаВремя) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	КассаККМФискальноеУстройство = КассаККМФискальноеУстройство(Объект);
	ФискальноеУстройство = КассаККМФискальноеУстройство.ФискальноеУстройство;
	КассаККМ             = КассаККМФискальноеУстройство.КассаККМ;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассоваяСмена.Номер  КАК НомерКассовойСмены,
	|	КассоваяСмена.Ссылка КАК КассоваяСмена,
	|	КассоваяСмена.Статус                     КАК СтатусКассовойСмены,
	|	КассоваяСмена.СтатусРегламентныхОпераций КАК СтатусРегламентныхОпераций,
	|	
	|	КассоваяСмена.Организация          КАК Организация,
	|	КассоваяСмена.КассаККМ             КАК КассаККМ,
	|	КассоваяСмена.ФискальноеУстройство КАК ФискальноеУстройство,
	|	
	|	ВЫБОР
	|		КОГДА КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СменаОткрыта,
	|	
	|	ВЫБОР
	|		КОГДА КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|			ТОГДА КассоваяСмена.НачалоКассовойСмены
	|		ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены
	|	КОНЕЦ КАК ДатаИзмененияСтатуса
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|					ТОГДА КассоваяСмена.НачалоКассовойСмены
	|				ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены
	|			КОНЕЦ) КАК ДатаИзмененияСтатуса,
	|		КассоваяСмена.КассаККМ КАК КассаККМ,
	|		КассоваяСмена.ФискальноеУстройство КАК ФискальноеУстройство
	|	ИЗ
	|		Документ.КассоваяСмена КАК КассоваяСмена
	|	ГДЕ
	|		КассоваяСмена.Проведен
	|		И ((КассоваяСмена.КассаККМ = &КассаККМ И &КассаККМ <> Неопределено)
	|		ИЛИ (КассоваяСмена.ФискальноеУстройство = &ФискальноеУстройство И &ФискальноеУстройство <> Неопределено))
	|		И ВЫБОР
	|				КОГДА КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|					ТОГДА КассоваяСмена.НачалоКассовойСмены
	|				ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены
	|			КОНЕЦ <= &ДатаВремя
	|	
	|	СГРУППИРОВАТЬ ПО
	|		КассоваяСмена.КассаККМ,
	|		КассоваяСмена.ФискальноеУстройство) КАК КассовыеСмены
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КассоваяСмена КАК КассоваяСмена
	|		ПО КассовыеСмены.КассаККМ = КассоваяСмена.КассаККМ
	|		 И КассовыеСмены.ФискальноеУстройство = КассоваяСмена.ФискальноеУстройство
	|			И КассоваяСмена.Проведен 
	|			И (КассовыеСмены.ДатаИзмененияСтатуса = ВЫБОР
	|				КОГДА КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|					ТОГДА КассоваяСмена.НачалоКассовойСмены
	|				ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены
	|			КОНЕЦ)
	|";
	
	Запрос.УстановитьПараметр("КассаККМ",             КассаККМ);
	Запрос.УстановитьПараметр("ФискальноеУстройство", ФискальноеУстройство);
	
	Запрос.УстановитьПараметр("ДатаВремя",            ДатаВремя);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ОписаниеКассовойСмены = ОписаниеКассовойСмены();
	
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ОписаниеКассовойСмены, Выборка);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КассаККМ) Тогда
		ЗаполнитьОписаниеКассовойСменыПоКассеККМ(ОписаниеКассовойСмены, КассаККМ);
	КонецЕсли;
	
	Возврат ОписаниеКассовойСмены;
	
КонецФункции

// Функция получает открытую кассовую смену по Кассе ККМ в заданный период.
// Используется для контроля пересечения кассовых смен.
// За один период может одновременно существовать только одна кассовая смена.
//
// Параметры:
//  Объект - СправочникСсылка.КассыККМ, СправочникСсылка.ПодключаемоеОборудование - Ссылка на кассу ККМ
//  КассоваяСмена - ДокументСсылка.КассоваяСмена - Ссылка на кассовую смену,
//                если указана, то проверяется наличие любой другой кассовой смены
//  НачалоКассовойСмены - Дата - Дата начала кассовой смены
//  ОкончаниеКассовойСмены - Дата - Дата окончания кассовой смены.
//
// Возвращаемое значение:
//  ДокументСсылка.КассоваяСмена - Открытая кассовая смена на заданный период. Или неопределено если открытой смены нет.
//
Функция ПолучитьОткрытуюКассовуюСмену(Объект, КассоваяСмена, НачалоКассовойСмены, ОкончаниеКассовойСмены) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	КассаККМФискальноеУстройство = КассаККМФискальноеУстройство(Объект);
	ФискальноеУстройство = КассаККМФискальноеУстройство.ФискальноеУстройство;
	КассаККМ             = КассаККМФискальноеУстройство.КассаККМ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассоваяСмена.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.НачалоКассовойСмены <= &НачалоКассовойСмены
	|	И ВЫБОР
	|			КОГДА КассоваяСмена.ОкончаниеКассовойСмены = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены >= &НачалоКассовойСмены
	|		КОНЕЦ
	|	И ((КассоваяСмена.КассаККМ = &КассаККМ И &КассаККМ <> Неопределено)
	|	ИЛИ (КассоваяСмена.ФискальноеУстройство = &ФискальноеУстройство И &ФискальноеУстройство <> Неопределено))
	|	И КассоваяСмена.Ссылка <> &КассоваяСмена
	|	И КассоваяСмена.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассоваяСмена.Ссылка
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	&ОкончаниеКассовойСмены <> ДАТАВРЕМЯ(1, 1, 1)
	|	И КассоваяСмена.НачалоКассовойСмены <= &ОкончаниеКассовойСмены
	|	И ВЫБОР
	|			КОГДА КассоваяСмена.ОкончаниеКассовойСмены = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КассоваяСмена.ОкончаниеКассовойСмены >= &ОкончаниеКассовойСмены
	|		КОНЕЦ
	|	И ((КассоваяСмена.КассаККМ = &КассаККМ И &КассаККМ <> Неопределено)
	|	ИЛИ (КассоваяСмена.ФискальноеУстройство = &ФискальноеУстройство И &ФискальноеУстройство <> Неопределено))
	|	И КассоваяСмена.Ссылка <> &КассоваяСмена
	|	И КассоваяСмена.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассоваяСмена.Ссылка
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	&ОкончаниеКассовойСмены = ДАТАВРЕМЯ(1, 1, 1)
	|	И КассоваяСмена.НачалоКассовойСмены >= &НачалоКассовойСмены
	|	И ((КассоваяСмена.КассаККМ = &КассаККМ И &КассаККМ <> Неопределено)
	|	ИЛИ (КассоваяСмена.ФискальноеУстройство = &ФискальноеУстройство И &ФискальноеУстройство <> Неопределено))
	|	И КассоваяСмена.Ссылка <> &КассоваяСмена
	|	И КассоваяСмена.Проведен
	|";
	
	Запрос.УстановитьПараметр("КассаККМ",               КассаККМ);
	Запрос.УстановитьПараметр("ФискальноеУстройство",   ФискальноеУстройство);
	
	Запрос.УстановитьПараметр("НачалоКассовойСмены",    НачалоКассовойСмены);
	Запрос.УстановитьПараметр("ОкончаниеКассовойСмены", ОкончаниеКассовойСмены);
	Запрос.УстановитьПараметр("КассоваяСмена",          КассоваяСмена);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Функция проверяет состояние кассовой смены на дату. Если смена не открыта - возвращается описание ошибки.
//
// Параметры:
//  КассоваяСмена - ДокументСсылка.КассоваяСмена - Ссылка на кассовую смену
//  Дата - Дата - Дата проверки
//  ОписаниеОшибки - Строка - Возвращаемое описание ошибки.
//
// Возвращаемое значение:
//  Булево - Истина, если на указанную дату кассовая смена открыта.
//
Функция СменаОткрыта(КассоваяСмена, Дата, ОписаниеОшибки = "") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СменаОткрыта = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КассоваяСмена.Статус                 КАК СтатусКассовойСмены,
	|	КассоваяСмена.НачалоКассовойСмены    КАК НачалоКассовойСмены,
	|	КассоваяСмена.ОкончаниеКассовойСмены КАК ОкончаниеКассовойСмены
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Проведен
	|	И КассоваяСмена.Ссылка = &КассоваяСмена";
	
	Запрос.УстановитьПараметр("КассоваяСмена", КассоваяСмена);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.СтатусКассовойСмены = Перечисления.СтатусыКассовойСмены.Открыта Тогда
			
			// Если смена открыта, то с момента открытия должно пройти не больше чем 24 часа.
			Если Дата - Выборка.НачалоКассовойСмены < 86400 Тогда
				
				СменаОткрыта = Истина;
				
			Иначе
				
				ОписаниеОшибки = ОписаниеОшибки24Часа();
				СменаОткрыта = Ложь;
				
			КонецЕсли;
			
		ИначеЕсли ЗначениеЗаполнено(Выборка.СтатусКассовойСмены) Тогда
			
			Если Выборка.ОкончаниеКассовойСмены >= Дата И Выборка.НачалоКассовойСмены <= Дата Тогда
				
				СменаОткрыта = Истина;
				
			Иначе
				
				ОписаниеОшибки = НСтр("ru='Кассовая смена закрыта.';uk='Касова зміна закрита.'");
				СменаОткрыта = Ложь;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		ОписаниеОшибки = НСтр("ru='Кассовая смена не открыта.';uk='Касова зміна не відкрита.'");
		СменаОткрыта = Ложь;
		
	КонецЕсли;
	
	Возврат СменаОткрыта;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыВнесенияИВыемкиДс

Функция ВыполнитьАвтоматическуюИнкассациюДС(КассаККМ, ОшибкаПриСнятииZОтчета, ОписаниеОшибки = "")
	
	Результат = Истина;
	
	Если Не ОшибкаПриСнятииZОтчета Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиРМККассыККМ.КассаККМ.Владелец                      КАК Организация,
		|	НастройкиРМККассыККМ.КассаККМ.ВалютаДенежныхСредств         КАК Валюта,
		|	НастройкиРМККассыККМ.КассаККМ                               КАК КассаККМ,
		|	ЕСТЬNULL(ДенежныеСредстваВКассахККМОстатки.СуммаОстаток, 0) КАК СуммаДокумента,
		|	НастройкиРМККассыККМ.АвтоматическаяИнкассация               КАК АвтоматическаяИнкассация
		|ИЗ
		|	Справочник.НастройкиРМК.КассыККМ КАК НастройкиРМККассыККМ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредстваВКассахККМ.Остатки(, КассаККМ = &КассаККМ) КАК ДенежныеСредстваВКассахККМОстатки
		|		ПО ДенежныеСредстваВКассахККМОстатки.КассаККМ = НастройкиРМККассыККМ.КассаККМ
		|ГДЕ
		|	НастройкиРМККассыККМ.КассаККМ = &КассаККМ
		|	И НастройкиРМККассыККМ.Ссылка.РабочееМесто = &РабочееМесто
		|";
		
		Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
		Запрос.УстановитьПараметр("РабочееМесто", МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента());
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Если Выборка.Следующий() И Выборка.АвтоматическаяИнкассация И Выборка.СуммаДокумента > 0 Тогда
			СоздатьДокументВыемкаДенежныхСредствИзКассыККМ(Выборка);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыОткрытияИЗакрытияКассовойСмены

// Функция возвращает текст описания ошибки заполнения отчета о розничных продажах.
//
Функция ПолучитьТекстОшибкиЗаполненияОтчета()
	
	Возврат НСтр("ru='Проверьте настройки розничного склада и кассы ККМ.';uk='Перевірте настройки роздрібного складу та каси ККМ.'");
	
КонецФункции

// Функция выполняет поиск отчета о розничных продажах по кассовой смене.
//
Функция НайтиОтчетОРозничныхПродажах(КассоваяСмена)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОтчетОРозничныхПродажах = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОтчетОРозничныхПродажах.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОтчетОРозничныхПродажах КАК ОтчетОРозничныхПродажах
	|ГДЕ
	|	ОтчетОРозничныхПродажах.КассоваяСмена = &КассоваяСмена";
	
	Запрос.УстановитьПараметр("КассоваяСмена", КассоваяСмена);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОтчетОРозничныхПродажах = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ОтчетОРозничныхПродажах;
	
КонецФункции

// Функция выполняет удаление отложенных чеков.
//
Функция УдалитьОтложенныеЧеки(КассоваяСмена, ОписаниеОшибки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Истина;
	
	НачатьТранзакцию();
	Попытка
		
		ВыборкаЧековККМ = ВыбратьОтложенныеЧекиККМДляУдаления(КассоваяСмена);
		
		Пока ВыборкаЧековККМ.Следующий() Цикл
			ЧекККМОбъект = ВыборкаЧековККМ.Ссылка.ПолучитьОбъект();
			ЧекККМОбъект.Удалить();
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Розничные продажи';uk='Роздрібні продажі'",ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Результат = Ложь;
		
		ОписаниеОшибки = НСтр("ru='При удалении отложенных чеков произошла ошибка.
|Дополнительное описание:
|%ДополнительноеОписание%'
|;uk='При вилученні відкладених чеків виникла помилка.
|Додатковий опис:
|%ДополнительноеОписание%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ДополнительноеОписание%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ФункцииПроверкиСостоянияКассовойСмены

Функция КассаККМФискальноеУстройство(Объект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ФискальноеУстройство = Неопределено;
	КассаККМ             = Неопределено;
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.КассыККМ") Тогда
		
		КассаККМ = Объект;
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КассыККМ.ПодключаемоеОборудование КАК ФискальноеУстройство
		|ИЗ
		|	Справочник.НастройкиРМК.КассыККМ КАК КассыККМ
		|ГДЕ
		|	КассыККМ.КассаККМ = &КассаККМ
		|	И НЕ КассыККМ.ИспользоватьБезПодключенияОборудования
		|	И КассыККМ.Ссылка.РабочееМесто = &РабочееМесто
		|");
		
		Запрос.УстановитьПараметр("КассаККМ",     КассаККМ);
		Запрос.УстановитьПараметр("РабочееМесто", МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента());
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		ФискальноеУстройство = Выборка.ФискальноеУстройство;
		
	Иначе
		
		ФискальноеУстройство = Объект;
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КассыККМ.КассаККМ КАК КассаККМ
		|ИЗ
		|	Справочник.НастройкиРМК.КассыККМ КАК КассыККМ
		|ГДЕ
		|	КассыККМ.ПодключаемоеОборудование = &ФискальноеУстройство
		|	И КассыККМ.Ссылка.РабочееМесто = &РабочееМесто
		|");
		
		Запрос.УстановитьПараметр("ФискальноеУстройство", ФискальноеУстройство);
		Запрос.УстановитьПараметр("РабочееМесто",         МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента());
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		
		КассаККМ = Выборка.КассаККМ;
		
	КонецЕсли;
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ФискальноеУстройство", ФискальноеУстройство);
	ВозвращаемоеЗначение.Вставить("КассаККМ",             КассаККМ);
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура ЗаполнитьОписаниеКассовойСменыПоКассеККМ(ОписаниеКассовойСмены, КассаККМ)
	
	РозничныеПродажиЛокализация.ЗаполнитьОписаниеКассовойСменыПоКассеККМ(ОписаниеКассовойСмены, КассаККМ);
	
КонецПроцедуры

// Функция-конструктор структуры состояния кассовой смены.
//
// Возвращаемое значение:
// 	Структура - содержит:
// * СистемаНалогообложения - ПеречислениеСсылка.ТипыСистемНалогообложенияККТ -
// * СерийныйНомерККМ - Строка -
// * СведенияООрганизации - Строка - 
// * НалогообложениеНДС - ПеречислениеСсылка.ТипыНалогообложенияНДС - 
// * ЦенаВключаетНДС - Булево - 
// * АдресСклада - Строка -
// * Склад - СправочникСсылка.Склады - 
// * Кассир - СправочникСсылка.Пользователи - 
// * ВидЦены - СправочникСсылка.ВидыЦен - 
// * ВалютаПредставление - Строка - 
// * Валюта - СправочникСсылка.Валюты - 
// * ФискальноеУстройство - СправочникСсылка.ПодключаемоеОборудование - 
// * КассаККМ - ОпределяемыйТип.КассаБПО - 
// * Организация - ОпределяемыйТип.ОрганизацияБПО - 
// * ОписаниеОшибки - Строка -
// * Ошибка24Часа - Булево -
// * СменаОткрыта - Булево -
// * НомерКассовойСмены - Строка - 
// * НаличностьВКассе - Неопределено -
// * КассоваяСмена - ДокументСсылка.КассоваяСмена - 
// * СтатусРегламентныхОпераций - ПеречислениеСсылка.СтатусыРегламентныхОперацийКассовойСмены - 
// * СтатусКассовойСмены - ПеречислениеСсылка.СтатусыКассовойСмены - 
// * ДатаИзмененияСтатуса - Дата - 
// 
Функция ОписаниеКассовойСмены()
	
	СостояниеКассовойСмены = Новый Структура;
	СостояниеКассовойСмены.Вставить("ДатаИзмененияСтатуса");
	СостояниеКассовойСмены.Вставить("СтатусКассовойСмены");
	СостояниеКассовойСмены.Вставить("СтатусРегламентныхОпераций");
	СостояниеКассовойСмены.Вставить("КассоваяСмена");
	СостояниеКассовойСмены.Вставить("НаличностьВКассе");
	СостояниеКассовойСмены.Вставить("НомерКассовойСмены");
	СостояниеКассовойСмены.Вставить("СменаОткрыта", Ложь);
	СостояниеКассовойСмены.Вставить("Ошибка24Часа", Ложь);
	СостояниеКассовойСмены.Вставить("ОписаниеОшибки", "");
	
	// Описание реквизитов кассовой смены
	СостояниеКассовойСмены.Вставить("Организация");
	СостояниеКассовойСмены.Вставить("КассаККМ");
	СостояниеКассовойСмены.Вставить("ФискальноеУстройство");
	
	СостояниеКассовойСмены.Вставить("Валюта");
	СостояниеКассовойСмены.Вставить("ВалютаПредставление");
	СостояниеКассовойСмены.Вставить("ВидЦены");
	СостояниеКассовойСмены.Вставить("Кассир");
	СостояниеКассовойСмены.Вставить("Склад");
	СостояниеКассовойСмены.Вставить("АдресСклада", "");
	СостояниеКассовойСмены.Вставить("ЦенаВключаетНДС");
	СостояниеКассовойСмены.Вставить("НалогообложениеНДС");
	
	// Прочее
	СостояниеКассовойСмены.Вставить("СведенияООрганизации");
	СостояниеКассовойСмены.Вставить("СерийныйНомерККМ",       "");
	
	Возврат СостояниеКассовойСмены;
	
КонецФункции

// Описание ошибки24 часа
// 
// Возвращаемое значение:
//  Строка - Описание ошибки
//
Функция ОписаниеОшибки24Часа() Экспорт
	
	Возврат НСтр("ru='С момента открытия кассовой смены истекло более 24 часов. Необходимо выполнить закрытие кассовой смены.';uk='З моменту відкриття касової зміни минуло більше 24 годин. Необхідно виконати закриття касової зміни.'");
	
КонецФункции

#КонецОбласти

#Область Прочее

// Заполнить реквизит формы "РеквизитыКассира".
//
// Параметры:
//  Кассир - СправочникСсылка.Пользователи - Кассир.
//
// Возвращаемое значение:
// Структура - содержит:
// 	Наименование - Строка - ФИО кассира.
// 
Функция РеквизитыКассира(Кассир) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Пользователи.ФизическоеЛицо.Наименование, """") КАК Наименование
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка = &Кассир");
	Запрос.УстановитьПараметр("Кассир", Кассир);
	
	РеквизитыКассира = Новый Структура;
	
	РеквизитыКассира.Вставить("Наименование", НСтр("ru='Администратор';uk='Адміністратор'"));
	
	ВыборкаРеквизитыКассира = Запрос.Выполнить().Выбрать();
	Если ВыборкаРеквизитыКассира.Следующий() Тогда
		
		Если ЗначениеЗаполнено(ВыборкаРеквизитыКассира.Наименование) Тогда
			РеквизитыКассира.Наименование = ВыборкаРеквизитыКассира.Наименование;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РеквизитыКассира;
	
КонецФункции

Функция ДобавитьЭлемент(Форма, ИмяКоманды, Родитель, Индекс)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Элементы, ИмяКоманды) Тогда
		Возврат Форма.Элементы[ИмяКоманды];
	КонецЕсли;
	НоваяКнопка = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Форма.Элементы[Родитель + Индекс]);
	
	Возврат НоваяКнопка;
	
КонецФункции

Функция ВыбратьОтложенныеЧекиККМДляУдаления(КассоваяСмена = Неопределено)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка,
	|	Документ.Дата КАК Дата,
	|	Документ.ОтложенДо КАК ОтложенДо,
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ПОМЕСТИТЬ ЧекиККМ
	|ИЗ
	|	Документ.ЧекККМ КАК Документ
	|ГДЕ
	|	Документ.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|	И (Документ.КассоваяСмена = &КассоваяСмена
	|			ИЛИ &КассоваяСмена = НЕОПРЕДЕЛЕНО)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Документ.Ссылка,
	|	Документ.Дата,
	|	Документ.КассоваяСмена.ОкончаниеКассовойСмены,
	|	Документ.КассоваяСмена
	|ИЗ
	|	Документ.ЧекККМВозврат КАК Документ
	|ГДЕ
	|	Документ.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|	И (Документ.КассоваяСмена = &КассоваяСмена
	|			ИЛИ &КассоваяСмена = НЕОПРЕДЕЛЕНО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЧекККМ.Ссылка
	|ИЗ
	|	ЧекиККМ КАК ЧекККМ
	|ГДЕ
	|	ЧекККМ.ОтложенДо <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ЧекККМ.ОтложенДо < &ТекущееВремя
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЧекККМ.Ссылка
	|ИЗ
	|	ЧекиККМ КАК ЧекККМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.КоличествоДнейХраненияОтложенныхЧеков КАК КоличествоДнейХраненияОтложенныхЧеков
	|		ПО (ИСТИНА)
	|ГДЕ
	|	КоличествоДнейХраненияОтложенныхЧеков.Значение > 0
	|	И ДОБАВИТЬКДАТЕ(ЧекККМ.Дата, ДЕНЬ, КоличествоДнейХраненияОтложенныхЧеков.Значение) < &ТекущееВремя
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЧекККМ.Ссылка
	|ИЗ
	|	ЧекиККМ КАК ЧекККМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.КоличествоДнейХраненияОтложенныхЧеков КАК КоличествоДнейХраненияОтложенныхЧеков
	|		ПО (ИСТИНА)
	|ГДЕ
	|	КоличествоДнейХраненияОтложенныхЧеков.Значение = 0
	|	И ЧекККМ.КассоваяСмена.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)");
	
	Запрос.УстановитьПараметр("КассоваяСмена", КассоваяСмена);
	Запрос.УстановитьПараметр("ТекущееВремя",  ТекущаяДатаСеанса());
	
	Результат = Запрос.Выполнить();
	Возврат Результат.Выбрать();
	
КонецФункции

Функция ПредставлениеУстройства(СтрокаТЧ)
	
	Представление = "";
	
	Если СтрокаТЧ.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток Тогда
		Представление = НСтр("ru='Весы с печатью этикеток';uk='Ваги з друком етикеток'");
	ИначеЕсли СтрокаТЧ.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ДисплейПокупателя Тогда
		Представление = НСтр("ru='Дисплей покупателя';uk='Дисплей покупця'");
	ИначеЕсли СтрокаТЧ.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККМОфлайн Тогда
		Представление = НСтр("ru='ККМ Offline';uk='ККМ Offlіne'");
	ИначеЕсли СтрокаТЧ.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СканерШтрихкода Тогда
		Представление = НСтр("ru='Сканер штрихкода';uk='Сканер штрихкода'");
	ИначеЕсли СтрокаТЧ.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.СчитывательМагнитныхКарт Тогда
		Представление = НСтр("ru='Считыватель магнитных карт';uk='Зчитувач магнітних карт'");
	ИначеЕсли СтрокаТЧ.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ТерминалСбораДанных Тогда
		Представление = НСтр("ru='Терминал сбора данных';uk='Термінал збору даних'");
	ИначеЕсли СтрокаТЧ.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор Тогда
		Представление = НСтр("ru='Фискальный регистратор';uk='Фіскальний реєстратор'");
	ИначеЕсли СтрокаТЧ.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал Тогда
		Представление = НСтр("ru='Эквайринговый терминал';uk='Еквайринговий термінал'");
	ИначеЕсли СтрокаТЧ.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ЭлектронныеВесы Тогда
		Представление = НСтр("ru='Электронные весы';uk='Електронні ваги'");
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

// Заполнить таблицу оборудование на форме
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма, содержит в том числе:
//  	* Оборудование - ТаблицаЗначений - 
//  ПоддерживаемыеТипыПодключаемогоОборудования - Строка - Поддерживаемые типы оборудования.
//
Процедура ЗаполнитьТаблицуОборудование(Форма, ПоддерживаемыеТипыПодключаемогоОборудования) Экспорт
	
	ТипыПО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПоддерживаемыеТипыПодключаемогоОборудования, ",", Истина, Истина);
	
	РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
	СписокОборудования = МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам(
		ТипыПО,
		Неопределено,
		РабочееМесто);
	
	Для Каждого СтрокаТЧ Из СписокОборудования Цикл
		Если СтрокаТЧ.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ФискальныйРегистратор
			Или СтрокаТЧ.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ
			Или СтрокаТЧ.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ПринтерЧеков Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Форма.Оборудование.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		НоваяСтрока.Подключено    = 1;
		НоваяСтрока.Представление = ПредставлениеУстройства(НоваяСтрока);
	КонецЦикла;
	
	Если ТипыПО.Найти("ФискальныйРегистратор") <> Неопределено Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КассыККМ.КассаККМ КАК Объект,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ФискальныйРегистратор) КАК ТипОборудования,
		|	КассыККМ.ПодключаемоеОборудование КАК Ссылка
		|ИЗ
		|	Справочник.НастройкиРМК.КассыККМ КАК КассыККМ
		|ГДЕ
		|	КассыККМ.Ссылка.РабочееМесто = &РабочееМесто
		|	И КассыККМ.КассаККМ.ТипКассы = ЗНАЧЕНИЕ(Перечисление.ТипыКассККМ.ФискальныйРегистратор)
		|	И НЕ КассыККМ.ИспользоватьБезПодключенияОборудования
		|");
		Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Форма.Оборудование.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Подключено    = 1;
			НоваяСтрока.Представление = ПредставлениеУстройства(НоваяСтрока);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ОбновлениеИнформационнойБазы


Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию_ВидыКонтактнойИнформации(Параметры) Экспорт
	
	ВидыКонтактнойИнформацииДляИзменения = Новый Массив;
	ВидыКонтактнойИнформацииДляИзменения.Добавить(Справочники.ВидыКонтактнойИнформации.EmailПартнера);
	ВидыКонтактнойИнформацииДляИзменения.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонПартнера);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Таблица.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка В (&ВидыКонтактнойИнформацииДляИзменения)
	|	И Не Таблица.РазрешитьВводНесколькихЗначений");
	Запрос.УстановитьПараметр("ВидыКонтактнойИнформацииДляИзменения", ВидыКонтактнойИнформацииДляИзменения);
	
	МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, МассивСсылок);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию_ВидыКонтактнойИнформации(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "Справочник.ВидыКонтактнойИнформации";
	МетаданныеОбъекта = Метаданные.Справочники.ВидыКонтактнойИнформации;
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
		
		Исключение
			
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru='Не удалось заблокировать справочник: %Справочник% по причине: %Причина%';uk='Не вдалося заблокувати довідник: %Справочник% по причині: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Справочник%", Выборка.Ссылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			                         УровеньЖурналаРегистрации.Предупреждение,
			                         МетаданныеОбъекта,
			                         Выборка.Ссылка,
			                         ТекстСообщения);
			
			Продолжить;
			
		КонецПопытки;
		
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Если СправочникОбъект = Неопределено Тогда
			
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			ЗафиксироватьТранзакцию();
			Продолжить;
			
		КонецЕсли;
		
		Если СправочникОбъект.РазрешитьВводНесколькихЗначений Тогда
			
			ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			ЗафиксироватьТранзакцию();
			Продолжить;
			
		КонецЕсли;
		
		СправочникОбъект.РазрешитьВводНесколькихЗначений = Истина;
		
		Попытка
			
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СправочникОбъект);
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru='Не удалось обработать справочник: %Справочник% по причине: %Причина%';uk='Не вдалося обробити довідник: %Справочник% по причині: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Справочник%", Выборка.Ссылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(),
			                         УровеньЖурналаРегистрации.Предупреждение,
			                         МетаданныеОбъекта,
			                         Выборка.Ссылка,
			                         ТекстСообщения);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = НЕ ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры


#КонецОбласти

#КонецОбласти

#КонецОбласти
