////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции, используемые в обработке ПечатьЭтикетокИЦенников
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриПодготовкеСтруктурыДанныхДляПечати(СтруктураНастроек, Режим, Запрос, ИсходныеДанные) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Модифицирует значение штрихкода для компоненты печати штрихкода
// 
// Параметры:
// 	ЗначениеШтрихкодаДляКомпоненты - Строка -Значения штрихкода, которое будет модифицировано
// 	ТипКода - Число - Тип штрихкода
Процедура ПриОпределенииЗначенияШтрихкодаДляКомпоненты(ЗначениеШтрихкодаДляКомпоненты, ТипКода) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

Процедура ПриПечати(КоллекцияПечатныхФорм, ПараметрыПечати, ОбъектыПечати) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

Функция ПолучитьПараметрыДляПечатиОбразца(Форма, Назначение, ТипКода, Контекст) Экспорт
	//++ Локализация
	//-- Локализация
КонецФункции

//++ Локализация
//-- Локализация

Процедура ПриПодготовкеСтруктурыДанныхНабора(Режим, СхемаКомпоновкиДанных, ТекстЗапроса) Экспорт
	
	//++ Локализация
	//-- Локализация
	Возврат;
	
КонецПроцедуры

Процедура МодификацияЗначенияШтрикодаКомпоненты(ЗначениеШтрихкода, ТипКода) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

//++ Локализация
//-- Локализация