
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗапускПриСтарте") Тогда
		Настройки = НСИССервер.ПолучитьНастройкиЗагрузок();
		Если НЕ (Настройки.ЗагружатьДанныеПриСтарте И ОбщегоНазначения.РазделениеВключено() И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() И Пользователи.РолиДоступны("НСИСИспользование")) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		НСИССервер.ВыполнитьОбновлениеДанныхРегламентноеЗадание();
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Закрыть();
КонецПроцедуры
