
////////////////////////////////////////////////////////////////////////////////
// Модуль "НакладныеВызовСервера", содержит процедуры и функции для
// оформления накладных.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Для переданной группировки возвращает параметры для открытия формы оформляемой по заказам накладной.
// см. НакладныеКлиент.ОткрытьФормуСозданныхДокументов.
//
// Параметры:
//  ГруппировкиРаспоряжений				 - Массив - содержит массивы групп распоряжений по которым необходимо создать документ
//  															см. НакладныеКлиент.ДанныеДляОформленияПоЗаказам.
//  ПараметрыФормыСозданныхДокументов	 - Структура - параметры для ОбщаяФорма.ФормаСозданныхДокументов.
//  СписокОшибок						 - Структура - список ошибок.
//  ПолеОшибки							 - Строка - значение, которое задается в свойстве Поле объекта СообщениеПользователю.
//
// Возвращаемое значение:
//  Структура - Структура с полями:
//  		ИмяФормы	 - Строка
//  		Параметры	 - Структура.
//
Функция ОформитьНакладныеПоЗаказам(ГруппировкиРаспоряжений, ПараметрыФормыСозданныхДокументов, СписокОшибок, ПолеОшибки) Экспорт
	
	Результат = НакладныеСервер.ОформитьНакладныеПоЗаказам(
		ГруппировкиРаспоряжений,
		ПараметрыФормыСозданныхДокументов,
		ПолеОшибки);
	
	СписокОшибок = Результат.СписокОшибок;
	Возврат Результат.ПараметрыСозданныхДокументов;
	
КонецФункции

// Для переданной группировки возвращает параметры для открытия формы переоформляемой по ордерам накладной.
// см. НакладныеКлиент.ОткрытьФормуСозданныхДокументов.
//
// Параметры:
//  ГруппировкиРаспоряжений				 - Массив - содержит массивы групп распоряжений по которым необходимо создать документ
//  															см. НакладныеКлиент.ДанныеДляОформленияПоОрдерам.
//  ПараметрыФормыСозданныхДокументов	 - Структура - параметры для ОбщаяФорма.ФормаСозданныхДокументов.
//  СписокОшибок						 - Структура - список ошибок.
//  ПолеОшибки							 - Строка - значение, которое задается в свойстве Поле объекта СообщениеПользователю.
//
// Возвращаемое значение:
//  Структура - Структура с полями:
//  		ИмяФормы	 - Строка
//  		Параметры	 - Структура.
//
Функция ОформитьНакладныеПоОрдерам(ГруппировкиРаспоряжений, ПараметрыФормыСозданныхДокументов, СписокОшибок, ПолеОшибки) Экспорт
	
	Результат = НакладныеСервер.ОформитьНакладныеПоОрдерам(
		ГруппировкиРаспоряжений,
		ПараметрыФормыСозданныхДокументов,
		ПолеОшибки);
	
	СписокОшибок = Результат.СписокОшибок;
	Возврат Результат.ПараметрыСозданныхДокументов;
	
КонецФункции

#КонецОбласти