////////////////////////////////////////////////////////////////////////////////
// ОбщийМодуль.КоммерческиеПредложенияДокументыКлиентЛокализация.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОбработчикиСобытийИзмененияЭлементовФормы

// См. КоммерческиеПредложенияДокументыКлиентПереопределяемый.ПриИзмененииНоменклатуры.
//
Процедура ПриИзмененииНоменклатуры(Форма, ТекущаяСтрока, ТекущийЭлемент, ТребуетсяСерверныйВызов) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область ПодборНоменклатуры

// См. КоммерческиеПредложенияДокументыКлиентПереопределяемый.ВыполнитьПодключаемуюКомандуИнтеграции.
//
Процедура ВыполнитьПодключаемуюКомандуИнтеграции(Команда, Форма, Объект) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

//++Локализация
//-- Локализация
