
#Область ПрограммныйИнтерфейс

// Выполняет заполнение регистров взаиморасчетов в новой архитектуре по переданной структуре параметров.
//
// Параметры:
//	- ОсновныеПараметры - Структура - Параметры пересчета, см. СтруктураПараметровЗаполненияВзаиморасчетов
//
Процедура ЗаполнитьОперативныеВзаиморасчеты(ОсновныеПараметры) Экспорт
	
	#Область ИнициализацияЗапросаИПеременных
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	ВалютаУправленческогоУчета     = Константы.ВалютаУправленческогоУчета.Получить();
	
	РеквизитыОбъектаРасчетов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОсновныеПараметры.ОбъектРасчетов,"ТипОбъектаРасчетов, Объект, Организация");
	РасчетыПоЗаказу = РеквизитыОбъектаРасчетов.ТипОбъектаРасчетов = Перечисления.ТипыОбъектовРасчетов.Заказ;
	Объект          = РеквизитыОбъектаРасчетов.Объект;
	Организация     = РеквизитыОбъектаРасчетов.Организация;
	
	//Если график исполнения в договоре, то вместо графика заказа будет уточняться график договора.
	//Если пользователь каким-то образом ввел заказы с графиками по такому договору, то все этапы таких заказов будут отнесены к графику договора
	//и закрываться будут по ФИФО независимо от привязки накладных к заказам
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		ГрафикИсполненияДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "ГрафикИсполненияДоговора");
		ГрафикВДоговоре = ЗначениеЗаполнено(ГрафикИсполненияДоговора);
	Иначе
		ГрафикИсполненияДоговора = Неопределено;
		ГрафикВДоговоре = ЛОЖЬ;
	КонецЕсли;
	
	РазмерПорцииЗаписи = РазмерПорцииЗаписи();
	ХозяйственныеОперацииНеОтгрузка = ХозяйственныеОперацииНеОтгрузка();
	
	//Хозяйственные операции для заполнения.
	ХозяйственныеОперации = Новый Соответствие; 
	ХозяйственныеОперации.Вставить("ПереносАванса", Перечисления.ХозяйственныеОперации.ПереносАванса);
	
	Если ОсновныеПараметры.ЭтоРасчетыСКлиентами Тогда
		
		ХозяйственныеОперации.Вставить("ЗачетАванса",             Перечисления.ХозяйственныеОперации.ЗачетАвансаКлиента);
		ХозяйственныеОперации.Вставить("ПогашениеЗадолженности",  Перечисления.ХозяйственныеОперации.ПогашениеЗадолженностиКлиента);
		ХозяйственныеОперации.Вставить("ВозвратАванса",           Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту);
		ХозяйственныеОперации.Вставить("ПереоценкаПоложительная", Перечисления.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль);
		ХозяйственныеОперации.Вставить("ПереоценкаОтрицательная", Перечисления.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток);
		ХозяйственныеОперации.Вставить("Планирование",            Перечисления.ХозяйственныеОперации.ПланированиеПоЗаказуКлиента);
		
		ИмяРегистраРасчетов = "РасчетыСКлиентамиПоСрокам";
		ИмяРегистраПланаОплат = "РасчетыСКлиентамиПланОплат";
		ИмяРегистраПланаОтгрузкиПоставки = "РасчетыСКлиентамиПланОтгрузок";
		
		ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
	Иначе
		
		ХозяйственныеОперации.Вставить("ЗачетАванса",             Перечисления.ХозяйственныеОперации.ЗачетАвансаПоставщику);
		ХозяйственныеОперации.Вставить("ПогашениеЗадолженности",  Перечисления.ХозяйственныеОперации.ПогашениеЗадолженностиПоставщику);
		ХозяйственныеОперации.Вставить("ВозвратАванса",           Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика);
		ХозяйственныеОперации.Вставить("ПереоценкаПоложительная", Перечисления.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток);
		ХозяйственныеОперации.Вставить("ПереоценкаОтрицательная", Перечисления.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль);
		ХозяйственныеОперации.Вставить("Планирование",            Перечисления.ХозяйственныеОперации.ПланированиеПоЗаказуПоставщику);
		
		ИмяРегистраРасчетов = "РасчетыСПоставщикамиПоСрокам";
		ИмяРегистраПланаОплат = "РасчетыСПоставщикамиПланОплат";
		ИмяРегистраПланаОтгрузкиПоставки = "РасчетыСПоставщикамиПланПоставок";
		
		ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком;
	КонецЕсли;
	
	ГлобальныеПеременные = ОбщегоНазначения.СкопироватьРекурсивно(ОсновныеПараметры);
	ГлобальныеПеременные.Вставить("ЕжедневнаяПереоценка", Ложь);
	//Для уточнения плана оплат - в переменной хранится последний момент времени плана оплат,
	//чтобы при добавлении записи в план оплат можно было сразу определить есть ли планы оплат с датой больше, чем добавляемая запись.
	ГлобальныеПеременные.Вставить("МаксимальныйПорядокПланаОплат", "");
	ГлобальныеПеременные.Вставить("ГрафикВДоговоре",               ГрафикВДоговоре);
	ГлобальныеПеременные.Вставить("ПорядокПереоценки",             Новый Соответствие);
	ГлобальныеПеременные.Вставить("РазмерПорцииЗаписи",            РазмерПорцииЗаписи);
	ГлобальныеПеременные.Вставить("Организация",                   Организация);
	ГлобальныеПеременные.Вставить("ХозяйственныеОперации",         ХозяйственныеОперации);
	ГлобальныеПеременные.Вставить("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	ГлобальныеПеременные.Вставить("ВалютаУправленческогоУчета",     ВалютаУправленческогоУчета);
	
	Запрос                         = Новый Запрос;
	Менеджер                       = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = Менеджер;
	
	Запрос.УстановитьПараметр("ОбъектРасчетов",             ГлобальныеПеременные.ОбъектРасчетов);
	Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам",  ГлобальныеПеременные.АналитикаУчетаПоПартнерам);
	Запрос.УстановитьПараметр("ВалютаРасчетов",             ГлобальныеПеременные.ВалютаРасчетов);
	Запрос.УстановитьПараметр("ЭтоРасчетыСКлиентами",       ГлобальныеПеременные.ЭтоРасчетыСКлиентами);
	Запрос.УстановитьПараметр("Регистратор",                ГлобальныеПеременные.Регистратор);
	ГлобальныеПеременные.Вставить("Порядок",Мин(ГлобальныеПеременные.ПорядокФакт, ГлобальныеПеременные.ПорядокПлан));
	Запрос.УстановитьПараметр("Порядок",                    ГлобальныеПеременные.Порядок);
	
	Если ЗначениеЗаполнено(ГлобальныеПеременные.Порядок) Тогда
		НачалоДняПорядкаФакт = Дата(Лев(ГлобальныеПеременные.ПорядокФакт,8));
		НачалоДняПорядка     = Дата(Лев(ГлобальныеПеременные.Порядок,8));
	Иначе
		НачалоДняПорядкаФакт = Дата(1,1,1,1,1,2);
		НачалоДняПорядка = Дата(1,1,1,1,1,2);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоДняПорядкаФакт",       НачалоДняПорядкаФакт);
	Запрос.УстановитьПараметр("НачалоДняПорядка",           НачалоДняПорядка);
	Запрос.УстановитьПараметр("Объект",                     РеквизитыОбъектаРасчетов.Объект);
	
	Запрос.УстановитьПараметр("ВалютаУпр",                  ВалютаУправленческогоУчета);
	Запрос.УстановитьПараметр("ВалютаРегл",                 ВалютаРегламентированногоУчета);
	ПорядокЗачетаПоДатеПлатежа = Константы.ПорядокЗачетаДокументовПоДатеОперации.Получить() = 1;
	Запрос.УстановитьПараметр("ПорядокЗачетаПоДатеПлатежа", ПорядокЗачетаПоДатеПлатежа);
	
	Запрос.УстановитьПараметр("Организация",                Организация);
	Запрос.УстановитьПараметр("ГрафикВДоговоре",            ГрафикВДоговоре);
	Запрос.УстановитьПараметр("ГрафикИсполненияДоговора",   ГрафикИсполненияДоговора);
	Запрос.УстановитьПараметр("РасчетыПоЗаказу",            РасчетыПоЗаказу);
	Запрос.УстановитьПараметр("РазмерПорцииЗаписи",         РазмерПорцииЗаписи);
	Запрос.УстановитьПараметр("ТипРасчетов",                ТипРасчетов);
	
	Запрос.УстановитьПараметр("СписокТиповЗаказов",         СписокТиповРегистраторовПланов());
	Запрос.УстановитьПараметр("НепересчитываемыеХО",        НепересчитываемыеХозяйственныеОперации());
	
	#КонецОбласти
	
	//Движения до начала пересчета и остатки.
	СформироватьВТДанныхРегистровДоНачалаРасчетов(Запрос, ГлобальныеПеременные);
	//Данные регистров с порядком меньше порядка начала расчета, далее дополняются.
	ТаблицаРасчетовПоСрокам     = ЗаписиДоНачалаРасчета(Запрос, ГлобальныеПеременные, ИмяРегистраРасчетов);
	ТаблицаПланОплат            = ЗаписиДоНачалаРасчета(Запрос, ГлобальныеПеременные, ИмяРегистраПланаОплат);
	ТаблицаПланОтгрузокПоставок = ЗаписиДоНачалаРасчета(Запрос, ГлобальныеПеременные, ИмяРегистраПланаОтгрузкиПоставки);

	//Движения после начала пересчета и остатки до начала пересчета для распределения.
	РасчетыОтгрузкиПоставки     = ПолучитьОтгрузкиПоставки(Запрос, ГлобальныеПеременные);
	Если ПорядокЗачетаПоДатеПлатежа Тогда
		РасчетыОтгрузкиПоставки.Индексы.Добавить("ЕстьОстаток, ПорядокЗачетаПоДатеПлатежа");
	КонецЕсли;
	
	//Учтены только приходы по заказам, графикам и предоплатным накладным.
	//Остальные расходы и приходы добавляются при распределении фактических взаиморасчетов.
	ПланыОплат                 = ПолучитьПланыОплат(Запрос, ГлобальныеПеременные);
	ПланыОтгрузокПоставок      = ПолучитьПланыОтгрузокПоставок(Запрос, ГлобальныеПеременные);
	РасчетыОплаты              = ПолучитьОплаты(Запрос, ГлобальныеПеременные);
	
	НужнаПереоценка = (ГлобальныеПеременные.ВалютаРасчетов <> ВалютаРегламентированногоУчета 
			ИЛИ ГлобальныеПеременные.ВалютаРасчетов <> ВалютаУправленческогоУчета)
		И РасчетыОтгрузкиПоставки.Количество() > 0
		И НЕ ОсновныеПараметры.НачальноеЗаполнение;
        
	Если НужнаПереоценка Тогда
		ДатаНачалаКурсов = Мин(РасчетыОтгрузкиПоставки[0].Период,
									?(РасчетыОплаты.Количество() > 0,
										РасчетыОплаты[0].Период,
										РасчетыОтгрузкиПоставки[0].Период));
		ТаблицаКурсовВалют = ПолучитьКурсыВалют(Запрос, ДатаНачалаКурсов, ГлобальныеПеременные);
		ГлобальныеПеременные.Вставить("ТаблицаКурсовВалют", ТаблицаКурсовВалют);
		
		ДокументыРасчетаКурсовыхРазниц = Документы.РасчетКурсовыхРазниц.ДокументыПереоценки(Организация,
			?(РасчетыОтгрузкиПоставки.Количество() > 0, РасчетыОтгрузкиПоставки[0].ДатаВозникновения, ТекущаяДатаСеанса()),
			ТекущаяДатаСеанса(),
			ГлобальныеПеременные.ЭтоРасчетыСКлиентами);
	КонецЕсли;
	
	ГлобальныеПеременные.Вставить("ДокументыРасчетаКурсовыхРазниц", ДокументыРасчетаКурсовыхРазниц);
	
	//Добавляем приходные записи планов отгрузок.
	Для Каждого Стр Из ПланыОтгрузокПоставок Цикл
		Если НЕ Стр.ПриходДобавлен Тогда
			НовСтр = ТаблицаПланОтгрузокПоставок.Добавить();
			НовСтр.ВидДвижения               = ВидДвиженияНакопления.Приход;
			НовСтр.ДокументРегистратор       = Стр.Регистратор;
			НовСтр.ДокументПлан              = Стр.Регистратор;
			НовСтр.Период                    = Стр.Период;
			НовСтр.ДатаВозникновения         = Стр.ДатаВозникновения;
			НовСтр.ДатаПлановогоПогашения    = Стр.ДатаПлановогоПогашения;
			НовСтр.Сумма                     = Стр.КОтгрузкеПоставке;
			НовСтр.ПорядокЗачета             = Стр.ПорядокОперации;
			НовСтр.ПорядокОперации           = Стр.ПорядокОперации;
		КонецЕсли;
	КонецЦикла;
	
	//Для определения курса корректировки реализации в минус.
	//Ключ     - ДокументСсылка.РеализациТоваровУслуг, ДокументСсылка.АктВыполненныхРабот
	//Значение - Структура
	//     * СуммаДокумента, СуммаДокументаРегл, СуммаДокументаУпр - нужны для определения среднего курса реализации при проведении корректировок.
	ДанныеНакладных = Новый Соответствие;
	ТаблицаДанныхНакладных = ПолучитьДанныеНакладных(Запрос);
	Для Каждого Строка Из ТаблицаДанныхНакладных Цикл
		ДанныеНакладных.Вставить(Строка.Накладная,
									СтруктураСумм(Строка.Сумма,
													Строка.СуммаРегл,
													Строка.СуммаУпр));
	КонецЦикла;
	ГлобальныеПеременные.Вставить("ДанныеНакладных", ДанныеНакладных);
	
	ЗаписейОплаты           = РасчетыОплаты.Количество();
	ЗаписейОтгрузкиПоставки = РасчетыОтгрузкиПоставки.Количество();
	ЗаписейОбработать       = ЗаписейОплаты + ЗаписейОтгрузкиПоставки;
	
	Индексы = Новый Структура;
	//Индекс текущей обрабатываемой строки отгрузок.
	Индексы.Вставить("ИндексОтгрузкиПоставки", 0);
	//Индекс текущей обрабатываемой строки оплат.
	Индексы.Вставить("ИндексОплаты", 0);
	
	//Для распределения копеек в рамках документа.
	ТекущийДокументОплаты           = Неопределено;
	ТекущийДокументОтгрузкиПоставки = Неопределено;
	
	//Сколько строк отгрузки пропущено для зачета корректировкой реализации.
	ПропускОтгрузкиПоставки = 0;
	
	#Область РасчетФактическойЗадолженности
	
	Пока Индексы.ИндексОплаты + Индексы.ИндексОтгрузкиПоставки < ЗаписейОбработать Цикл
		
		Если Индексы.ИндексОплаты <= ЗаписейОплаты - 1 И Индексы.ИндексОтгрузкиПоставки <= ЗаписейОтгрузкиПоставки - 1 Тогда 
			
			СтрокаОплаты           = РасчетыОплаты[Индексы.ИндексОплаты];
			СтрокаОтгрузкиПоставки = РасчетыОтгрузкиПоставки[Индексы.ИндексОтгрузкиПоставки];
			
			//Оплата раньше отгрузки.
			Если СтрокаОплаты.ПорядокОперации < СтрокаОтгрузкиПоставки.ПорядокОперации 
				//В пределах регистратора (при расчетах по накладным) должен происходить зачет аванса.
				ИЛИ СтрокаОплаты.Регистратор = СтрокаОтгрузкиПоставки.Регистратор Тогда
				
				//Накладную к корректировке не нашли, возвращаемся по стеку отгрузок/поставок и снимаем флаг Корректировка у оплаты.
				Если ПропускОтгрузкиПоставки <> 0 И СтрокаОплаты.ЭтоКорректировка Тогда
					ПересчитатьСуммыЕслиЭтоКорректировка(ГлобальныеПеременные, СтрокаОплаты);
					Индексы.ИндексОтгрузкиПоставки = Индексы.ИндексОтгрузкиПоставки - ПропускОтгрузкиПоставки;
					ПропускОтгрузкиПоставки = 0;
					Продолжить;
				КонецЕсли;
				
				//Приход предоплаты.
				Если НЕ СтрокаОплаты.ПриходДобавлен И СтрокаОтгрузкиПоставки.Сумма <> 0 Тогда
					ПересчитатьСуммыЕслиЭтоКорректировка(ГлобальныеПеременные, СтрокаОплаты);
					ДобавитьПриход(ГлобальныеПеременные, ТаблицаРасчетовПоСрокам, СтрокаОплаты, "Оплата");
				КонецЕсли;
				
				//Уменьшаем план отгрузки, если есть.
				Если НЕ СтрокаОтгрузкиПоставки.ПланОтгрузокПоставокСписан Тогда
					СписатьПланОтгрузкиПоставки(ГлобальныеПеременные, ТаблицаПланОтгрузокПоставок, СтрокаОтгрузкиПоставки, ПланыОтгрузокПоставок);
				КонецЕсли;
				
				Если СтрокаОтгрузкиПоставки.Сумма <> 0 Тогда
					
					//При порядке зачета по датам платежа могут быть документы отгрузки/поставки приоритетнее текущего
					//Поищем их и увеличим пропуск строк отгрузки поставки
					Если ПропускОтгрузкиПоставки = 0 И ПорядокЗачетаПоДатеПлатежа 
						И Индексы.ИндексОтгрузкиПоставки < ЗаписейОтгрузкиПоставки - 1 Тогда
						
						ПорядкиЗачета = РасчетыОтгрузкиПоставки.Скопировать(Новый Структура("ЕстьОстаток", ИСТИНА),"ПорядокЗачетаПоДатеПлатежа");
						ПорядкиЗачета.Сортировать("ПорядокЗачетаПоДатеПлатежа ВОЗР");
						СтрокаПорядков = РасчетыОтгрузкиПоставки.НайтиСтроки(Новый Структура("ЕстьОстаток, ПорядокЗачетаПоДатеПлатежа", ИСТИНА, ПорядкиЗачета[0].ПорядокЗачетаПоДатеПлатежа))[0];
						Индекс = РасчетыОтгрузкиПоставки.Индекс(СтрокаПорядков);
						
						Если Индекс <> Индексы.ИндексОтгрузкиПоставки Тогда
							ПропускОтгрузкиПоставки = Индекс - Индексы.ИндексОтгрузкиПоставки;
							Индексы.ИндексОтгрузкиПоставки = Индекс;
							Продолжить;
						КонецЕсли;
						
					КонецЕсли;
					
					//Переброс аванса на расчетный документ - накладную.
					НеОтгрузка = ХозяйственныеОперацииНеОтгрузка.Найти(СтрокаОтгрузкиПоставки.ХозяйственнаяОперация) <> Неопределено;
					ДвойнаяЗаписьНеНужна = НеОтгрузка;
					
					Если ТекущийДокументОплаты <> СтрокаОплаты.РасчетныйДокумент Тогда
						ПредоплатаРаспределеноРегл = 0;
						ПредоплатаРаспределеноУпр  = 0;
						ТекущийДокументОплаты      = СтрокаОплаты.РасчетныйДокумент;
					КонецЕсли;
					
					Если ТекущийДокументОтгрузкиПоставки <> СтрокаОтгрузкиПоставки.РасчетныйДокумент Тогда
						ДолгРаспределеноРегл       = 0;
						ДолгРаспределеноУпр        = 0;
						ТекущийДокументОтгрузкиПоставки = СтрокаОтгрузкиПоставки.РасчетныйДокумент;
					КонецЕсли;
					
					//Добавляем запись списания предоплаты.
					СуммаСписания = Мин(СтрокаОплаты.Сумма, СтрокаОтгрузкиПоставки.Сумма);
					
					//Возврат аванса с ручным курсом отражаем по курсу возврата. Взаимозачет всегда по своему курсу.
					Если (СтрокаОтгрузкиПоставки.ЭтоВозвратАванса И НЕ СтрокаОплаты.РучнойКурсРегл
							ИЛИ СтрокаОтгрузкиПоставки.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВзаимозачетЗадолженности)
						И СтрокаОтгрузкиПоставки.РучнойКурсРегл Тогда
						ПредоплатаРеглПредв = СтрокаОтгрузкиПоставки.СуммаРегл / СтрокаОтгрузкиПоставки.Сумма * СуммаСписания;
					//Остальные авансы по курсу аванса.
					Иначе
						ПредоплатаРеглПредв = СтрокаОплаты.СуммаРегл / СтрокаОплаты.Сумма * СуммаСписания;
					КонецЕсли;
					
					Если (СтрокаОтгрузкиПоставки.ЭтоВозвратАванса  И НЕ СтрокаОплаты.РучнойКурсУпр
							ИЛИ СтрокаОтгрузкиПоставки.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВзаимозачетЗадолженности)
						И СтрокаОтгрузкиПоставки.РучнойКурсУпр Тогда
						ПредоплатаУпрПредв = СтрокаОтгрузкиПоставки.СуммаУпр / СтрокаОтгрузкиПоставки.Сумма * СуммаСписания;
					Иначе
						ПредоплатаУпрПредв = СтрокаОплаты.СуммаУпр / СтрокаОплаты.Сумма * СуммаСписания;
					КонецЕсли;
					
					СуммаСписанияРегл = Окр(ПредоплатаРеглПредв + ПредоплатаРаспределеноРегл - Окр(ПредоплатаРаспределеноРегл, 2), 2);
					СуммаСписанияУпр  = Окр(ПредоплатаУпрПредв + ПредоплатаРаспределеноУпр - Окр(ПредоплатаРаспределеноУпр, 2), 2);
					
					Если СтрокаОтгрузкиПоставки.ПорядокОперации >= ГлобальныеПеременные.ПорядокФакт Тогда
						
						НовСтр_Предоплата_Расход                          = ТаблицаРасчетовПоСрокам.Добавить();
						НовСтр_Предоплата_Расход.ВидДвижения              = ВидДвиженияНакопления.Расход;
						НовСтр_Предоплата_Расход.ДокументРегистратор      = СтрокаОтгрузкиПоставки.Регистратор;
						НовСтр_Предоплата_Расход.ВалютаДокумента          = СтрокаОтгрузкиПоставки.ВалютаДокумента;
						НовСтр_Предоплата_Расход.Период                   = СтрокаОтгрузкиПоставки.Период;
						НовСтр_Предоплата_Расход.РасчетныйДокумент        = СтрокаОплаты.РасчетныйДокумент;
						НовСтр_Предоплата_Расход.ДатаВозникновения        = СтрокаОплаты.ДатаВозникновения;
						НовСтр_Предоплата_Расход.ДатаПлановогоПогашения   = Дата(1,1,1);
						НовСтр_Предоплата_Расход.ПорядокЗачета            = СтрокаОплаты.ПорядокЗачетаПоДатеПлатежа;
						НовСтр_Предоплата_Расход.ПорядокОперации          = СтрокаОтгрузкиПоставки.ПорядокОперации;
						НовСтр_Предоплата_Расход.СтатьяДвиженияДенежныхСредств = СтрокаОтгрузкиПоставки.СтатьяДвиженияДенежныхСредств;
						НовСтр_Предоплата_Расход.СвязанныйДокумент        = СтрокаОплаты.СвязанныйДокумент;
						
						НовСтр_Предоплата_Расход.КорОбъектРасчетов        = СтрокаОплаты.КорОбъектРасчетов;
						НовСтр_Предоплата_Расход.КорАналитикаУчетаПоПартнерам = СтрокаОплаты.КорАналитикаУчетаПоПартнерам;
						
						Если СтрокаОтгрузкиПоставки.Регистратор = СтрокаОплаты.Регистратор
							И ТипЗнч(СтрокаОтгрузкиПоставки.Регистратор) = Тип("ДокументСсылка.ОтчетКомиссионера")
							И СтрокаОплаты.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.УдержаниеВознагражденияКомиссионера Тогда
							ХозяйственнаяОперацияЗачетАванса = Перечисления.ХозяйственныеОперации.ЗачетВознагражденияОплатойКомиссионера;
						ИначеЕсли СтрокаОтгрузкиПоставки.Регистратор = СтрокаОплаты.Регистратор
							И ТипЗнч(СтрокаОтгрузкиПоставки.Регистратор) = Тип("ДокументСсылка.ОтчетКомитенту")
							И СтрокаОплаты.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.УдержаниеВознагражденияКомитентом Тогда
							ХозяйственнаяОперацияЗачетАванса = Перечисления.ХозяйственныеОперации.ЗачетВознагражденияОплатойКомитенту;
						ИначеЕсли СтрокаОтгрузкиПоставки.Регистратор = СтрокаОплаты.Регистратор
							И ТипЗнч(СтрокаОтгрузкиПоставки.Регистратор) = Тип("ДокументСсылка.ОтчетПоКомиссииМеждуОрганизациями")
							И (СтрокаОплаты.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.УдержаниеВознагражденияКомиссионера
								ИЛИ СтрокаОплаты.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗачетВознагражденияОплатойКомитенту) Тогда
							Если ГлобальныеПеременные.ЭтоРасчетыСКлиентами Тогда
								ХозяйственнаяОперацияЗачетАванса = Перечисления.ХозяйственныеОперации.ЗачетВознагражденияОплатойКомиссионера;
							Иначе
								ХозяйственнаяОперацияЗачетАванса = Перечисления.ХозяйственныеОперации.ЗачетВознагражденияОплатойКомитенту;
							КонецЕсли;
						Иначе
							ХозяйственнаяОперацияЗачетАванса = ХозяйственныеОперации["ЗачетАванса"];
						КонецЕсли;
						
						Если НеОтгрузка Тогда
							НовСтр_Предоплата_Расход.ХозяйственнаяОперация = СтрокаОтгрузкиПоставки.ХозяйственнаяОперация;
						Иначе
							НовСтр_Предоплата_Расход.ХозяйственнаяОперация = ХозяйственнаяОперацияЗачетАванса;
						КонецЕсли;
						
						НовСтр_Предоплата_Расход.Предоплата     = СуммаСписания;
						НовСтр_Предоплата_Расход.ПредоплатаРегл = СуммаСписанияРегл;
						НовСтр_Предоплата_Расход.ПредоплатаУпр  = СуммаСписанияУпр;
						
						Если НЕ ДвойнаяЗаписьНеНужна Тогда
							//Отражаем приход на сумму долга по курсу предоплаты.
							НовСтр_Долг_Приход = ТаблицаРасчетовПоСрокам.Добавить();
							ЗаполнитьЗначенияСвойств(НовСтр_Долг_Приход, НовСтр_Предоплата_Расход , ,"Предоплата, ПредоплатаУпр, ПредоплатаРегл, КорОбъектРасчетов, КорАналитикаУчетаПоПартнерам");
							
							НовСтр_Долг_Приход.ВидДвижения                   = ВидДвиженияНакопления.Приход;
							НовСтр_Долг_Приход.Период                        = СтрокаОтгрузкиПоставки.Период;
							НовСтр_Долг_Приход.ДатаВозникновения             = СтрокаОтгрузкиПоставки.Период;
							НовСтр_Долг_Приход.ДатаПлановогоПогашения        = СтрокаОтгрузкиПоставки.ДатаПлановогоПогашения;
							НовСтр_Долг_Приход.РасчетныйДокумент             = СтрокаОтгрузкиПоставки.Регистратор;
							НовСтр_Долг_Приход.ПорядокЗачета                 = СтрокаОтгрузкиПоставки.ПорядокЗачетаПоДатеПлатежа;
							НовСтр_Долг_Приход.ХозяйственнаяОперация         = СтрокаОтгрузкиПоставки.ХозяйственнаяОперация;
							//возврат ДС, статья должна быть
							НовСтр_Долг_Приход.СтатьяДвиженияДенежныхСредств = СтрокаОтгрузкиПоставки.СтатьяДвиженияДенежныхСредств;
							НовСтр_Долг_Приход.СвязанныйДокумент             = Неопределено;
							
							НовСтр_Долг_Приход.Долг                          = НовСтр_Предоплата_Расход.Предоплата;
							
							Если СтрокаОтгрузкиПоставки.РучнойКурсУпр ИЛИ СтрокаОтгрузкиПоставки.ЭтоВозвратАванса Тогда
								НовСтр_Долг_Приход.ДолгУпр                   = СтрокаОтгрузкиПоставки.КурсУпр * СуммаСписания;
							Иначе
								НовСтр_Долг_Приход.ДолгУпр                   = НовСтр_Предоплата_Расход.ПредоплатаУпр;
							КонецЕсли;
							Если СтрокаОтгрузкиПоставки.РучнойКурсРегл ИЛИ СтрокаОтгрузкиПоставки.ЭтоВозвратАванса Тогда
								НовСтр_Долг_Приход.ДолгРегл                  = СтрокаОтгрузкиПоставки.КурсРегл * СуммаСписания;
							Иначе
								НовСтр_Долг_Приход.ДолгРегл                  = НовСтр_Предоплата_Расход.ПредоплатаРегл;
							КонецЕсли;
							
							//Переносим предоплату на расчетный документ отгрузки.
							НовСтр_Долг_Расход = ТаблицаРасчетовПоСрокам.Добавить();
							ЗаполнитьЗначенияСвойств(НовСтр_Долг_Расход, НовСтр_Долг_Приход);
							НовСтр_Долг_Расход.ВидДвижения                   = ВидДвиженияНакопления.Расход;
							НовСтр_Долг_Расход.ХозяйственнаяОперация         = ХозяйственнаяОперацияЗачетАванса;
							НовСтр_Долг_Расход.ДатаПлановогоПогашения        = СтрокаОтгрузкиПоставки.ДатаПлановогоПогашения;
							НовСтр_Долг_Расход.РасчетныйДокумент             = СтрокаОтгрузкиПоставки.Регистратор;
							НовСтр_Долг_Расход.ДатаВозникновения             = СтрокаОтгрузкиПоставки.Период;
							НовСтр_Долг_Расход.ПорядокЗачета                 = СтрокаОтгрузкиПоставки.ПорядокЗачетаПоДатеПлатежа;
							НовСтр_Долг_Расход.ДокументРегистратор           = СтрокаОтгрузкиПоставки.Регистратор;
							НовСтр_Долг_Расход.СтатьяДвиженияДенежныхСредств = СтрокаОтгрузкиПоставки.СтатьяДвиженияДенежныхСредств;
							
							НовСтр_Долг_Расход.Долг                          = НовСтр_Предоплата_Расход.Предоплата;
							НовСтр_Долг_Расход.ДолгУпр                       = НовСтр_Предоплата_Расход.ПредоплатаУпр;
							НовСтр_Долг_Расход.ДолгРегл                      = НовСтр_Предоплата_Расход.ПредоплатаРегл;
							
						КонецЕсли;
					КонецЕсли;
					
					ПредоплатаРаспределеноРегл = ПредоплатаРаспределеноРегл + ПредоплатаРеглПредв;
					ПредоплатаРаспределеноУпр  = ПредоплатаРаспределеноУпр  + ПредоплатаУпрПредв;
					
					//Уменьшаем строку оплаты на сумму зачета
					СтрокаОплаты.Сумма         = СтрокаОплаты.Сумма     - СуммаСписания;
					СтрокаОплаты.СуммаРегл     = СтрокаОплаты.СуммаРегл - СуммаСписанияРегл;
					СтрокаОплаты.СуммаУпр      = СтрокаОплаты.СуммаУпр  - СуммаСписанияУпр;
					
					Если СтрокаОтгрузкиПоставки.РучнойКурсРегл И НЕ ДвойнаяЗаписьНеНужна
						И СтрокаОтгрузкиПоставки.Сумма <> 0 И СтрокаОтгрузкиПоставки.ПорядокОперации >= ГлобальныеПеременные.ПорядокФакт Тогда
						//Остаток должен быть уменьшен ровно на ту сумму, на которую уже сформирован приход в двойной записи.
						ДолгРеглПредв = НовСтр_Долг_Приход.ДолгРегл;
						//Остаток для переоценки может отличаться от остатка к приходованию.
						СтрокаОтгрузкиПоставки.СуммаРеглДляПереоценки = СтрокаОтгрузкиПоставки.СуммаРеглДляПереоценки - НовСтр_Долг_Расход.ДолгРегл;
					Иначе
						//Иначе пропорционально уменьшаем остаток строки.
						ДолгРеглПредв = СтрокаОтгрузкиПоставки.КурсРегл * СуммаСписания;
						СтрокаОтгрузкиПоставки.СуммаРеглДляПереоценки  = СтрокаОтгрузкиПоставки.СуммаРеглДляПереоценки - Окр(ДолгРеглПредв + ДолгРаспределеноРегл - Окр(ДолгРаспределеноРегл,2),2);
					КонецЕсли;
					
					Если СтрокаОтгрузкиПоставки.РучнойКурсУпр И НЕ ДвойнаяЗаписьНеНужна
						И СтрокаОтгрузкиПоставки.Сумма <> 0 И СтрокаОтгрузкиПоставки.ПорядокОперации >= ГлобальныеПеременные.ПорядокФакт Тогда
						ДолгУпрПредв = НовСтр_Долг_Приход.ДолгУпр;
						СтрокаОтгрузкиПоставки.СуммаУпрДляПереоценки  = СтрокаОтгрузкиПоставки.СуммаУпрДляПереоценки - НовСтр_Долг_Расход.ДолгУпр;
					Иначе
						ДолгУпрПредв = СтрокаОтгрузкиПоставки.КурсУпр * СуммаСписания;
						СтрокаОтгрузкиПоставки.СуммаУпрДляПереоценки  = СтрокаОтгрузкиПоставки.СуммаУпрДляПереоценки - Окр(ДолгУпрПредв + ДолгРаспределеноУпр - Окр(ДолгРаспределеноУпр,2),2);
					КонецЕсли;
					
					Если ГлобальныеПеременные.ДанныеНакладных[СтрокаОтгрузкиПоставки.Регистратор] = Неопределено Тогда
						ГлобальныеПеременные.ДанныеНакладных.Вставить(СтрокаОтгрузкиПоставки.Регистратор, СтруктураСумм());
					КонецЕсли;
					
					СтрокаОтгрузкиПоставки.Сумма     = СтрокаОтгрузкиПоставки.Сумма - СуммаСписания;
					СтрокаОтгрузкиПоставки.СуммаРегл = СтрокаОтгрузкиПоставки.СуммаРегл - Окр(ДолгРеглПредв + ДолгРаспределеноРегл - Окр(ДолгРаспределеноРегл,2),2);
					СтрокаОтгрузкиПоставки.СуммаУпр  = СтрокаОтгрузкиПоставки.СуммаУпр - Окр(ДолгУпрПредв + ДолгРаспределеноУпр - Окр(ДолгРаспределеноУпр,2),2);
					
					ДолгРаспределеноРегл = ДолгРаспределеноРегл + ДолгРеглПредв;
					ДолгРаспределеноУпр  = ДолгРаспределеноУпр  + ДолгУпрПредв;
					
					ДанныеНакладной                    = ГлобальныеПеременные.ДанныеНакладных[СтрокаОтгрузкиПоставки.Регистратор];
					ДанныеНакладной.СуммаДокумента     = ДанныеНакладной.СуммаДокумента     + СуммаСписания;
					ДанныеНакладной.СуммаДокументаРегл = ДанныеНакладной.СуммаДокументаРегл + СуммаСписанияРегл;
					ДанныеНакладной.СуммаДокументаУпр  = ДанныеНакладной.СуммаДокументаУпр  + СуммаСписанияУпр;
					
					//Уменьшаем график оплаты условной задолженности на сумму списания. Если это остаток, то платеж уже закрыл график.
					Если Не СтрокаОплаты.ЭтоОстаток Тогда
						ДобавитьЗаписьКРасчетуПланаОплат(ГлобальныеПеременные, СтрокаОплаты, -СуммаСписания, ПланыОплат);
					КонецЕсли;
					
					Если СтрокаОплаты.Сумма = 0 Тогда
						Индексы.ИндексОплаты = Индексы.ИндексОплаты + 1;
						Если Окр(СтрокаОплаты.СуммаРегл, 2) <> 0 ИЛИ Окр(СтрокаОплаты.СуммаУпр, 2) <> 0 Тогда
							ДобавитьЗаписьПереоценки(ГлобальныеПеременные, ТаблицаРасчетовПоСрокам, СтрокаОтгрузкиПоставки.Период,
								СтрокаОплаты, "Предоплата", -Окр(СтрокаОплаты.СуммаРегл, 2), -Окр(СтрокаОплаты.СуммаУпр, 2));
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				ДобавитьЗаписьКРасчетуПланаОплат(ГлобальныеПеременные, СтрокаОтгрузкиПоставки, СтрокаОтгрузкиПоставки.КОплате, ПланыОплат, СтрокаОтгрузкиПоставки.Регистратор);
					СтрокаОтгрузкиПоставки.КОплате = 0;
				
				Если СтрокаОтгрузкиПоставки.Сумма = 0 Тогда
					СтрокаОтгрузкиПоставки.ЕстьОстаток = ЛОЖЬ;
					Если ПропускОтгрузкиПоставки <> 0 Тогда
						Индексы.ИндексОтгрузкиПоставки = Индексы.ИндексОтгрузкиПоставки - ПропускОтгрузкиПоставки;
						ПропускОтгрузкиПоставки = 0;
					Иначе
						Индексы.ИндексОтгрузкиПоставки = Индексы.ИндексОтгрузкиПоставки + 1;
					КонецЕсли;
					Если СтрокаОтгрузкиПоставки.СуммаРеглДляПереоценки <> 0 ИЛИ СтрокаОтгрузкиПоставки.СуммаУпрДляПереоценки <> 0 Тогда
						ДобавитьЗаписьПереоценки(ГлобальныеПеременные, ТаблицаРасчетовПоСрокам, НачалоДня(СтрокаОтгрузкиПоставки.Период),
							СтрокаОтгрузкиПоставки, "Долг", -Окр(СтрокаОтгрузкиПоставки.СуммаРеглДляПереоценки, 2), -Окр(СтрокаОтгрузкиПоставки.СуммаУпрДляПереоценки, 2));
					КонецЕсли;
				КонецЕсли;
				
				//Если порядок зачета по дате платежа - возвращаемся к нужной строке.
				Если ПропускОтгрузкиПоставки <> 0 Тогда
					Индексы.ИндексОтгрузкиПоставки = Индексы.ИндексОтгрузкиПоставки - ПропускОтгрузкиПоставки;
					ПропускОтгрузкиПоставки = 0;
				КонецЕсли;
				
			//Отгрузка раньше оплаты.
			Иначе
				//Обычная оплата.
				Если НЕ СтрокаОплаты.ЭтоКорректировка Тогда
					
					//Добавляем строку прихода долга по отгрузке/поставке.
					Если НЕ СтрокаОтгрузкиПоставки.ПриходДобавлен И СтрокаОтгрузкиПоставки.Сумма <> 0 Тогда
						
						ПересчитатьСуммыЕслиЭтоКорректировка(ГлобальныеПеременные, СтрокаОтгрузкиПоставки);
						ДобавитьПриход(ГлобальныеПеременные, ТаблицаРасчетовПоСрокам, СтрокаОтгрузкиПоставки, "ОтгрузкаПоставка");
						
						Если Не СтрокаОтгрузкиПоставки.ЭтоОстаток Тогда
							//Уточняется план только на сумму по заказу.
							ДобавитьЗаписьКРасчетуПланаОплат(ГлобальныеПеременные, СтрокаОтгрузкиПоставки, -(СтрокаОтгрузкиПоставки.Сумма - СтрокаОтгрузкиПоставки.КОплате), ПланыОплат, СтрокаОтгрузкиПоставки.Заказ);
							//Добавляются записи плана на всю сумму включая уточнение и сверхзаказа.
							ДобавитьЗаписьКРасчетуПланаОплат(ГлобальныеПеременные, СтрокаОтгрузкиПоставки, СтрокаОтгрузкиПоставки.Сумма, ПланыОплат, СтрокаОтгрузкиПоставки.Регистратор);
						КонецЕсли;
					КонецЕсли;
					
					//Списываем план отгрузки если есть.
					Если НЕ СтрокаОтгрузкиПоставки.ПланОтгрузокПоставокСписан Тогда
						СписатьПланОтгрузкиПоставки(ГлобальныеПеременные, ТаблицаПланОтгрузокПоставок, СтрокаОтгрузкиПоставки, ПланыОтгрузокПоставок);
					КонецЕсли;
					
					Если СтрокаОтгрузкиПоставки.Сумма <> 0 Тогда
						
						//При порядке зачета по датам платежа могут быть документы отгрузки/поставки приобритетнее текущего
						//Поищем их и увеличим пропуск строк отгрузки поставки
						Если ПропускОтгрузкиПоставки = 0 И ПорядокЗачетаПоДатеПлатежа 
							И Индексы.ИндексОтгрузкиПоставки < ЗаписейОтгрузкиПоставки - 1 Тогда
							
							ПорядкиЗачета = РасчетыОтгрузкиПоставки.Скопировать(Новый Структура("ЕстьОстаток", ИСТИНА),"ПорядокЗачетаПоДатеПлатежа, ПорядокОперации");
							ПорядкиЗачета.Сортировать("ПорядокЗачетаПоДатеПлатежа ВОЗР");
							МинимальныйПорядок = СтрокаОтгрузкиПоставки.ПорядокЗачетаПоДатеПлатежа;
							Для Каждого СтрокаПорядка Из ПорядкиЗачета Цикл
								Если СтрокаПорядка.ПорядокОперации < СтрокаОплаты.ПорядокОперации Тогда
									МинимальныйПорядок = СтрокаПорядка.ПорядокЗачетаПоДатеПлатежа;
									Прервать;
								КонецЕсли;
							КонецЦикла;
							
							СтрокаПорядка = РасчетыОтгрузкиПоставки.НайтиСтроки(Новый Структура("ЕстьОстаток, ПорядокЗачетаПоДатеПлатежа", Истина, МинимальныйПорядок))[0];
							Индекс = РасчетыОтгрузкиПоставки.Индекс(СтрокаПорядка);
							
							Если Индекс <> Индексы.ИндексОтгрузкиПоставки Тогда
								ПропускОтгрузкиПоставки = Индекс - Индексы.ИндексОтгрузкиПоставки;
								Индексы.ИндексОтгрузкиПоставки = Индекс;
								Продолжить;
							КонецЕсли;
							
						КонецЕсли;
						
						//Переоценка накладной до даты оплаты.
						Если НужнаПереоценка Тогда
							ПереоценитьДолг(ГлобальныеПеременные, ТаблицаРасчетовПоСрокам, СтрокаОтгрузкиПоставки, СтрокаОплаты);
						КонецЕсли;
						
						//Если расчетный документ накладная изменился, то сбрасываем служебные реквизиты распределения копеек.
						Если ТекущийДокументОтгрузкиПоставки <> СтрокаОтгрузкиПоставки.РасчетныйДокумент Тогда
							ДолгРаспределеноРегл       = 0;
							ДолгРаспределеноУпр        = 0;
							ТекущийДокументОтгрузкиПоставки = СтрокаОтгрузкиПоставки.РасчетныйДокумент;
						КонецЕсли;
						
						//Добавляем строку погашения задолженности.
						СуммаСписания = Мин(СтрокаОплаты.Сумма, СтрокаОтгрузкиПоставки.Сумма);
						
						//Списываем долг по курсу аванса.
						Если СтрокаОплаты.Сумма = СуммаСписания Тогда
							ДолгРегл = СтрокаОплаты.СуммаРегл;
							ДолгУпр = СтрокаОплаты.СуммаУпр;
						Иначе
							ДолгРегл = Окр(СтрокаОплаты.СуммаРегл / СтрокаОплаты.Сумма,4) * СуммаСписания;
							ДолгУпр  = Окр(СтрокаОплаты.СуммаУпр / СтрокаОплаты.Сумма,4) * СуммаСписания;
						КонецЕсли;
						
						СуммаСписанияРегл = Окр(ДолгРегл + ДолгРаспределеноРегл - Окр(ДолгРаспределеноРегл,2),2);
						СуммаСписанияУпр = Окр(ДолгУпр + ДолгРаспределеноУпр - Окр(ДолгРаспределеноУпр,2),2);
						
						Если СтрокаОплаты.ПорядокОперации >= ГлобальныеПеременные.ПорядокФакт Тогда
						
							НовСтр_Долг_Расход = ТаблицаРасчетовПоСрокам.Добавить();
							НовСтр_Долг_Расход.ВидДвижения                   = ВидДвиженияНакопления.Расход;
							НовСтр_Долг_Расход.ДокументРегистратор           = СтрокаОплаты.Регистратор;
							//Взаимозачет считаем взаимозачетом
							Если СтрокаОплаты.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВзаимозачетЗадолженности
								ИЛИ СтрокаОплаты.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.УдержаниеВознагражденияКомиссионера
								ИЛИ СтрокаОплаты.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.УдержаниеВознагражденияКомитентом Тогда
								НовСтр_Долг_Расход.ХозяйственнаяОперация         = СтрокаОплаты.ХозяйственнаяОперация;
							Иначе
								НовСтр_Долг_Расход.ХозяйственнаяОперация         = ХозяйственныеОперации["ПогашениеЗадолженности"];
							КонецЕсли;
							НовСтр_Долг_Расход.ВалютаДокумента               = СтрокаОплаты.ВалютаДокумента;
							НовСтр_Долг_Расход.Период                        = СтрокаОплаты.Период;
							НовСтр_Долг_Расход.ПорядокОперации               = СтрокаОплаты.ПорядокОперации;
							НовСтр_Долг_Расход.СтатьяДвиженияДенежныхСредств = СтрокаОплаты.СтатьяДвиженияДенежныхСредств;
							НовСтр_Долг_Расход.РасчетныйДокумент             = СтрокаОтгрузкиПоставки.РасчетныйДокумент;
							НовСтр_Долг_Расход.ДатаВозникновения             = СтрокаОтгрузкиПоставки.ДатаВозникновения;
							НовСтр_Долг_Расход.ДатаПлановогоПогашения        = СтрокаОтгрузкиПоставки.ДатаПлановогоПогашения;
							НовСтр_Долг_Расход.ПорядокЗачета                 = СтрокаОтгрузкиПоставки.ПорядокЗачетаПоДатеПлатежа;
							
							НовСтр_Долг_Расход.Долг     = СуммаСписания;
							НовСтр_Долг_Расход.ДолгРегл = СуммаСписанияРегл;
							НовСтр_Долг_Расход.ДолгУпр  = СуммаСписанияУпр;
						
						КонецЕсли;
						
						ДолгРаспределеноРегл = ДолгРаспределеноРегл + ДолгРегл;
						ДолгРаспределеноУпр  = ДолгРаспределеноУпр + ДолгУпр;
						
						//Уменьшаем строку оплаты на зачтенную сумму.
						СтрокаОплаты.Сумма       = СтрокаОплаты.Сумма     - СуммаСписания;
						СтрокаОплаты.СуммаРегл   = СтрокаОплаты.СуммаРегл - СуммаСписанияРегл;
						СтрокаОплаты.СуммаУпр    = СтрокаОплаты.СуммаУпр  - СуммаСписанияУпр;
						
						//Уменьшаем строку отгрузки/поставки на зачтенную сумму.
						СтрокаОтгрузкиПоставки.Сумма     = СтрокаОтгрузкиПоставки.Сумма     - СуммаСписания;
						СтрокаОтгрузкиПоставки.СуммаРегл = СтрокаОтгрузкиПоставки.СуммаРегл - СуммаСписанияРегл;
						СтрокаОтгрузкиПоставки.СуммаУпр  = СтрокаОтгрузкиПоставки.СуммаУпр  - СуммаСписанияУпр;
						СтрокаОтгрузкиПоставки.СуммаРеглДляПереоценки = СтрокаОтгрузкиПоставки.СуммаРеглДляПереоценки - СуммаСписанияРегл;
						СтрокаОтгрузкиПоставки.СуммаУпрДляПереоценки = СтрокаОтгрузкиПоставки.СуммаУпрДляПереоценки - СуммаСписанияУпр;
						СтрокаОтгрузкиПоставки.КОплате   = СтрокаОтгрузкиПоставки.КОплате     - СуммаСписания;
						
						//Закрываем план оплаты накладной, которую зачли.
						ДобавитьЗаписьКРасчетуПланаОплат(ГлобальныеПеременные, СтрокаОплаты, -СуммаСписания, ПланыОплат, СтрокаОтгрузкиПоставки.РасчетныйДокумент);
						
						Если СтрокаОплаты.Сумма = 0 Тогда
							Индексы.ИндексОплаты = Индексы.ИндексОплаты + 1;
						КонецЕсли;
						
					КонецЕсли;
					
					Если СтрокаОтгрузкиПоставки.Сумма = 0 Тогда
						
						Если СтрокаОтгрузкиПоставки.КОплате > 0 Тогда
							ДобавитьЗаписьКРасчетуПланаОплат(ГлобальныеПеременные, СтрокаОтгрузкиПоставки, СтрокаОтгрузкиПоставки.КОплате, ПланыОплат, СтрокаОтгрузкиПоставки.РасчетныйДокумент);
						КонецЕсли;
						
						СтрокаОтгрузкиПоставки.ЕстьОстаток = ЛОЖЬ;
						
						Если ПропускОтгрузкиПоставки <> 0 Тогда
							Индексы.ИндексОтгрузкиПоставки = Индексы.ИндексОтгрузкиПоставки - ПропускОтгрузкиПоставки;
							ПропускОтгрузкиПоставки = 0;
						Иначе
							Индексы.ИндексОтгрузкиПоставки = Индексы.ИндексОтгрузкиПоставки + 1;
						КонецЕсли;
						
						Если СтрокаОтгрузкиПоставки.СуммаРеглДляПереоценки <> 0 ИЛИ СтрокаОтгрузкиПоставки.СуммаУпрДляПереоценки <> 0 Тогда
							ДобавитьЗаписьПереоценки(ГлобальныеПеременные, ТаблицаРасчетовПоСрокам, НачалоДня(СтрокаОплаты.Период),
								СтрокаОтгрузкиПоставки, "Долг", -Окр(СтрокаОтгрузкиПоставки.СуммаРеглДляПереоценки, 2), -Окр(СтрокаОтгрузкиПоставки.СуммаУпрДляПереоценки, 2));
						КонецЕсли;
					КонецЕсли;
					
					//Если порядок зачета по дате платежа - возвращаемся к нужной строке.
					Если ПропускОтгрузкиПоставки <> 0 Тогда
						Индексы.ИндексОтгрузкиПоставки = Индексы.ИндексОтгрузкиПоставки - ПропускОтгрузкиПоставки;
						ПропускОтгрузкиПоставки = 0;
					КонецЕсли;
					
				//Корректировка накладной в минус.
				Иначе
					
					//Если в таблице отгрузок/поставок еще не дошли до связанного документа, пропускаем текущий.
					Если (СтрокаОплаты.СвязанныйДокумент <> СтрокаОтгрузкиПоставки.Регистратор
						ИЛИ (СтрокаОплаты.СвязанныйДокумент = СтрокаОтгрузкиПоставки.Регистратор
								И СтрокаОтгрузкиПоставки.КОтгрузкеПоставке <> 0 
								И СтрокаОтгрузкиПоставки.Сумма = 0))
						И Индексы.ИндексОтгрузкиПоставки + 1 <= ЗаписейОтгрузкиПоставки - 1 Тогда
						
						ПропускОтгрузкиПоставки         = ПропускОтгрузкиПоставки + 1;
						Индексы.ИндексОтгрузкиПоставки  = Индексы.ИндексОтгрузкиПоставки + 1;
					
					//Если это корректировка и накладная еще не оплачена полностью, то расчетным документом должна являться накладная.
					ИначеЕсли СтрокаОплаты.СвязанныйДокумент = СтрокаОтгрузкиПоставки.Регистратор
						И СтрокаОтгрузкиПоставки.Сумма > 0 Тогда
						
						//Добавляем строку прихода по долгу для сторнируемой накладной.
						Если НЕ СтрокаОтгрузкиПоставки.ПриходДобавлен И СтрокаОтгрузкиПоставки.Сумма <> 0 Тогда
							ДобавитьПриход(ГлобальныеПеременные, ТаблицаРасчетовПоСрокам, СтрокаОтгрузкиПоставки, "ОтгрузкаПоставка");
							Если Не СтрокаОтгрузкиПоставки.ЭтоОстаток Тогда
								//Уточняем план заказа, если есть на сумму без учета сверхзаказа.
								ДобавитьЗаписьКРасчетуПланаОплат(ГлобальныеПеременные, СтрокаОтгрузкиПоставки, -(СтрокаОтгрузкиПоставки.Сумма - СтрокаОтгрузкиПоставки.КОплате), ПланыОплат, СтрокаОтгрузкиПоставки.Заказ);
								//Добавляем в планы график накладной на всю сумму.
								ДобавитьЗаписьКРасчетуПланаОплат(ГлобальныеПеременные, СтрокаОтгрузкиПоставки, СтрокаОтгрузкиПоставки.Сумма, ПланыОплат, СтрокаОтгрузкиПоставки.Регистратор);
							КонецЕсли;
						КонецЕсли;
						
						//Уменьшим план отгрузок и поставок, если есть.
						Если НЕ СтрокаОтгрузкиПоставки.ПланОтгрузокПоставокСписан Тогда
							СписатьПланОтгрузкиПоставки(ГлобальныеПеременные, ТаблицаПланОтгрузокПоставок, СтрокаОтгрузкиПоставки, ПланыОтгрузокПоставок);
						КонецЕсли;
						
						Если СтрокаОтгрузкиПоставки.Сумма <> 0 Тогда
						
							//Переоценка накладной до даты оплаты.
							Если НужнаПереоценка И НачалоМесяца(СтрокаОтгрузкиПоставки.ДатаВозникновения) < НачалоМесяца(СтрокаОплаты.ДатаВозникновения) Тогда
								ПереоценитьДолг(ГлобальныеПеременные, ТаблицаРасчетовПоСрокам, СтрокаОтгрузкиПоставки, СтрокаОплаты, Ложь);
							КонецЕсли;
							
							СуммаСторно  = Мин(СтрокаОтгрузкиПоставки.Сумма, СтрокаОплаты.Сумма);
							
							Если СтрокаОплаты.РучнойКурсРегл Тогда
								СуммаСторноРегл = СуммаСторно * СтрокаОплаты.СуммаРегл / СтрокаОплаты.Сумма;
							Иначе
								СуммаСторноРегл = СуммаСторно * 
									(ГлобальныеПеременные.ДанныеНакладных[СтрокаОплаты.СвязанныйДокумент].СуммаДокументаРегл 
										/ ГлобальныеПеременные.ДанныеНакладных[СтрокаОплаты.СвязанныйДокумент].СуммаДокумента);
							КонецЕсли;
									
							Если СтрокаОплаты.РучнойКурсУпр Тогда
								СуммаСторноУпр = СуммаСторно * СтрокаОплаты.СуммаУпр / СтрокаОплаты.Сумма;
							Иначе
								СуммаСторноУпр = СуммаСторно * 
									(ГлобальныеПеременные.ДанныеНакладных[СтрокаОплаты.СвязанныйДокумент].СуммаДокументаУпр 
										/ ГлобальныеПеременные.ДанныеНакладных[СтрокаОплаты.СвязанныйДокумент].СуммаДокумента);
							КонецЕсли;
							
							Если СтрокаОплаты.ПорядокОперации >= ГлобальныеПеременные.ПорядокФакт Тогда
							
								НовСтр_Сторно = ТаблицаРасчетовПоСрокам.Добавить();
								НовСтр_Сторно.ВидДвижения = ВидДвиженияНакопления.Расход;
								
								НовСтр_Сторно.ДокументРегистратор   = СтрокаОплаты.Регистратор;
								НовСтр_Сторно.РасчетныйДокумент     = СтрокаОтгрузкиПоставки.РасчетныйДокумент;
								НовСтр_Сторно.ХозяйственнаяОперация = СтрокаОплаты.ХозяйственнаяОперация;
								НовСтр_Сторно.ВалютаДокумента       = СтрокаОплаты.ВалютаДокумента;
								НовСтр_Сторно.СвязанныйДокумент     = СтрокаОплаты.СвязанныйДокумент;
								
								НовСтр_Сторно.Долг = СуммаСторно;
								НовСтр_Сторно.ДолгРегл = СуммаСторноРегл;
								НовСтр_Сторно.ДолгУпр = СуммаСторноУпр;
								
								НовСтр_Сторно.Период                   = СтрокаОплаты.Период;
								НовСтр_Сторно.ДатаПлановогоПогашения   = СтрокаОтгрузкиПоставки.ДатаПлановогоПогашения;
								НовСтр_Сторно.ДатаВозникновения        = СтрокаОтгрузкиПоставки.ДатаВозникновения;
								НовСтр_Сторно.ПорядокЗачета            = СтрокаОтгрузкиПоставки.ПорядокЗачетаПоДатеПлатежа;
								НовСтр_Сторно.ПорядокОперации          = СтрокаОплаты.ПорядокОперации;
								НовСтр_Сторно.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
							
							КонецЕсли;
							
							//Уменьшаем строку оплаты на сумму сторно.
							СтрокаОплаты.Сумма     = СтрокаОплаты.Сумма     - СуммаСторно;
							СтрокаОплаты.СуммаРегл = СтрокаОплаты.СуммаРегл - СуммаСторноРегл;
							СтрокаОплаты.СуммаУпр  = СтрокаОплаты.СуммаУпр  - СуммаСторноУпр;
							
							//Уменьшаем строку отгрузки на сумму сторно.
							СтрокаОтгрузкиПоставки.Сумма     = СтрокаОтгрузкиПоставки.Сумма     - СуммаСторно;
							СтрокаОтгрузкиПоставки.СуммаРегл = СтрокаОтгрузкиПоставки.СуммаРегл - СуммаСторноРегл; 
							СтрокаОтгрузкиПоставки.СуммаУпр  = СтрокаОтгрузкиПоставки.СуммаУпр  - СуммаСторноУпр;
							СтрокаОтгрузкиПоставки.СуммаРеглДляПереоценки = СтрокаОтгрузкиПоставки.СуммаРеглДляПереоценки - СуммаСторноРегл;
							СтрокаОтгрузкиПоставки.СуммаУпрДляПереоценки = СтрокаОтгрузкиПоставки.СуммаУпрДляПереоценки - СуммаСторноУпр;
							
							//Уменьшаем график оплаты накладной, если есть.
							ДобавитьЗаписьКРасчетуПланаОплат(ГлобальныеПеременные, СтрокаОплаты, -СуммаСторно, ПланыОплат, СтрокаОтгрузкиПоставки.РасчетныйДокумент);
							
							Если СтрокаОплаты.Сумма = 0 Тогда
								Индексы.ИндексОплаты = Индексы.ИндексОплаты + 1;
							Иначе
								//Остатка для сторно по реализации больше нет, строка сторно становится обычной оплатой.
								ПересчитатьСуммыЕслиЭтоКорректировка(ГлобальныеПеременные, СтрокаОплаты);
							КонецЕсли;
							
						КонецЕсли;
						
						//Если часть строк отгрузки пропущена - возвращаемся.
						Если ПропускОтгрузкиПоставки <> 0 Тогда
							Индексы.ИндексОтгрузкиПоставки = Индексы.ИндексОтгрузкиПоставки - ПропускОтгрузкиПоставки;
							ПропускОтгрузкиПоставки = 0;
						//Если отгрузка скорректировалась в 0 то идем к следующей строке.
						ИначеЕсли СтрокаОтгрузкиПоставки.Сумма = 0 Тогда
							СтрокаОтгрузкиПоставки.ЕстьОстаток = ЛОЖЬ;
							Индексы.ИндексОтгрузкиПоставки = Индексы.ИндексОтгрузкиПоставки + 1;
						КонецЕсли;
						
					//Накладная уже оплачена или её нет, рассматриваем эту корректировку как обычную оплату.
					Иначе
						ПересчитатьСуммыЕслиЭтоКорректировка(ГлобальныеПеременные, СтрокаОплаты);
						//Если часть строк отгрузки пропущена - возвращаемся.
						Если ПропускОтгрузкиПоставки <> 0 Тогда
							Индексы.ИндексОтгрузкиПоставки = Индексы.ИндексОтгрузкиПоставки - ПропускОтгрузкиПоставки;
							ПропускОтгрузкиПоставки = 0;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		//Оплаты распределены, остальные отгрузки в приход.
		ИначеЕсли Индексы.ИндексОплаты = ЗаписейОплаты И Индексы.ИндексОтгрузкиПоставки <= ЗаписейОтгрузкиПоставки - 1 Тогда 
			
			СтрокаОтгрузкиПоставки = РасчетыОтгрузкиПоставки[Индексы.ИндексОтгрузкиПоставки];
			
			Если НЕ СтрокаОтгрузкиПоставки.ПриходДобавлен Тогда
				
				Если СтрокаОтгрузкиПоставки.Сумма <> 0 Тогда
				
					ПересчитатьСуммыЕслиЭтоКорректировка(ГлобальныеПеременные, СтрокаОтгрузкиПоставки);
					
					Если ГлобальныеПеременные.ДанныеНакладных[СтрокаОтгрузкиПоставки.Регистратор] = Неопределено Тогда
						ГлобальныеПеременные.ДанныеНакладных.Вставить(СтрокаОтгрузкиПоставки.Регистратор, 
							СтруктураСумм(СтрокаОтгрузкиПоставки.Сумма, СтрокаОтгрузкиПоставки.СуммаРегл, СтрокаОтгрузкиПоставки.СуммаУпр));
					КонецЕсли;
					
					ДобавитьПриход(ГлобальныеПеременные, ТаблицаРасчетовПоСрокам, СтрокаОтгрузкиПоставки, "ОтгрузкаПоставка");
					
				КонецЕсли;
				
				Если Не СтрокаОтгрузкиПоставки.ЭтоОстаток Тогда
					ДобавитьЗаписьКРасчетуПланаОплат(ГлобальныеПеременные, СтрокаОтгрузкиПоставки, -(СтрокаОтгрузкиПоставки.Сумма - СтрокаОтгрузкиПоставки.КОплате), ПланыОплат, СтрокаОтгрузкиПоставки.Заказ);
					ДобавитьЗаписьКРасчетуПланаОплат(ГлобальныеПеременные, СтрокаОтгрузкиПоставки, СтрокаОтгрузкиПоставки.Сумма, ПланыОплат, СтрокаОтгрузкиПоставки.Регистратор);
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ СтрокаОтгрузкиПоставки.ПланОтгрузокПоставокСписан Тогда
				СписатьПланОтгрузкиПоставки(ГлобальныеПеременные, ТаблицаПланОтгрузокПоставок, СтрокаОтгрузкиПоставки, ПланыОтгрузокПоставок);
			КонецЕсли;
			
			Если НужнаПереоценка Тогда
				ПереоценитьДолг(ГлобальныеПеременные, ТаблицаРасчетовПоСрокам, СтрокаОтгрузкиПоставки);
			КонецЕсли;
			
			Индексы.ИндексОтгрузкиПоставки = Индексы.ИндексОтгрузкиПоставки + 1;
			
		//Отгрузки распределены, остальные оплаты в приход.
		ИначеЕсли Индексы.ИндексОплаты <= ЗаписейОплаты - 1 И Индексы.ИндексОтгрузкиПоставки = ЗаписейОтгрузкиПоставки Тогда
			
			СтрокаОплаты = РасчетыОплаты[Индексы.ИндексОплаты];
			
			ПересчитатьСуммыЕслиЭтоКорректировка(ГлобальныеПеременные, СтрокаОплаты);
			
			Если НЕ СтрокаОплаты.ПриходДобавлен Тогда
				ДобавитьПриход(ГлобальныеПеременные, ТаблицаРасчетовПоСрокам, СтрокаОплаты, "Оплата");
			КонецЕсли;
			
			Если НЕ СтрокаОплаты.ЭтоОстаток Тогда
				ДобавитьЗаписьКРасчетуПланаОплат(ГлобальныеПеременные, СтрокаОплаты, -СтрокаОплаты.Сумма, ПланыОплат);
			КонецЕсли;
			
			Индексы.ИндексОплаты = Индексы.ИндексОплаты + 1;
			
		КонецЕсли;
	КонецЦикла;
	
	#КонецОбласти
	
	#Область ПланыОплат
	
	Если ПланыОплат.Количество() > 0 Тогда
		
		ПланыОплат.Свернуть("Регистратор, ДокументПлан ,ВариантОплаты, Период, ДатаВозникновения, ДатаПлановогоПогашения, ПорядокОперации, ПорядокЗачетаПоДатеПлатежа, ХозяйственнаяОперация, ПриходДобавлен","КОплате, Оплачено");
		ПланыОплат.Сортировать("ПорядокОперации ВОЗР, ПорядокЗачетаПоДатеПлатежа ВОЗР");
		
		//С учетом документа плана
		
		счПриход = 0;
		счРасход = 0;
		РаспределеноСтрок = 0;
		ПриходЭтоКОплате = Истина;
		Пока счПриход < ПланыОплат.Количество() ИЛИ счРасход < ПланыОплат.Количество() Цикл
			
			Если счРасход > ПланыОплат.Количество()-1 Тогда
				счПриход = счПриход + 1;
				счРасход = счПриход;
			КонецЕсли;
			
			Если счПриход > ПланыОплат.Количество()-1 Тогда
				Прервать;
			КонецЕсли;
			
			Если (ПланыОплат[счПриход].КОплате > 0 И ПланыОплат[счРасход].Оплачено > 0
					ИЛИ ПланыОплат[счРасход].КОплате > 0 И ПланыОплат[счПриход].Оплачено > 0)
				И ПланыОплат[счПриход].Регистратор = ПланыОплат[счРасход].ДокументПлан Тогда
				
				РаспределеноСтрок = РаспределеноСтрок + 1;
				ПриходЭтоКОплате = ПланыОплат[счПриход].КОплате > 0;
				
				Если ПланыОплат[счПриход].КОплате > 0 Тогда
					СуммаСписанияКОплате = Мин(ПланыОплат[счПриход].КОплате, ПланыОплат[счРасход].Оплачено);
					СуммаСписанияОплачено = 0;
					ХозОперацияПланирования =  ГлобальныеПеременные.ХозяйственныеОперации["Планирование"];
				Иначе
					СуммаСписанияКОплате = 0;
					СуммаСписанияОплачено = Мин(ПланыОплат[счПриход].Оплачено, ПланыОплат[счРасход].КОплате);
					ХозОперацияПланирования =  ПланыОплат[счПриход].ХозяйственнаяОперация;
				КонецЕсли;
				
				Если ПланыОплат[счПриход].Регистратор <> ПланыОплат[счРасход].Регистратор Тогда
					//Приход по плану и расход по плану
					Если ПланыОплат[счПриход].ПорядокОперации <= ПланыОплат[счРасход].ПорядокОперации  Тогда
						ПроверитьДобавитьПриходПланаОплат(ТаблицаПланОплат, ПланыОплат[счПриход], ХозОперацияПланирования, СуммаСписанияКОплате, СуммаСписанияОплачено);
						ДобавитьРасходПланаОплат(ТаблицаПланОплат, ПланыОплат[счПриход], ПланыОплат[счРасход], СуммаСписанияКОплате, СуммаСписанияОплачено, Истина);
					Иначе
						ПроверитьДобавитьПриходПланаОплат(ТаблицаПланОплат, ПланыОплат[счРасход], ПланыОплат[счРасход].ХозяйственнаяОперация, СуммаСписанияКОплате, СуммаСписанияОплачено);
						ДобавитьРасходПланаОплат(ТаблицаПланОплат, ПланыОплат[счРасход], ПланыОплат[счПриход], СуммаСписанияКОплате, СуммаСписанияОплачено);
					КонецЕсли;
				КонецЕсли;
				
				Если ПланыОплат[счПриход].КОплате > 0 Тогда
					ПланыОплат[счПриход].КОплате = ПланыОплат[счПриход].КОплате - СуммаСписанияКОплате;
					ПланыОплат[счРасход].Оплачено = ПланыОплат[счРасход].Оплачено - СуммаСписанияКОплате;
				Иначе
					ПланыОплат[счРасход].КОплате = ПланыОплат[счРасход].КОплате - СуммаСписанияОплачено;
					ПланыОплат[счПриход].Оплачено = ПланыОплат[счПриход].Оплачено - СуммаСписанияОплачено;
				КонецЕсли;
				
				Если ПланыОплат[счРасход].КОплате = 0 И ПланыОплат[счРасход].Оплачено = 0 Тогда
					ПланыОплат.Удалить(счРасход);
				КонецЕсли;
				
				Если ПланыОплат[счПриход].КОплате = 0 И ПланыОплат[счПриход].Оплачено = 0 Тогда
					счПриход = счПриход + 1;
					счРасход = счПриход + 1;
				КонецЕсли;
				
			Иначе
				счРасход = счРасход + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		//Без учета документа плана
		
		счПриход = 0;
		счРасход = 0;
		РаспределеноСтрок = 0;
		ПриходЭтоКОплате = Истина;
		Пока счПриход < ПланыОплат.Количество() ИЛИ счРасход < ПланыОплат.Количество() Цикл
			
			Если счРасход > ПланыОплат.Количество()-1 Тогда
				Если РаспределеноСтрок = 0 Тогда
					Прервать;
				Иначе
					РаспределеноСтрок = 0;
				КонецЕсли;
				счПриход = счПриход + 1;
				счРасход = 0;
			КонецЕсли;
			
			Если счПриход > ПланыОплат.Количество()-1 Тогда
				Прервать;
			КонецЕсли;
			
			Если ПланыОплат[счПриход].КОплате > 0 И ПланыОплат[счРасход].Оплачено > 0
				ИЛИ ПланыОплат[счРасход].КОплате > 0 И ПланыОплат[счПриход].Оплачено > 0 Тогда
				РаспределеноСтрок = РаспределеноСтрок + 1;
				ПриходЭтоКОплате = ПланыОплат[счПриход].КОплате > 0;
				
				Если ПланыОплат[счПриход].КОплате > 0 Тогда
					СуммаСписанияКОплате = Мин(ПланыОплат[счПриход].КОплате, ПланыОплат[счРасход].Оплачено);
					СуммаСписанияОплачено = 0;
					ХозОперацияПланирования =  ГлобальныеПеременные.ХозяйственныеОперации["Планирование"];
				Иначе
					СуммаСписанияКОплате = 0;
					СуммаСписанияОплачено = Мин(ПланыОплат[счПриход].Оплачено, ПланыОплат[счРасход].КОплате);
					ХозОперацияПланирования =  ПланыОплат[счПриход].ХозяйственнаяОперация;
				КонецЕсли;
				
				Если ПланыОплат[счПриход].Регистратор <> ПланыОплат[счРасход].Регистратор Тогда
					//Приход по плану и расход по плану
					Если ПланыОплат[счПриход].ПорядокОперации <= ПланыОплат[счРасход].ПорядокОперации  Тогда
						ПроверитьДобавитьПриходПланаОплат(ТаблицаПланОплат, ПланыОплат[счПриход], ХозОперацияПланирования, СуммаСписанияКОплате, СуммаСписанияОплачено);
						ДобавитьРасходПланаОплат(ТаблицаПланОплат, ПланыОплат[счПриход], ПланыОплат[счРасход], СуммаСписанияКОплате, СуммаСписанияОплачено);
					Иначе
						ПроверитьДобавитьПриходПланаОплат(ТаблицаПланОплат, ПланыОплат[счРасход], ПланыОплат[счРасход].ХозяйственнаяОперация, СуммаСписанияКОплате, СуммаСписанияОплачено);
						ДобавитьРасходПланаОплат(ТаблицаПланОплат, ПланыОплат[счРасход], ПланыОплат[счПриход], СуммаСписанияКОплате, СуммаСписанияОплачено);
					КонецЕсли;
				КонецЕсли;
				
				Если ПланыОплат[счПриход].КОплате > 0 Тогда
					ПланыОплат[счПриход].КОплате = ПланыОплат[счПриход].КОплате - СуммаСписанияКОплате;
					ПланыОплат[счРасход].Оплачено = ПланыОплат[счРасход].Оплачено - СуммаСписанияКОплате;
				Иначе
					ПланыОплат[счРасход].КОплате = ПланыОплат[счРасход].КОплате - СуммаСписанияОплачено;
					ПланыОплат[счПриход].Оплачено = ПланыОплат[счПриход].Оплачено - СуммаСписанияОплачено;
				КонецЕсли;
				
				Если ПланыОплат[счРасход].КОплате = 0 И ПланыОплат[счРасход].Оплачено = 0 Тогда
					ПланыОплат.Удалить(счРасход);
				КонецЕсли;
				
				Если ПланыОплат[счПриход].КОплате = 0 И ПланыОплат[счПриход].Оплачено = 0 Тогда
					ПланыОплат.Удалить(счПриход);
					//Если тип прихода меняется, сбрасываем счетчик Расхода.
					Если ПриходЭтоКОплате И счПриход < ПланыОплат.Количество()
						И ПланыОплат[счПриход].Оплачено > 0 И счРасход <> 0 Тогда
						счРасход = 0;
					ИначеЕсли счРасход > 0 Тогда
						счРасход = счРасход - 1;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли ПланыОплат[счПриход].КОплате = 0 И ПланыОплат[счПриход].Оплачено = 0 Тогда
				ПланыОплат.Удалить(счПриход);
				Если ПриходЭтоКОплате И счПриход < ПланыОплат.Количество() И ПланыОплат[счПриход].Оплачено > 0 И счРасход <> 0 Тогда
					счРасход = 0;
				ИначеЕсли счРасход > 0 Тогда
					счРасход = счРасход - 1;
				КонецЕсли;
			Иначе
				счРасход = счРасход + 1;
			КонецЕсли;
			
		КонецЦикла;
		
		//Нераспределенные остатки
		счПриход = 0;
		счРасход = 0;
		
		Пока счПриход < ПланыОплат.Количество() Цикл
			Если ПланыОплат[счПриход].КОплате > 0 Тогда
				ПроверитьДобавитьПриходПланаОплат(ТаблицаПланОплат, ПланыОплат[счПриход], ГлобальныеПеременные.ХозяйственныеОперации["Планирование"], ПланыОплат[счПриход].КОплате);
			КонецЕсли;
			счПриход = счПриход + 1;
		КонецЦикла;
		
		Пока счРасход < ПланыОплат.Количество() Цикл
			Если ПланыОплат[счРасход].Оплачено > 0 Тогда
				ПроверитьДобавитьПриходПланаОплат(ТаблицаПланОплат, ПланыОплат[счРасход], ПланыОплат[счРасход].ХозяйственнаяОперация, 0, ПланыОплат[счРасход].Оплачено);
			КонецЕсли;
			счРасход = счРасход + 1;
		КонецЦикла;
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ФиксацияРезультатов
	
	НаборЗаписейПоСрокам = РегистрыНакопления[ИмяРегистраРасчетов].СоздатьНаборЗаписей();
	НаборЗаписейПланОплат = РегистрыНакопления[ИмяРегистраПланаОплат].СоздатьНаборЗаписей();
	НаборЗаписейПланОтгрузокПоставок = РегистрыНакопления[ИмяРегистраПланаОтгрузкиПоставки].СоздатьНаборЗаписей();
	
	ТаблицаРасчетовПоСрокам.Свернуть("Период, Регистратор, ВидДвижения, АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта, ДокументРегистратор,
			|РасчетныйДокумент, ХозяйственнаяОперация, ДатаПлановогоПогашения, ДатаВозникновения, ПорядокЗачета, ПорядокОперации,
			|ВалютаДокумента, СвязанныйДокумент, СтатьяДвиженияДенежныхСредств, КорОбъектРасчетов, КорАналитикаУчетаПоПартнерам",
			"Предоплата, ПредоплатаРегл, ПредоплатаУпр, Долг, ДолгРегл, ДолгУпр");
	
	ТаблицаРасчетовПоСрокам.ЗаполнитьЗначения(ГлобальныеПеременные.АналитикаУчетаПоПартнерам, "АналитикаУчетаПоПартнерам");
		ТаблицаРасчетовПоСрокам.ЗаполнитьЗначения(ГлобальныеПеременные.ОбъектРасчетов,            "ОбъектРасчетов");
		ТаблицаРасчетовПоСрокам.ЗаполнитьЗначения(ГлобальныеПеременные.ВалютаРасчетов,            "Валюта");
		ТаблицаРасчетовПоСрокам.Индексы.Добавить("Регистратор");
	
	Если ОсновныеПараметры.Свойство("ДополнительныеСвойстваПроведения") 
			И ОсновныеПараметры.ДополнительныеСвойстваПроведения <> Неопределено
			И ОсновныеПараметры.ДополнительныеСвойстваПроведения.Свойство("МенеджерВременныхТаблиц") Тогда
		
		// Передадим менеджер временных таблиц в набор записей по срокам для формирования таблиц изменений при записи.
		НаборЗаписейПоСрокам.ДополнительныеСвойства.Вставить("МенеджерВременныхТаблиц",
			ОсновныеПараметры.ДополнительныеСвойстваПроведения.МенеджерВременныхТаблиц);
		
	КонецЕсли;
	
	Если НЕ ОсновныеПараметры.НачальноеЗаполнение И ОсновныеПараметры.ЗаписыватьИзменения Тогда
		
		Если ГлобальныеПеременные.ПорядокФакт <> "" Тогда
			НаборЗаписейПоСрокам.ДополнительныеСвойства.Вставить("Порядок",ГлобальныеПеременные.ПорядокФакт );
		КонецЕсли;
		
		#Область ПроверкаИзмененийРегистров
		
		ТаблицаИзменений = Неопределено;
		
		Если ОсновныеПараметры.Свойство("ДополнительныеСвойстваПроведения") И ОсновныеПараметры.ДополнительныеСвойстваПроведения <> Неопределено Тогда
			Запрос.Текст = "
			|ВЫБРАТЬ *
			|ПОМЕСТИТЬ ВтДвиженияПосле
			|ИЗ  &ТаблицаПоСрокам КАК ДвиженияПосле
			|;
			|ВЫБРАТЬ
			|	ВложенныйЗапрос.Период                        КАК Период,
			|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
			|	ВложенныйЗапрос.ОбъектРасчетов                КАК ОбъектРасчетов,
			|	ВложенныйЗапрос.Валюта                        КАК Валюта,
			|	ВложенныйЗапрос.РасчетныйДокумент             КАК РасчетныйДокумент,
			|	ВложенныйЗапрос.ДатаПлановогоПогашения        КАК ДатаПлановогоПогашения,
			|	ВложенныйЗапрос.ДатаВозникновения             КАК ДатаВозникновения,
			|	
			|	ВложенныйЗапрос.ПорядокЗачета                 КАК ПорядокЗачета,
			|	ВложенныйЗапрос.ПорядокОперации               КАК ПорядокОперации,
			|	ВложенныйЗапрос.ВалютаДокумента               КАК ВалютаДокумента,
			|	ВложенныйЗапрос.СвязанныйДокумент             КАК СвязанныйДокумент,
			|	ВложенныйЗапрос.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|	ВложенныйЗапрос.КорОбъектРасчетов             КАК КорОбъектРасчетов,
			|	ВложенныйЗапрос.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
			|	ВложенныйЗапрос.ДокументРегистратор           КАК ДокументРегистратор,
			|	ВложенныйЗапрос.КорАналитикаУчетаПоПартнерам  КАК КорАналитикаУчетаПоПартнерам,
			|	
			|	СУММА(ВложенныйЗапрос.Предоплата)                    КАК Предоплата,
			|	СУММА(ВложенныйЗапрос.ПредоплатаРегл)                КАК ПредоплатаРегл,
			|	СУММА(ВложенныйЗапрос.ПредоплатаУпр)                 КАК ПредоплатаУпр,
			|	СУММА(ВложенныйЗапрос.Долг)                          КАК Долг,
			|	СУММА(ВложенныйЗапрос.ДолгРегл)                      КАК ДолгРегл,
			|	СУММА(ВложенныйЗапрос.ДолгУпр)                       КАК ДолгУпр
			|ПОМЕСТИТЬ ТаблицаИзмененийРасчетыСКлиентамиПоСрокам
			|ИЗ
			|	(ВЫБРАТЬ
			|		РасчетыПоСрокам.Период                        КАК Период,
			|		РасчетыПоСрокам.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
			|		РасчетыПоСрокам.ОбъектРасчетов                КАК ОбъектРасчетов,
			|		РасчетыПоСрокам.Валюта                        КАК Валюта,
			|		РасчетыПоСрокам.РасчетныйДокумент             КАК РасчетныйДокумент,
			|		РасчетыПоСрокам.ДатаПлановогоПогашения        КАК ДатаПлановогоПогашения,
			|		РасчетыПоСрокам.ДатаВозникновения             КАК ДатаВозникновения,
			|		
			|		РасчетыПоСрокам.ПорядокЗачета                 КАК ПорядокЗачета,
			|		РасчетыПоСрокам.ПорядокОперации               КАК ПорядокОперации,
			|		РасчетыПоСрокам.ВалютаДокумента               КАК ВалютаДокумента,
			|		РасчетыПоСрокам.СвязанныйДокумент             КАК СвязанныйДокумент,
			|		РасчетыПоСрокам.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|		РасчетыПоСрокам.КорОбъектРасчетов             КАК КорОбъектРасчетов,
			|		РасчетыПоСрокам.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
			|		РасчетыПоСрокам.ДокументРегистратор           КАК ДокументРегистратор,
			|		РасчетыПоСрокам.КорАналитикаУчетаПоПартнерам  КАК КорАналитикаУчетаПоПартнерам,
			|		
			|		РасчетыПоСрокам.Предоплата                    КАК Предоплата,
			|		РасчетыПоСрокам.ПредоплатаРегл                КАК ПредоплатаРегл,
			|		РасчетыПоСрокам.ПредоплатаУпр                 КАК ПредоплатаУпр,
			|		РасчетыПоСрокам.Долг                          КАК Долг,
			|		РасчетыПоСрокам.ДолгРегл                      КАК ДолгРегл,
			|		РасчетыПоСрокам.ДолгУпр                       КАК ДолгУпр
			|		
			|	ИЗ
			|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокам
			|	ГДЕ
			|		РасчетыПоСрокам.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
			|		И РасчетыПоСрокам.ОбъектРасчетов = &ОбъектРасчетов
			|		И РасчетыПоСрокам.Валюта = &ВалютаРасчетов
			|		И РасчетыПоСрокам.ДокументРегистратор В (&МассивДокументов)
			|		И НЕ РасчетыПоСрокам.Регистратор В (&МассивПолныхРегистраторовРасчетыСКлиентамиПоСрокам)
			|		И РасчетыПоСрокам.Активность
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ДвиженияПосле.Период                        КАК Период,
			|		ДвиженияПосле.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
			|		ДвиженияПосле.ОбъектРасчетов                КАК ОбъектРасчетов,
			|		ДвиженияПосле.Валюта                        КАК Валюта,
			|		ДвиженияПосле.РасчетныйДокумент             КАК РасчетныйДокумент,
			|		ДвиженияПосле.ДатаПлановогоПогашения        КАК ДатаПлановогоПогашения,
			|		ДвиженияПосле.ДатаВозникновения             КАК ДатаВозникновения,
			|		
			|		ДвиженияПосле.ПорядокЗачета                 КАК ПорядокЗачета,
			|		ДвиженияПосле.ПорядокОперации               КАК ПорядокОперации,
			|		ДвиженияПосле.ВалютаДокумента               КАК ВалютаДокумента,
			|		ДвиженияПосле.СвязанныйДокумент             КАК СвязанныйДокумент,
			|		ДвиженияПосле.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|		ДвиженияПосле.КорОбъектРасчетов             КАК КорОбъектРасчетов,
			|		ДвиженияПосле.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
			|		ДвиженияПосле.ДокументРегистратор           КАК ДокументРегистратор,
			|		ВЫБОР КОГДА ДвиженияПосле.КорАналитикаУчетаПоПартнерам = Неопределено
			|			ТОГДА ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)
			|			ИНАЧЕ ДвиженияПосле.КорАналитикаУчетаПоПартнерам
			|		КОНЕЦ                                       КАК КорАналитикаУчетаПоПартнерам,
			|		
			|		-ДвиженияПосле.Предоплата                    КАК Предоплата,
			|		-ДвиженияПосле.ПредоплатаРегл                КАК ПредоплатаРегл,
			|		-ДвиженияПосле.ПредоплатаУпр                 КАК ПредоплатаУпр,
			|		-ДвиженияПосле.Долг                          КАК Долг,
			|		-ДвиженияПосле.ДолгРегл                      КАК ДолгРегл,
			|		-ДвиженияПосле.ДолгУпр                       КАК ДолгУпр
			|	ИЗ
			|		ВтДвиженияПосле КАК ДвиженияПосле) КАК ВложенныйЗапрос
			|СГРУППИРОВАТЬ ПО
			|	Период,
			|	АналитикаУчетаПоПартнерам,
			|	ОбъектРасчетов,
			|	Валюта,
			|	РасчетныйДокумент,
			|	ДатаПлановогоПогашения,
			|	ДатаВозникновения,
			|	ПорядокЗачета,
			|	ПорядокОперации,
			|	ВалютаДокумента,
			|	СвязанныйДокумент,
			|	СтатьяДвиженияДенежныхСредств,
			|	КорОбъектРасчетов,
			|	ХозяйственнаяОперация,
			|	ДокументРегистратор,
			|	КорАналитикаУчетаПоПартнерам
			|ИМЕЮЩИЕ
			|	СУММА(ВложенныйЗапрос.Предоплата) <> 0
			|	ИЛИ СУММА(ВложенныйЗапрос.ПредоплатаРегл) <> 0
			|	ИЛИ СУММА(ВложенныйЗапрос.ПредоплатаУпр) <> 0
			|	ИЛИ СУММА(ВложенныйЗапрос.Долг) <> 0
			|	ИЛИ СУММА(ВложенныйЗапрос.ДолгРегл) <> 0
			|	ИЛИ СУММА(ВложенныйЗапрос.ДолгУпр) <> 0";
			
			Если НЕ ГлобальныеПеременные.ЭтоРасчетыСКлиентами Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст,"РасчетыСКлиентами", "РасчетыСПоставщиками");
			КонецЕсли;
			
			МассивДокументов = ТаблицаРасчетовПоСрокам.ВыгрузитьКолонку("ДокументРегистратор");
			МассивДокументов.Добавить(ОсновныеПараметры.Регистратор);
			
			Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
			Запрос.УстановитьПараметр("ТаблицаПоСрокам", ТаблицаРасчетовПоСрокам);
			Запрос.Выполнить();
			
			Если ГлобальныеПеременные.ЭтоРасчетыСКлиентами Тогда
				
				Запрос.УстановитьПараметр("НеотражаемыйДокумент", ОсновныеПараметры.Регистратор);
				
				ТекстАктуализацииОтражения =
				"ВЫБРАТЬ
				|	ТаблицаИзменений.ДокументРегистратор КАК Регистратор
				|ИЗ
				|	ТаблицаИзмененийРасчетыСКлиентамиПоСрокам КАК ТаблицаИзменений
				|
				|ГДЕ
				|	ТаблицаИзменений.ДокументРегистратор <> &НеотражаемыйДокумент
				|
				|СГРУППИРОВАТЬ ПО
				|	ТаблицаИзменений.ДокументРегистратор";
						
					
				Запрос.Текст = ТекстАктуализацииОтражения;
				
				ТаблицаИзменений = Запрос.Выполнить().Выгрузить();
				
				#Область ПроверкаДатыЗапрета
				
				ЗапросПроверкиДатыЗапрета = Новый Запрос("
				|ВЫБРАТЬ
				|	ЕСТЬNULL(МИНИМУМ(ТаблицаИзменений.Период),ДАТАВРЕМЯ(3999,1,1)) КАК Период
				|ИЗ
				|	ТаблицаИзмененийРасчетыСКлиентамиПоСрокам КАК ТаблицаИзменений");
				
				ЗапросПроверкиДатыЗапрета.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
				ВыборкаМинимальногоПериода = ЗапросПроверкиДатыЗапрета.Выполнить().Выбрать();
				Если ВыборкаМинимальногоПериода.Следующий() Тогда
					ДанныеДляПроверки = ДатыЗапретаИзменения.ШаблонДанныхДляПроверки();
					
					НоваяСтрока = ДанныеДляПроверки.Добавить();
					НоваяСтрока.Дата   = НачалоДня(ВыборкаМинимальногоПериода.Период);
					НоваяСтрока.Раздел = "ВзаимозачетыСписанияЗадолженности";
					
					НоваяСтрока = ДанныеДляПроверки.Добавить();
					НоваяСтрока.Дата   = НачалоДня(ВыборкаМинимальногоПериода.Период);
					НоваяСтрока.Раздел = "ПродажиВозвратыОтКлиентов";
					
					НоваяСтрока = ДанныеДляПроверки.Добавить();
					НоваяСтрока.Дата   = НачалоДня(ВыборкаМинимальногоПериода.Период);
					НоваяСтрока.Раздел = "РегламентныеОперации";
					
					ОписаниеОшибки = НСтр("ru='Изменяемые данные взаиморасчетов находятся в закрытом периоде.';uk='Змінні дані взаєморозрахунків знаходяться в закритому періоді.'");
					Если ДатыЗапретаИзменения.НайденЗапретИзмененияДанных(ДанныеДляПроверки, НаборЗаписейПоСрокам) Тогда
						ВызватьИсключение ОписаниеОшибки;
					КонецЕсли;
				КонецЕсли;
				
				#КонецОбласти
				
				
				Запрос.Текст =
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	НАЧАЛОПЕРИОДА(Изменения.Период, МЕСЯЦ)         КАК Период,
				|	Изменения.РасчетныйДокумент                    КАК Документ,
				|	Изменения.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент
				|ИЗ
				|	ТаблицаИзмененийРасчетыСКлиентамиПоСрокам КАК Изменения";
				
				ИзмененияНДСУП = Запрос.Выполнить().Выгрузить();
				
				СвойстваДокумента = Новый Структура("РежимЗаписи", ОсновныеПараметры.ДополнительныеСвойстваПроведения.СвойстваДокумента.РежимЗаписи);
				ПроведениеДокумента = Новый Структура("СвойстваДокумента", СвойстваДокумента);
				ДополнительныеСвойства = Новый Структура("ПроведениеДокументов", ПроведениеДокумента);
				Документ = Новый Структура("ДополнительныеСвойства", ДополнительныеСвойства);
				ЗакрытиеМесяцаСервер.ОтразитьЗаданияКЗакрытиюМесяца(Документ, Запрос.МенеджерВременныхТаблиц);
				
			Иначе
				
				Запрос.УстановитьПараметр("НеотражаемыйДокумент", ОсновныеПараметры.Регистратор);
				
				ТекстАктуализацииОтражения =
				"ВЫБРАТЬ
				|	ТаблицаИзменений.ДокументРегистратор КАК Регистратор
				|ИЗ
				|	ТаблицаИзмененийРасчетыСПоставщикамиПоСрокам КАК ТаблицаИзменений
				|
				|ГДЕ
				|	ТаблицаИзменений.ДокументРегистратор <> &НеотражаемыйДокумент
				|
				|СГРУППИРОВАТЬ ПО
				|	ТаблицаИзменений.ДокументРегистратор";
				
					
				Запрос.Текст = ТекстАктуализацииОтражения;
					
				ТаблицаИзменений = Запрос.Выполнить().Выгрузить();
				
				#Область ПроверкаДатыЗапрета
				
				ЗапросПроверкиДатыЗапрета = Новый Запрос("
				|ВЫБРАТЬ
				|	ЕСТЬNULL(МИНИМУМ(ТаблицаИзменений.Период),ДАТАВРЕМЯ(3999,1,1)) КАК Период
				|ИЗ
				|	ТаблицаИзмененийРасчетыСПоставщикамиПоСрокам КАК ТаблицаИзменений");
				
				ЗапросПроверкиДатыЗапрета.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
				ВыборкаМинимальногоПериода = ЗапросПроверкиДатыЗапрета.Выполнить().Выбрать();
				Если ВыборкаМинимальногоПериода.Следующий() Тогда
					ДанныеДляПроверки = ДатыЗапретаИзменения.ШаблонДанныхДляПроверки();
					
					НоваяСтрока = ДанныеДляПроверки.Добавить();
					НоваяСтрока.Дата   = НачалоДня(ВыборкаМинимальногоПериода.Период);
					НоваяСтрока.Раздел = "ВзаимозачетыСписанияЗадолженности";
					
					НоваяСтрока = ДанныеДляПроверки.Добавить();
					НоваяСтрока.Дата   = НачалоДня(ВыборкаМинимальногоПериода.Период);
					НоваяСтрока.Раздел = "ЗакупкиВозвратыПоставщикамПеремещенияСборки";
					
					НоваяСтрока = ДанныеДляПроверки.Добавить();
					НоваяСтрока.Дата   = НачалоДня(ВыборкаМинимальногоПериода.Период);
					НоваяСтрока.Раздел = "РегламентныеОперации";
					
					ОписаниеОшибки = НСтр("ru='Изменяемые данные взаиморасчетов находятся в закрытом периоде.';uk='Змінні дані взаєморозрахунків знаходяться в закритому періоді.'");
					Если ДатыЗапретаИзменения.НайденЗапретИзмененияДанных(ДанныеДляПроверки, НаборЗаписейПоСрокам) Тогда
						ВызватьИсключение ОписаниеОшибки;
					КонецЕсли;
				КонецЕсли;
				
				#КонецОбласти
				
				
				СвойстваДокумента = Новый Структура("РежимЗаписи", ОсновныеПараметры.ДополнительныеСвойстваПроведения.СвойстваДокумента.РежимЗаписи);
				ПроведениеДокумента = Новый Структура("СвойстваДокумента", СвойстваДокумента);
				ДополнительныеСвойства = Новый Структура("ПроведениеДокументов", ПроведениеДокумента);
				Документ = Новый Структура("ДополнительныеСвойства", ДополнительныеСвойства);
				ЗакрытиеМесяцаСервер.ОтразитьЗаданияКЗакрытиюМесяца(Документ, Запрос.МенеджерВременныхТаблиц);
				
			КонецЕсли;
			
			РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(Запрос, "ВтДвиженияПосле");
			
		КонецЕсли;
		
		#КонецОбласти
		
		ЗаписатьПорционно(ГлобальныеПеременные, ТаблицаРасчетовПоСрокам, НаборЗаписейПоСрокам);
		
		Если ОсновныеПараметры.Свойство("ДополнительныеСвойстваПроведения") И ОсновныеПараметры.ДополнительныеСвойстваПроведения <> Неопределено Тогда
			Если ГлобальныеПеременные.ЭтоРасчетыСКлиентами Тогда
				Если ОсновныеПараметры.Свойство("НачальныеГраницыНДС") Тогда
					НДСОбщегоНазначенияСервер.ДополнитьТаблицуНачальныхГраницПоТаблицеИзмененийРасчетов(ОсновныеПараметры.НачальныеГраницыНДС, Запрос.МенеджерВременныхТаблиц, "ТаблицаИзмененийРасчетыСКлиентамиПоСрокам"); 
				КонецЕсли;
				// Уничтожаем временную таблицу изменений, т.к. могут записываться разные наборы записей с одним менеджером запросов.
				РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(Запрос, "ТаблицаИзмененийРасчетыСКлиентамиПоСрокам");
			Иначе
				Если ОсновныеПараметры.Свойство("НачальныеГраницыНДС") Тогда
					НДСОбщегоНазначенияСервер.ДополнитьТаблицуНачальныхГраницПоТаблицеИзмененийРасчетов(ОсновныеПараметры.НачальныеГраницыНДС, Запрос.МенеджерВременныхТаблиц, "ТаблицаИзмененийРасчетыСПоставщикамиПоСрокам"); 
				КонецЕсли;
				// Уничтожаем временную таблицу изменений, т.к. могут записываться разные наборы записей с одним менеджером запросов.
				РасчетСебестоимостиПрикладныеАлгоритмы.УничтожитьВременныеТаблицы(Запрос, "ТаблицаИзмененийРасчетыСПоставщикамиПоСрокам");
			КонецЕсли;
		КонецЕсли;
		
		Если ТаблицаИзменений <> Неопределено И ТаблицаИзменений.Количество() > 0 Тогда
			УдалитьСистемныеКорректировкиРегистров(НачалоДняПорядкаФакт, Организация);
		КонецЕсли;
		
	КонецЕсли;
	
	ТаблицаПланОплат.Свернуть("Период, Регистратор, ВидДвижения, АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта, ДокументРегистратор,
			|ДокументПлан, ХозяйственнаяОперация, ДатаПлановогоПогашения, ДатаВозникновения, ВариантОплаты, ПорядокЗачета, ПорядокОперации",
			"КОплате, Оплачено");
	
	ТаблицаПланОплат.ЗаполнитьЗначения(ГлобальныеПеременные.АналитикаУчетаПоПартнерам, "АналитикаУчетаПоПартнерам");
	ТаблицаПланОплат.ЗаполнитьЗначения(ГлобальныеПеременные.ОбъектРасчетов,            "ОбъектРасчетов");
	ТаблицаПланОплат.ЗаполнитьЗначения(ГлобальныеПеременные.ВалютаРасчетов,            "Валюта");
	ТаблицаПланОплат.Индексы.Добавить("Регистратор");
	
	Если ОсновныеПараметры.ЗаписыватьИзменения Тогда
		ЗаписатьПорционно(ГлобальныеПеременные, ТаблицаПланОплат, НаборЗаписейПланОплат);
	КонецЕсли;
	
	ТаблицаПланОтгрузокПоставок.ЗаполнитьЗначения(ГлобальныеПеременные.АналитикаУчетаПоПартнерам, "АналитикаУчетаПоПартнерам");
	ТаблицаПланОтгрузокПоставок.ЗаполнитьЗначения(ГлобальныеПеременные.ОбъектРасчетов,            "ОбъектРасчетов");
	ТаблицаПланОтгрузокПоставок.ЗаполнитьЗначения(ГлобальныеПеременные.ВалютаРасчетов,            "Валюта");
	ТаблицаПланОтгрузокПоставок.Индексы.Добавить("Регистратор");
	
	Если ОсновныеПараметры.ЗаписыватьИзменения Тогда
		ЗаписатьПорционно(ГлобальныеПеременные, ТаблицаПланОтгрузокПоставок, НаборЗаписейПланОтгрузокПоставок);
	КонецЕсли;
	
	Если ПланыОбмена.ГлавныйУзел() = Неопределено И НЕ ОсновныеПараметры.НачальноеЗаполнение И ОсновныеПараметры.ЗаписыватьИзменения Тогда
		УдалитьНеиспользуемыеРегистраторыРасчетов(Запрос, ИмяРегистраРасчетов, ИмяРегистраПланаОплат, ИмяРегистраПланаОтгрузкиПоставки);
	КонецЕсли;
	
	Если НЕ ОсновныеПараметры.НачальноеЗаполнение И ОсновныеПараметры.ДополнительныеСвойстваПроведения <> Неопределено Тогда
		ОсновныеПараметры.ДополнительныеСвойстваПроведения.Вставить(
			?(ГлобальныеПеременные.ЭтоРасчетыСКлиентами, "РасчетыСКлиентами", "РасчетыСПоставщиками")+"ПоСрокам",
			ТаблицаРасчетовПоСрокам);
	КонецЕсли;
	
	#КонецОбласти
	
КонецПроцедуры

//Вызывает пересчет измененных расчетов по временной таблице изменений.
//
// Параметры:
//	- МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Менеджер с таблицей РасчетыСКлиентамиИзменения или РасчетыСПоставщикамиИзменения
//	- ЭтоРасчетыСКлиентами - Булево - Истина если это расчеты с клиентами.
//	- Регистратор - ДокументСсылка - Регистратор инициатор расчета.
//	- ДополнительныеСвойства - Структура - Дополнительные свойства проведения.
//
Процедура РассчитатьПоИзменениям(МенеджерВременныхТаблиц, ЭтоРасчетыСКлиентами, Регистратор, ДополнительныеСвойства = Неопределено) Экспорт
	
	ТаблицаИзменений = ТаблицаИзмененийДляПересчета(МенеджерВременныхТаблиц, ЭтоРасчетыСКлиентами, Регистратор);
	НачальныеГраницыНДС = НДСОбщегоНазначенияСервер.ПодготовитьТаблицуНачальныхГраниц();
	
	Для Каждого СтрокаИзменений Из ТаблицаИзменений Цикл
		ОсновныеПараметры = СтруктураПараметровЗаполненияВзаиморасчетов();
		
		ЗаполнитьЗначенияСвойств(ОсновныеПараметры, СтрокаИзменений);
		Если СтрокаИзменений.ПорядокФакт <> "" Тогда
			ОсновныеПараметры.ПорядокФакт = Лев(СтрокаИзменений.ПорядокФакт, 8) + "000000000";
			ОсновныеПараметры.ПорядокПлан = Лев(СтрокаИзменений.ПорядокПлан, 8) + "000000000";
		КонецЕсли;
		ОсновныеПараметры.ЭтоРасчетыСКлиентами = ЭтоРасчетыСКлиентами;
		ОсновныеПараметры.Регистратор = Регистратор;
		ОсновныеПараметры.ДополнительныеСвойстваПроведения = ДополнительныеСвойства;
		ОсновныеПараметры.Вставить("НачальныеГраницыНДС", НачальныеГраницыНДС);
		
		ЗаполнитьОперативныеВзаиморасчеты(ОсновныеПараметры);
		
	КонецЦикла;
	
	Если ЭтоРасчетыСКлиентами Тогда
		НДСИсходящийСервер.ВыполнитьПроведениеДокументовПоВозникшемуНДС(НачальныеГраницыНДС);
	Иначе
		НДСВходящийСервер.ВыполнитьПроведениеДокументовПоВозникшемуНДС(НачальныеГраницыНДС);
	КонецЕсли;
	
КонецПроцедуры

//Добавляет записи переоценки на одну дату.
//
// Параметры:
//	- МассивОрганизаций - Массив - Перечень организаций по которым необходимо выполнить переоценку.
//	- Период - Дата - Дата, на конец которой необходимо выполнить переоценку.
//
Процедура ВыполнитьПереоценкуНаДату(МассивОрганизаций, Период, ЭтоРасчетыСКлиентами = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиПоСрокамОстатки.АналитикаУчетаПоПартнерам                      КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентамиПоСрокамОстатки.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|	РасчетыСКлиентамиПоСрокамОстатки.Валюта                                         КАК Валюта,
	|	РасчетыСКлиентамиПоСрокамОстатки.РасчетныйДокумент                              КАК РасчетныйДокумент,
	|	РасчетыСКлиентамиПоСрокамОстатки.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
	|	РасчетыСКлиентамиПоСрокамОстатки.ДатаВозникновения                              КАК ДатаВозникновения,
	|	РасчетыСКлиентамиПоСрокамОстатки.ПредоплатаОстаток                              КАК ПредоплатаОстаток,
	|	РасчетыСКлиентамиПоСрокамОстатки.ПредоплатаРеглОстаток                          КАК ПредоплатаРеглОстаток,
	|	РасчетыСКлиентамиПоСрокамОстатки.ПредоплатаУпрОстаток                           КАК ПредоплатаУпрОстаток,
	|	РасчетыСКлиентамиПоСрокамОстатки.ДолгРеглОстаток                                КАК ДолгРеглОстаток,
	|	ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток 
	|		* КурсыВалютРасчетов.Курс / КурсыВалютРасчетов.Кратность КАК ЧИСЛО(31,2))   КАК ДолгРеглОстатокРасчетный,
	|	РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток                                 КАК ДолгУпрОстаток,
	|	ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток 
	|		* КурсыВалютРасчетов.Курс / КурсыВалютРасчетов.Кратность
	|			/ КурсыВалютУпр.Курс * КурсыВалютУпр.Кратность КАК ЧИСЛО(31,2))         КАК ДолгУпрОстатокРасчетный,
	|	ИСТИНА                                                                          КАК ЭтоРасчетыСКлиентами
	|ПОМЕСТИТЬ ВтКРасчету
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
	|			&Период,
	|			АналитикаУчетаПоПартнерам.Организация В (&МассивОрганизаций)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|		) КАК РасчетыСКлиентамиПоСрокамОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &ВалютаУправленческогоУчета) КАК КурсыВалютУпр
	|		ПО (ИСТИНА)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютРасчетов
	|		ПО РасчетыСКлиентамиПоСрокамОстатки.Валюта = КурсыВалютРасчетов.Валюта
	|ГДЕ
	|	&РасчетыСКлиентами
	|	И (РасчетыСКлиентамиПоСрокамОстатки.ДолгРеглОстаток
	|		- ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток 
	|		* КурсыВалютРасчетов.Курс / КурсыВалютРасчетов.Кратность КАК ЧИСЛО(31,2)) >= 0.01 
	|	ИЛИ РасчетыСКлиентамиПоСрокамОстатки.ДолгРеглОстаток
	|		- ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток 
	|		* КурсыВалютРасчетов.Курс / КурсыВалютРасчетов.Кратность КАК ЧИСЛО(31,2)) <= -0.01 
	|	ИЛИ РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток
	|		- ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток 
	|			* ЕСТЬNULL(КурсыВалютРасчетов.Курс,1) / ЕСТЬNULL(КурсыВалютРасчетов.Кратность,1)
	|				/ ЕСТЬNULL(КурсыВалютУпр.Курс,1) * ЕСТЬNULL(КурсыВалютУпр.Кратность,1) КАК ЧИСЛО(31,2)) >= 0.01
	|	ИЛИ РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток
	|		- ВЫРАЗИТЬ(РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток 
	|			* ЕСТЬNULL(КурсыВалютРасчетов.Курс,1) / ЕСТЬNULL(КурсыВалютРасчетов.Кратность,1)
	|				/ ЕСТЬNULL(КурсыВалютУпр.Курс,1) * ЕСТЬNULL(КурсыВалютУпр.Кратность,1) КАК ЧИСЛО(31,2)) <= -0.01
	|	ИЛИ РасчетыСКлиентамиПоСрокамОстатки.ПредоплатаОстаток = 0
	|		И (РасчетыСКлиентамиПоСрокамОстатки.ПредоплатаРеглОстаток <> 0
	|			ИЛИ РасчетыСКлиентамиПоСрокамОстатки.ПредоплатаУпрОстаток <> 0)
	|	ИЛИ РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток = 0
	|		И (РасчетыСКлиентамиПоСрокамОстатки.ДолгРеглОстаток <> 0
	|			ИЛИ РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток <> 0))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам                      КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|	РасчетыСПоставщикамиПоСрокам.Валюта                                         КАК Валюта,
	|	РасчетыСПоставщикамиПоСрокам.РасчетныйДокумент                              КАК РасчетныйДокумент,
	|	РасчетыСПоставщикамиПоСрокам.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
	|	РасчетыСПоставщикамиПоСрокам.ДатаВозникновения                              КАК ДатаВозникновения,
	|	РасчетыСПоставщикамиПоСрокам.ПредоплатаОстаток                              КАК ПредоплатаОстаток,
	|	РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток                          КАК ПредоплатаРеглОстаток,
	|	РасчетыСПоставщикамиПоСрокам.ПредоплатаУпрОстаток                           КАК ПредоплатаУпрОстаток,
	|	РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток                                КАК ДолгРеглОстаток,
	|	ВЫРАЗИТЬ(РасчетыСПоставщикамиПоСрокам.ДолгОстаток 
	|		* КурсыВалютРасчетов.Курс / КурсыВалютРасчетов.Кратность КАК ЧИСЛО(31,2)) КАК ДолгРеглОстатокРасчетный,
	|	РасчетыСПоставщикамиПоСрокам.ДолгУпрОстаток                                 КАК ДолгУпрОстаток,
	|	ВЫРАЗИТЬ(РасчетыСПоставщикамиПоСрокам.ДолгОстаток 
	|		* КурсыВалютРасчетов.Курс / КурсыВалютРасчетов.Кратность
	|			/ КурсыВалютУпр.Курс * КурсыВалютУпр.Кратность КАК ЧИСЛО(31,2))      КАК ДолгУпрОстатокРасчетный,
	|	ЛОЖЬ                                                                         КАК ЭтоРасчетыСКлиентами
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(
	|			&Период,
	|			АналитикаУчетаПоПартнерам.Организация В (&МассивОрганизаций)
	|				И (Валюта <> &ВалютаУправленческогоУчета ИЛИ Валюта <> &ВалютаРегламентированногоУчета)
	|		) КАК РасчетыСПоставщикамиПоСрокам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &ВалютаУправленческогоУчета) КАК КурсыВалютУпр
	|		ПО (ИСТИНА)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютРасчетов
	|		ПО РасчетыСПоставщикамиПоСрокам.Валюта = КурсыВалютРасчетов.Валюта
	|ГДЕ
	|	&РасчетыСПоставщиками
	|	И (РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток
	|		- ВЫРАЗИТЬ(РасчетыСПоставщикамиПоСрокам.ДолгОстаток 
	|		* КурсыВалютРасчетов.Курс / КурсыВалютРасчетов.Кратность КАК ЧИСЛО(31,2)) >= 0.01 
	|	ИЛИ РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток
	|		- ВЫРАЗИТЬ(РасчетыСПоставщикамиПоСрокам.ДолгОстаток 
	|		* КурсыВалютРасчетов.Курс / КурсыВалютРасчетов.Кратность КАК ЧИСЛО(31,2)) <= -0.01 
	|	ИЛИ РасчетыСПоставщикамиПоСрокам.ДолгУпрОстаток
	|		- ВЫРАЗИТЬ(РасчетыСПоставщикамиПоСрокам.ДолгОстаток 
	|			* ЕСТЬNULL(КурсыВалютРасчетов.Курс,1) / ЕСТЬNULL(КурсыВалютРасчетов.Кратность,1)
	|				/ ЕСТЬNULL(КурсыВалютУпр.Курс,1) * ЕСТЬNULL(КурсыВалютУпр.Кратность,1) КАК ЧИСЛО(31,2)) >= 0.01
	|	ИЛИ РасчетыСПоставщикамиПоСрокам.ДолгУпрОстаток
	|		- ВЫРАЗИТЬ(РасчетыСПоставщикамиПоСрокам.ДолгОстаток 
	|			* ЕСТЬNULL(КурсыВалютРасчетов.Курс,1) / ЕСТЬNULL(КурсыВалютРасчетов.Кратность,1)
	|				/ ЕСТЬNULL(КурсыВалютУпр.Курс,1) * ЕСТЬNULL(КурсыВалютУпр.Кратность,1) КАК ЧИСЛО(31,2)) <= -0.01
	|	ИЛИ РасчетыСПоставщикамиПоСрокам.ПредоплатаОстаток = 0
	|		И (РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглОстаток <> 0
	|			ИЛИ РасчетыСПоставщикамиПоСрокам.ПредоплатаУпрОстаток <> 0)
	|	ИЛИ РасчетыСПоставщикамиПоСрокам.ДолгОстаток = 0
	|		И (РасчетыСПоставщикамиПоСрокам.ДолгРеглОстаток <> 0
	|			ИЛИ РасчетыСПоставщикамиПоСрокам.ДолгУпрОстаток <> 0))
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВтКРасчету.АналитикаУчетаПоПартнерам                      КАК АналитикаУчетаПоПартнерам,
	|	ВтКРасчету.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|	ВтКРасчету.Валюта                                         КАК ВалютаРасчетов,
	|	ВтКРасчету.ЭтоРасчетыСКлиентами                           КАК ЭтоРасчетыСКлиентами,
	|	Аналитика.Организация                                     КАК Организация
	|ИЗ ВтКРасчету КАК ВтКРасчету
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО ВтКРасчету.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|;
	|ВЫБРАТЬ
	|	ВтКРасчету.ЭтоРасчетыСКлиентами                           КАК ЭтоРасчетыСКлиентами,
	|	ВтКРасчету.АналитикаУчетаПоПартнерам                      КАК АналитикаУчетаПоПартнерам,
	|	ВтКРасчету.ОбъектРасчетов                                 КАК ОбъектРасчетов,
	|	ВтКРасчету.Валюта                                         КАК ВалютаРасчетов,
	|	ВтКРасчету.РасчетныйДокумент                              КАК РасчетныйДокумент,
	|	ВтКРасчету.ДатаПлановогоПогашения                         КАК ДатаПлановогоПогашения,
	|	ВтКРасчету.ДатаВозникновения                              КАК ДатаВозникновения,
	|	ВтКРасчету.ДолгРеглОстаток                                КАК ДолгРеглОстаток,
	|	ВтКРасчету.ДолгРеглОстатокРасчетный                       КАК ДолгРеглОстатокРасчетный,
	|	ВтКРасчету.ДолгУпрОстаток                                 КАК ДолгУпрОстаток,
	|	ВтКРасчету.ДолгУпрОстатокРасчетный                        КАК ДолгУпрОстатокРасчетный,
	|	ВтКРасчету.ПредоплатаОстаток                              КАК ПредоплатаОстаток,
	|	ВтКРасчету.ПредоплатаРеглОстаток                          КАК ПредоплатаРеглОстаток,
	|	ВтКРасчету.ПредоплатаУпрОстаток                           КАК ПредоплатаУпрОстаток,
	|	МАКСИМУМ(ЕСТЬNULL(РасчетыСКлиентами.ПорядокЗачета, ЕСТЬNULL(РасчетыСПоставщиками.ПорядокЗачета,""""))) КАК ПорядокЗачета,
	|	МАКСИМУМ(ЕСТЬNULL(РасчетыСКлиентами.ВалютаДокумента, ЕСТЬNULL(РасчетыСПоставщиками.ВалютаДокумента,""""))) КАК ВалютаДокумента
	|ИЗ ВтКРасчету КАК ВтКРасчету
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентами
	|		ПО ВтКРасчету.ЭтоРасчетыСКлиентами
	|			И ВтКРасчету.АналитикаУчетаПоПартнерам = РасчетыСКлиентами.АналитикаУчетаПоПартнерам
	|			И ВтКРасчету.ОбъектРасчетов = РасчетыСКлиентами.ОбъектРасчетов
	|			И ВтКРасчету.Валюта = РасчетыСКлиентами.Валюта
	|			И ВтКРасчету.РасчетныйДокумент = РасчетыСКлиентами.РасчетныйДокумент
	|			И ВтКРасчету.ДатаПлановогоПогашения = РасчетыСКлиентами.ДатаПлановогоПогашения
	|			И РасчетыСКлиентами.Активность
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщиками
	|		ПО НЕ ВтКРасчету.ЭтоРасчетыСКлиентами
	|			И ВтКРасчету.АналитикаУчетаПоПартнерам = РасчетыСПоставщиками.АналитикаУчетаПоПартнерам
	|			И ВтКРасчету.ОбъектРасчетов = РасчетыСПоставщиками.ОбъектРасчетов
	|			И ВтКРасчету.Валюта = РасчетыСПоставщиками.Валюта
	|			И ВтКРасчету.РасчетныйДокумент = РасчетыСПоставщиками.РасчетныйДокумент
	|			И ВтКРасчету.ДатаПлановогоПогашения = РасчетыСПоставщиками.ДатаПлановогоПогашения
	|			И РасчетыСПоставщиками.Активность
	|СГРУППИРОВАТЬ ПО
	|	ВтКРасчету.ЭтоРасчетыСКлиентами,
	|	ВтКРасчету.АналитикаУчетаПоПартнерам,
	|	ВтКРасчету.ОбъектРасчетов,
	|	ВтКРасчету.Валюта,
	|	ВтКРасчету.РасчетныйДокумент,
	|	ВтКРасчету.ДатаПлановогоПогашения,
	|	ВтКРасчету.ДатаВозникновения,
	|	ВтКРасчету.ПредоплатаОстаток,
	|	ВтКРасчету.ПредоплатаРеглОстаток,
	|	ВтКРасчету.ПредоплатаУпрОстаток,
	|	ВтКРасчету.ДолгРеглОстаток,
	|	ВтКРасчету.ДолгРеглОстатокРасчетный,
	|	ВтКРасчету.ДолгУпрОстаток,
	|	ВтКРасчету.ДолгУпрОстатокРасчетный";
	
	Запрос.УстановитьПараметр("МассивОрганизаций", МассивОрганизаций);
	Запрос.УстановитьПараметр("ВалютаУправленческогоУчета", Константы.ВалютаУправленческогоУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	Запрос.УстановитьПараметр("РасчетыСКлиентами", ЭтоРасчетыСКлиентами = Неопределено ИЛИ ЭтоРасчетыСКлиентами);
	Запрос.УстановитьПараметр("РасчетыСПоставщиками", ЭтоРасчетыСКлиентами = Неопределено ИЛИ НЕ ЭтоРасчетыСКлиентами);
	Граница = Новый Граница(КонецДня(Период),ВидГраницы.Включая);
	Запрос.УстановитьПараметр("Период", Граница);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ОбъектыКПереоценке = РезультатыЗапроса[1].Выгрузить();
	ДетальныеЗаписи    = РезультатыЗапроса[2].Выгрузить();
	ДетальныеЗаписи.Индексы.Добавить("ЭтоРасчетыСКлиентами");
	ДетальныеЗаписи.Индексы.Добавить("АналитикаУчетаПоПартнерам");
	ДетальныеЗаписи.Индексы.Добавить("ОбъектРасчетов");
	ДетальныеЗаписи.Индексы.Добавить("ВалютаРасчетов");
	СтруктураПоиска = Новый Структура("ЭтоРасчетыСКлиентами, АналитикаУчетаПоПартнерам, ОбъектРасчетов, ВалютаРасчетов");
	
	Порядок = Порядок(Период,"",,Тип("ДокументСсылка.РасчетКурсовыхРазниц"));
	РазмерПорцииЗаписи = РазмерПорцииЗаписи();
	
	ТаблицаИзменений = Новый ТаблицаЗначений;
	ТаблицаИзменений.Колонки.Добавить("Регистратор", Документы.ТипВсеСсылки());
	
	
	Для Каждого СтрокаПереоценки Из ОбъектыКПереоценке Цикл
		
		Если СтрокаПереоценки.ЭтоРасчетыСКлиентами Тогда
			ПереоценкаПоложительная = Перечисления.ХозяйственныеОперации.КурсовыеРазницыКлиентыПрибыль;
			ПереоценкаОтрицательная = Перечисления.ХозяйственныеОперации.КурсовыеРазницыКлиентыУбыток;
			НаборЗаписей = РегистрыНакопления.РасчетыСКлиентамиПоСрокам.СоздатьНаборЗаписей();
		Иначе
			ПереоценкаПоложительная = Перечисления.ХозяйственныеОперации.КурсовыеРазницыПоставщикиУбыток;
			ПереоценкаОтрицательная = Перечисления.ХозяйственныеОперации.КурсовыеРазницыПоставщикиПрибыль;
			НаборЗаписей = РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.СоздатьНаборЗаписей();
		КонецЕсли;
		
		НаборЗаписей.ДополнительныеСвойства.Вставить("ПроверятьИзмененияРегистра", Истина);
		
		ДокументыРасчетаКурсовыхРазниц = Документы.РасчетКурсовыхРазниц.ДокументыПереоценки(СтрокаПереоценки.Организация,
			Период, Период,
			СтрокаПереоценки.ЭтоРасчетыСКлиентами);
		ДокументРегистратор = ДокументыРасчетаКурсовыхРазниц[НачалоМесяца(Период)];
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаПереоценки);
		СтрокиДетальныхЗаписей = ДетальныеЗаписи.НайтиСтроки(СтруктураПоиска);
		
		НовСтр = ТаблицаИзменений.Добавить();
		НовСтр.Регистратор = ДокументРегистратор.Ссылка;
		
		
		Если СтрокиДетальныхЗаписей.Количество() > 0 Тогда
			ТаблицаСвободныхРегистраторов = СвободныеРегистраторыРасчетов(СтрокаПереоценки, НаборЗаписей.Метаданные().Имя, СтрокиДетальныхЗаписей.Количество() * 4);
			счРегистратор = 0;
			счСтрок = 0;
			
			НаборЗаписей.Отбор.Регистратор.Установить(ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка);
			НаборЗаписей.Прочитать();
			
			Для Каждого СтрокаДетальныхЗаписей Из СтрокиДетальныхЗаписей Цикл
				
				Если СтрокаДетальныхЗаписей.ДолгРеглОстаток < СтрокаДетальныхЗаписей.ДолгРеглОстатокРасчетный 
					ИЛИ СтрокаДетальныхЗаписей.ДолгУпрОстаток < СтрокаДетальныхЗаписей.ДолгУпрОстатокРасчетный Тогда
					НовСтр = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, СтрокаДетальныхЗаписей);
					
					НовСтр.Регистратор           = ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка;
					НовСтр.ДокументРегистратор   = ДокументРегистратор;
					НовСтр.Период                = КонецДня(Период);
					НовСтр.ПорядокОперации       = Порядок;
					НовСтр.ВидДвижения           = ВидДвиженияНакопления.Приход;
					НовСтр.ХозяйственнаяОперация = ПереоценкаПоложительная;
					НовСтр.Валюта                = СтрокаДетальныхЗаписей.ВалютаРасчетов;
					
					Если СтрокаДетальныхЗаписей.ДолгРеглОстаток < СтрокаДетальныхЗаписей.ДолгРеглОстатокРасчетный Тогда
						НовСтр.ДолгРегл = СтрокаДетальныхЗаписей.ДолгРеглОстатокРасчетный - СтрокаДетальныхЗаписей.ДолгРеглОстаток;
					КонецЕсли;
					Если СтрокаДетальныхЗаписей.ДолгУпрОстаток < СтрокаДетальныхЗаписей.ДолгУпрОстатокРасчетный Тогда
						НовСтр.ДолгУпр = СтрокаДетальныхЗаписей.ДолгУпрОстатокРасчетный - СтрокаДетальныхЗаписей.ДолгУпрОстаток;
					КонецЕсли;
					
					счСтрок = счСтрок + 1;
					Если счСтрок = РазмерПорцииЗаписи Тогда
						счСтрок = 0;
						счРегистратор = счРегистратор + 1;
						НаборЗаписей.Записать();
						НаборЗаписей.Отбор.Регистратор.Установить(ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка);
						НаборЗаписей.Прочитать();
					КонецЕсли;
					
				КонецЕсли;
				
				Если СтрокаДетальныхЗаписей.ДолгРеглОстаток > СтрокаДетальныхЗаписей.ДолгРеглОстатокРасчетный 
					ИЛИ СтрокаДетальныхЗаписей.ДолгУпрОстаток > СтрокаДетальныхЗаписей.ДолгУпрОстатокРасчетный Тогда
					НовСтр = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, СтрокаДетальныхЗаписей);
					
					НовСтр.Регистратор           = ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка;
					НовСтр.ДокументРегистратор   = ДокументРегистратор;
					НовСтр.Период                = КонецДня(Период);
					НовСтр.ПорядокОперации       = Порядок;
					НовСтр.ВидДвижения           = ВидДвиженияНакопления.Расход;
					НовСтр.ХозяйственнаяОперация = ПереоценкаОтрицательная;
					НовСтр.Валюта                = СтрокаДетальныхЗаписей.ВалютаРасчетов;
					
					Если СтрокаДетальныхЗаписей.ДолгРеглОстаток > СтрокаДетальныхЗаписей.ДолгРеглОстатокРасчетный Тогда
						НовСтр.ДолгРегл = СтрокаДетальныхЗаписей.ДолгРеглОстаток - СтрокаДетальныхЗаписей.ДолгРеглОстатокРасчетный;
					КонецЕсли;
					Если СтрокаДетальныхЗаписей.ДолгУпрОстаток > СтрокаДетальныхЗаписей.ДолгУпрОстатокРасчетный Тогда
						НовСтр.ДолгУпр = СтрокаДетальныхЗаписей.ДолгУпрОстаток - СтрокаДетальныхЗаписей.ДолгУпрОстатокРасчетный;
					КонецЕсли;
					
					счСтрок = счСтрок + 1;
					Если счСтрок = РазмерПорцииЗаписи Тогда
						счСтрок = 0;
						счРегистратор = счРегистратор + 1;
						НаборЗаписей.Записать();
						НаборЗаписей.Отбор.Регистратор.Установить(ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка);
						НаборЗаписей.Прочитать();
					КонецЕсли;
					
				КонецЕсли;
				
				Если СтрокаДетальныхЗаписей.ПредоплатаОстаток = 0
					И (СтрокаДетальныхЗаписей.ПредоплатаРеглОстаток > 0
						ИЛИ СтрокаДетальныхЗаписей.ПредоплатаУпрОстаток > 0) Тогда
					
					НовСтр = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, СтрокаДетальныхЗаписей);
					
					НовСтр.Регистратор           = ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка;
					НовСтр.ДокументРегистратор   = ДокументРегистратор;
					НовСтр.Период                = КонецДня(Период);
					НовСтр.ПорядокОперации       = Порядок;
					НовСтр.ВидДвижения           = ВидДвиженияНакопления.Расход;
					НовСтр.ХозяйственнаяОперация = ПереоценкаПоложительная;
					НовСтр.Валюта                = СтрокаДетальныхЗаписей.ВалютаРасчетов;
					
					Если СтрокаДетальныхЗаписей.ПредоплатаРеглОстаток > 0 Тогда
						НовСтр.ПредоплатаРегл = СтрокаДетальныхЗаписей.ПредоплатаРеглОстаток;
					КонецЕсли;
					Если СтрокаДетальныхЗаписей.ПредоплатаУпрОстаток > 0 Тогда
						НовСтр.ПредоплатаУпр = СтрокаДетальныхЗаписей.ПредоплатаУпрОстаток;
					КонецЕсли;
					
					счСтрок = счСтрок + 1;
					Если счСтрок = РазмерПорцииЗаписи Тогда
						счСтрок = 0;
						счРегистратор = счРегистратор + 1;
						НаборЗаписей.Записать();
						НаборЗаписей.Отбор.Регистратор.Установить(ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка);
						НаборЗаписей.Прочитать();
					КонецЕсли;
					
				КонецЕсли;
				
				Если СтрокаДетальныхЗаписей.ПредоплатаОстаток = 0
					И (СтрокаДетальныхЗаписей.ПредоплатаРеглОстаток < 0
						ИЛИ СтрокаДетальныхЗаписей.ПредоплатаУпрОстаток < 0) Тогда
					
					НовСтр = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, СтрокаДетальныхЗаписей);
					
					НовСтр.Регистратор           = ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка;
					НовСтр.ДокументРегистратор   = ДокументРегистратор;
					НовСтр.Период                = КонецДня(Период);
					НовСтр.ПорядокОперации       = Порядок;
					НовСтр.ВидДвижения           = ВидДвиженияНакопления.Приход;
					НовСтр.ХозяйственнаяОперация = ПереоценкаОтрицательная;
					НовСтр.Валюта                = СтрокаДетальныхЗаписей.ВалютаРасчетов;
					
					Если СтрокаДетальныхЗаписей.ПредоплатаРеглОстаток < 0 Тогда
						НовСтр.ПредоплатаРегл = -СтрокаДетальныхЗаписей.ПредоплатаРеглОстаток;
					КонецЕсли;
					Если СтрокаДетальныхЗаписей.ПредоплатаУпрОстаток < 0 Тогда
						НовСтр.ПредоплатаУпр = -СтрокаДетальныхЗаписей.ПредоплатаУпрОстаток;
					КонецЕсли;
					
					счСтрок = счСтрок + 1;
					Если счСтрок = РазмерПорцииЗаписи Тогда
						счСтрок = 0;
						счРегистратор = счРегистратор + 1;
						НаборЗаписей.Записать();
						НаборЗаписей.Отбор.Регистратор.Установить(ТаблицаСвободныхРегистраторов[счРегистратор].Ссылка);
						НаборЗаписей.Прочитать();
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЦикла;
	
	ПоляСворачивания = "Регистратор";
	ТаблицаИзменений.Свернуть(ПоляСворачивания);
	
	
	Если ЭтоРасчетыСКлиентами <> Неопределено Тогда
		Для Каждого Организация Из МассивОрганизаций Цикл
			
			ДокументыРасчетаКурсовыхРазниц = Документы.РасчетКурсовыхРазниц.ДокументыПереоценки(Организация,
				Период, Период,
				ЭтоРасчетыСКлиентами);
			ДокументРегистратор = ДокументыРасчетаКурсовыхРазниц[НачалоМесяца(Период)];
			
			Если ЭтоРасчетыСКлиентами Тогда
				НаборДвиженийПоДокументам = РегистрыНакопления.РасчетыСКлиентамиПоДокументам.СоздатьНаборЗаписей();
			Иначе
				НаборДвиженийПоДокументам = РегистрыНакопления.РасчетыСПоставщикамиПоДокументам.СоздатьНаборЗаписей();
			КонецЕсли;
			
			НаборДвиженийПоДокументам.Отбор.Регистратор.Установить(ДокументРегистратор);
			НаборДвиженийПоДокументам.Прочитать();
			Если НаборДвиженийПоДокументам.Количество() > 0 Тогда
				НаборДвиженийПоДокументам.Очистить();
				НаборДвиженийПоДокументам.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

//Возвращает строковый порядок документа по переданным параметрам.
//
// Параметры:
//	- Дата            - Дата      - Дата по которой нужно сделать строковый порядок.
//	- Номер           - Строка    - Номер документа.
//	- ВидТипДокумента - Структура - Если вид и тип документа уже определены, то они передаются в этот параметр.
//	- ТипДокумента    - Тип       - Тип ссылки документа.
//	- ВидДвижения     - Число     - 1 - Заказы, график исполнения договора.
//									2 - Накладные
//									3 - Корректировки реализации в минус
//									4 - Оплаты, возвраты
//
Функция Порядок(Дата, Номер, ВидТипДокумента = Неопределено, ТипДокумента = Неопределено, ВидДвижения = Неопределено) Экспорт
	Если НЕ ЗначениеЗаполнено(Дата) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	ДатаСтрокой = Формат(Дата, "ДФ=yyyyMMddHHmmss");
	Если ВидТипДокумента = Неопределено Тогда
		ВидТипДокумента = ВидТипДокумента(ТипДокумента, ВидДвижения);
	КонецЕсли;
	Возврат Лев(ДатаСтрокой, 8) + ВидТипДокумента.Вид + Прав(ДатаСтрокой, 6) + ВидТипДокумента.Тип + Номер;
КонецФункции

//Возвращает структуру параметров, необходимых для заполнения регистров взаиморасчетов в новой архитектуре.
//
// Возвращаемое значение:
// 		Структура
// 			* ОбъектРасчетов - ОпределяемыйТип.ОбъектРасчетов - объект расчетов, в рамках которого происходит распределение взаиморасчетов.
// 			* АналитикаУчетаПоПартнерам - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам - аналитика, в рамках которой происходит распределение взаиморасчетов.
// 			* ВалютаРасчетов - СправочникСсылка.Валюты - Валюта взаиморасчетов.
// 			* ЭтоРасчетыСКлиентами - Булево - Определяет регистры для заполнения - с клиентами или с поставщиками.
// 			* Порядок - Строка - Момент времени начиная с которого необходимо выполнить распределение, подробнее в ОперативныеВзаиморасчетыСервер.Порядок().
// 			* НачальноеЗаполнение - Булево - Истина, если это начальное заполнение.
// 			* Регистратор - ДокументСсылка - Документ регистратор, инициировавший распределение.
// 			* ДополнительныеСвойстваПроведения - Структура - Структура дополнительных свойств проведения, транслируемая из регистров накопления РасчетыСКлиентами РасчетыСПоставщиками
// 				Дополняется таблицей сформированных движений для дальнейшего использования в регл и упр учете.
//
Функция СтруктураПараметровЗаполненияВзаиморасчетов() Экспорт
	
	Структура = Новый Структура;
	Структура.Вставить("ОбъектРасчетов");
	Структура.Вставить("АналитикаУчетаПоПартнерам");
	Структура.Вставить("ВалютаРасчетов");
	Структура.Вставить("ЭтоРасчетыСКлиентами");
	Структура.Вставить("ПорядокФакт","");
	Структура.Вставить("ПорядокПлан","");
	Структура.Вставить("НачальноеЗаполнение", Ложь);
	Структура.Вставить("Регистратор", Неопределено);
	Структура.Вставить("ДополнительныеСвойстваПроведения", Неопределено);
	Структура.Вставить("ЗаписыватьИзменения", Истина);
	
	Возврат Структура;
	
КонецФункции

//Возвращает таблицу служебных документов РегистраторРасчетов для перезаписи по переданным параметрам.
//
// Параметры:
//	- Параметры - Структура
//		* ОбъектРасчетов - ОпределяемыйТип.ОбъектРасчетов - Объект расчетов.
//		* АналитикаУчетаПоПартнерам - СправочникСсылка.КлючиАналитикиУчетаПоПартнерам - Аналитика взаиморасчетов.
//		* Валюта - СправочникСсылка.Валюты - Валюта взаиморасчетов.
//		* ЭтоРасчетыСКлиентами - Булево - это расчеты с клиентами, а не с поставщиками.
//		* Организация - Неопределено, СправочникСсылка.Организации - Организация расчета.
//	- ИмяТаблицы - Строка - Имя регистра накопления, по которому определятся свободный регистратор или нет.
//	- КоличествоЗаписей - Число - Количество записей для последующей записи в регистр.
//
// Возвращаемое значение:
//	ТаблицаЗначений - таблица со следующими колонками:
//		* Ссылка - ДокументСсылка.РегистраторРасчетов - найденный служебный документ;
//		* ТребуетсяОчистка - Булево - У данного документа есть движения в переданной таблице.
//
Функция СвободныеРегистраторыРасчетов(Параметры, ИмяТаблицы, КоличествоЗаписей)
	
	Если КоличествоЗаписей = 0 Тогда
		КоличествоРегистраторов = 0;
	Иначе
		КоличествоРегистраторов = Цел(КоличествоЗаписей/РазмерПорцииЗаписи()) + 1;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Параметры,ИмяТаблицы + "Регистраторы") Тогда
		СписокПолныхРегистраторов = Параметры[ИмяТаблицы + "Регистраторы"];
	Иначе
		СписокПолныхРегистраторов = Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Валюта",                    Параметры.ВалютаРасчетов);
	Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам", Параметры.АналитикаУчетаПоПартнерам);
	Запрос.УстановитьПараметр("ОбъектРасчетов",            Параметры.ОбъектРасчетов);
	Запрос.УстановитьПараметр("СписокПолныхРегистраторов", СписокПолныхРегистраторов);
	
	ТипРасчетов = ?(Параметры.ЭтоРасчетыСКлиентами, Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом, Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком);
	Запрос.УстановитьПараметр("ТипРасчетов", ТипРасчетов);
		
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	РегистраторРасчетов.Ссылка                КАК Ссылка,
	|	СУММА(ЕСТЬNULL(Таблица.НомерСтроки,0)) > 0 КАК ТребуетсяОчистка
	|ИЗ
	|	Документ.РегистраторРасчетов КАК РегистраторРасчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.%ИмяТаблицы% КАК Таблица
	|			ПО Таблица.Регистратор = РегистраторРасчетов.Ссылка
	|ГДЕ
	|	РегистраторРасчетов.ОбъектРасчетов              = &ОбъектРасчетов
	|	И РегистраторРасчетов.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
	|	И РегистраторРасчетов.Валюта                    = &Валюта
	|	И РегистраторРасчетов.ТипРасчетов               = &ТипРасчетов
	|	И НЕ РегистраторРасчетов.Ссылка В (&СписокПолныхРегистраторов)
	|СГРУППИРОВАТЬ ПО
	|	РегистраторРасчетов.Ссылка";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяТаблицы%", ИмяТаблицы);
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить(); // см.СвободныеРегистраторыРасчетов
	
	Пока ТаблицаДокументов.Количество() < КоличествоРегистраторов Цикл
		ДокументОбъект = Документы.РегистраторРасчетов.СоздатьДокумент();
		ДокументОбъект.Валюта = Параметры.ВалютаРасчетов;
		ДокументОбъект.АналитикаУчетаПоПартнерам = Параметры.АналитикаУчетаПоПартнерам;
		ДокументОбъект.Организация = ?(Параметры.Организация = Неопределено,
										ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.АналитикаУчетаПоПартнерам, "Организация"),
										Параметры.Организация);
		ДокументОбъект.ОбъектРасчетов = Параметры.ОбъектРасчетов;
		ДокументОбъект.ТипРасчетов = ТипРасчетов;
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		НовСтр = ТаблицаДокументов.Добавить();
		НовСтр.Ссылка = ДокументОбъект.Ссылка;
		НовСтр.ТребуетсяОчистка = Ложь;
	КонецЦикла;
	
	Возврат ТаблицаДокументов;
	
КонецФункции

//Выполняет первоначальное заполнение регистров новой архитектуры
//
// Параметры:
//	- Параметры - Структура - параметры обработчика ожидания
//	- УникальныйИдентификатор - УникальныйИдентификатор - идентификатор обработчика ожидания.
//
Процедура ЗаполнитьРегистрыПриВключенииНовойАрхитектуры(Параметры, УникальныйИдентификатор) Экспорт
	
	ВыполненоОбновлениеРегистровРасчетов = ОбновлениеИнформационнойБазы.ОбъектОбработан("РасчетыСКлиентами").Обработан
			И ОбновлениеИнформационнойБазы.ОбъектОбработан("РасчетыСПоставщиками").Обработан
			И ОбновлениеИнформационнойБазы.ОбъектОбработан("РасчетыСКлиентамиПоДокументам").Обработан
			И ОбновлениеИнформационнойБазы.ОбъектОбработан("РасчетыСПоставщикамиПоДокументам").Обработан;
	
	Если НЕ ВыполненоОбновлениеРегистровРасчетов Тогда
		Текст = НСтр("ru='Включение онлайн взаиморасчетов с партнерами невозможно до конца обновления регистров расчетов.';uk='Включення онлайн взаєморозрахунків з партнерами неможливо до кінця оновлення регістрів розрахунків.'");
		ВызватьИсключение Текст;
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗаданияКРаспределениюРасчетовСКлиентами");
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗаданияКРаспределениюРасчетовСПоставщиками");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		Блокировка.Заблокировать();
		
		РаспределениеВзаиморасчетовВызовСервера.РаспределитьВсеРасчетыСКлиентами(ТекущаяДатаСеанса());
		РаспределениеВзаиморасчетовВызовСервера.РаспределитьВсеРасчетыСПоставщиками(ТекущаяДатаСеанса());
		
		Если НЕ Параметры.Свойство("ПовторныйЗапуск") Тогда
			ЗаполнитьРегистрПереходаНаОнлайн();
		КонецЕсли;
		Константы.НачатПереходНаНовуюАрхитектуруВзаиморасчетов.Установить(Истина);
				
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Текст = НСтр("ru='Включение онлайн взаиморасчетов с партнерами. Не удалось заполнить регистр перехода.';uk='Включення онлайн взаєморозрахунків з партнерами. Не вдалося заповнити регістр переходу.'",ОбщегоНазначения.КодОсновногоЯзыка());
		ЗаписьЖурналаРегистрации(Текст,
			УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
	ОписаниеЗамераПерехода = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("Взаиморасчеты.ПереходНаНовуюАрхитектуру.Многопоточный");
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		ОписаниеЗамераПерехода = ОценкаПроизводительности.НачатьЗамерДлительнойОперации("Взаиморасчеты.ПереходНаНовуюАрхитектуру.ФайловаяБаза");
	КонецЕсли;
	Если НЕ Параметры.Свойство("ПовторныйЗапуск") Тогда
		ОчиститьРегистрыВзаиморасчетов();
	КонецЕсли;
	
	//Фаза 1 - основной перенос
	ПараметрыПереноса = Новый Структура("ВсеДатыПересчета", Ложь);
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		ВсегоОбработано = ВыполнитьПереносОфлайнВзаиморасчетов(ПараметрыПереноса);
	Иначе
		КоличествоЗаписей = ВыполнитьМногопоточныйПереход();
		ВсегоОбработано = КоличествоЗаписей * КоличествоПотоковПереходаНаОнлайнВзаиморасчеты();
	КонецЕсли;
	
	
	//Фаза 2 - перенос хвостов (перепроведенные за время основного переноса)
	ПараметрыПереноса.ВсеДатыПересчета = Истина;
	НомерПопытки = 0;
	Пока НомерПопытки < 5 Цикл
		Константы.НачатПереходНаНовуюАрхитектуруВзаиморасчетов.Установить(Ложь);
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗаданияКРаспределениюРасчетовСКлиентами");
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗаданияКРаспределениюРасчетовСПоставщиками");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			
			РаспределениеВзаиморасчетовВызовСервера.РаспределитьВсеРасчетыСКлиентами(ТекущаяДатаСеанса());
			РаспределениеВзаиморасчетовВызовСервера.РаспределитьВсеРасчетыСПоставщиками(ТекущаяДатаСеанса());
			
			Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
				ВсегоОбработано = ВсегоОбработано + ВыполнитьПереносОфлайнВзаиморасчетов(ПараметрыПереноса);
			Иначе
				КоличествоЗаписей = ВыполнитьМногопоточныйПереход(ПараметрыПереноса.ВсеДатыПересчета);
				ВсегоОбработано = ВсегоОбработано + КоличествоЗаписей * КоличествоПотоковПереходаНаОнлайнВзаиморасчеты(); 
			КонецЕсли;
			
			// Исправим развернутое сальдо.
			ИсправитьРазвернутоеСальдо(НачалоМесяца(ТекущаяДатаСеанса()));
			
			Константы.НоваяАрхитектураВзаиморасчетов.Установить(Истина);
			
			ЗафиксироватьТранзакцию();
			
			Прервать;// Выходим из цикла попыток блокировки
			
		Исключение
			ОтменитьТранзакцию();
			
			НомерПопытки = НомерПопытки + 1;
			Текст =  НСтр("ru='Попытка';uk='Спроба'",ОбщегоНазначения.КодОсновногоЯзыка())+ " №" + НомерПопытки + Символы.ПС + Символы.ПС;
			Событие = НСтр("ru='Включение онлайн взаиморасчетов с партнерами. Этап 2.';uk='Включення онлайн взаєморозрахунків з партнерами. Етап 2.'",ОбщегоНазначения.КодОсновногоЯзыка());
			ЗаписьЖурналаРегистрации(Событие,
				УровеньЖурналаРегистрации.Ошибка,,, Текст + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамераПерехода, ВсегоОбработано);
	
КонецПроцедуры

//Очищает новые регистры расчетов в транзакции с блокировкой всех расчетов.
Процедура ОчиститьРегистрыПриВыключенииНовойАрхитектуры(Параметры = Неопределено, УникальныйИдентификатор = Неопределено) Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		ВернутьДвиженияПоРасчетамСКлиентами();
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗаданияКРаспределениюРасчетовСКлиентами");
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ЗаданияКРаспределениюРасчетовСПоставщиками");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		Блокировка.Заблокировать();
		
		РегистрыНакопления.РасчетыСКлиентамиПланОплат.УстановитьИспользованиеИтогов(Ложь);
		РегистрыНакопления.РасчетыСКлиентамиПланОтгрузок.УстановитьИспользованиеИтогов(Ложь);
		РегистрыНакопления.РасчетыСКлиентамиПоСрокам.УстановитьИспользованиеИтогов(Ложь);
		РегистрыНакопления.РасчетыСПоставщикамиПланОплат.УстановитьИспользованиеИтогов(Ложь);
		РегистрыНакопления.РасчетыСПоставщикамиПланПоставок.УстановитьИспользованиеИтогов(Ложь);
		РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.УстановитьИспользованиеИтогов(Ложь);
		
		ОчиститьРегистрыВзаиморасчетов();
		
		РегистрыНакопления.РасчетыСКлиентамиПланОплат.УстановитьИспользованиеИтогов(Истина);
		РегистрыНакопления.РасчетыСКлиентамиПланОтгрузок.УстановитьИспользованиеИтогов(Истина);
		РегистрыНакопления.РасчетыСКлиентамиПоСрокам.УстановитьИспользованиеИтогов(Истина);
		РегистрыНакопления.РасчетыСПоставщикамиПланОплат.УстановитьИспользованиеИтогов(Истина);
		РегистрыНакопления.РасчетыСПоставщикамиПланПоставок.УстановитьИспользованиеИтогов(Истина);
		РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.УстановитьИспользованиеИтогов(Истина);
		
		РегистрыНакопления.РасчетыСКлиентамиПланОплат.ПересчитатьИтоги();
		РегистрыНакопления.РасчетыСКлиентамиПланОтгрузок.ПересчитатьИтоги();
		РегистрыНакопления.РасчетыСКлиентамиПоСрокам.ПересчитатьИтоги();
		РегистрыНакопления.РасчетыСПоставщикамиПланОплат.ПересчитатьИтоги();
		РегистрыНакопления.РасчетыСПоставщикамиПланПоставок.ПересчитатьИтоги();
		РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.ПересчитатьИтоги();
		
		УдалитьСистемныеКорректировкиРегистров(Дата(1,1,1));
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(НСтр("ru='Выключение онлайн взаиморасчетов с партнерами.';uk='Вимкнення онлайн взаєморозрахунків з партнерами.'",ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

//Заполнение новых регистров по всем объектам расчетов.
Процедура ЗаполнитьПоВсемРасчетам(НачальноеЗаполнение = Ложь) Экспорт
	
	ОчиститьРегистрыВзаиморасчетов();
	
	ТаблицаОбъектов = ПолучитьВсеОбъекты();
	Для Каждого Стр из ТаблицаОбъектов Цикл
		ОсновныеПараметры = СтруктураПараметровЗаполненияВзаиморасчетов();
		ЗаполнитьЗначенияСвойств(ОсновныеПараметры,Стр);
		ОсновныеПараметры.НачальноеЗаполнение = НачальноеЗаполнение;
		ЗаполнитьОперативныеВзаиморасчеты(ОсновныеПараметры);
	КонецЦикла;
	
КонецПроцедуры

#Область ИсправлениеОшибок

// Формирует текст запроса для поиска некорректных данных в расчетных регистрах. 
// 
// Параметры:
// 	ИмяВТ - Строка - Имя временной таблицы для помещения результата
// Возвращаемое значение:
// 	Строка - Текст запроса
Функция ТекстЗапросаНекорректныхОстаткиВзаиморасчетовПоСрокам(ИмяВТ = "") Экспорт
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Ключи.Ссылка      КАК АналитикаУчетаПоПартнерам,
		|	Ключи.Организация КАК Организация
		|ПОМЕСТИТЬ ВтАналитика
		|ИЗ
		|	Справочник.КлючиАналитикиУчетаПоПартнерам КАК Ключи
		|ГДЕ
		|	Ключи.Организация В (&МассивОрганизаций)
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаПоПартнерам
		|;
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.ТипРасчетов                           КАК ТипРасчетов,
		|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам             КАК АналитикаУчетаПоПартнерам,
		|	ВложенныйЗапрос.ОбъектРасчетов                        КАК ОбъектРасчетов,
		|	ВложенныйЗапрос.Валюта                                КАК Валюта,
		|	СУММА(ВложенныйЗапрос.Сумма)                          КАК Сумма,
		|	СУММА(ВложенныйЗапрос.СуммаПоСрокам)                  КАК СуммаПоСрокам
		|ПОМЕСТИТЬ ВтОстатки
		|ИЗ (ВЫБРАТЬ
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом) КАК ТипРасчетов,
		|		РасчетыСКлиентами.АналитикаУчетаПоПартнерам                     КАК АналитикаУчетаПоПартнерам,
		|		РасчетыСКлиентами.ОбъектРасчетов                                КАК ОбъектРасчетов,
		|		РасчетыСКлиентами.Валюта                                        КАК Валюта,
		|		
		|		РасчетыСКлиентами.СуммаОстаток                                  КАК Сумма,
		|		0                                                               КАК СуммаПоСрокам
		|	ИЗ
		|		РегистрНакопления.РасчетыСКлиентами.Остатки(&НачалоМесяца, АналитикаУчетаПоПартнерам В
		|			(ВЫБРАТЬ
		|				ВтАналитика.АналитикаУчетаПоПартнерам
		|			ИЗ
		|				ВтАналитика КАК ВтАналитика)) КАК РасчетыСКлиентами
		|	ГДЕ
		|		РасчетыСКлиентами.СуммаОстаток <> 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)                     КАК ТипРасчетов,
		|		РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам                                 КАК АналитикаУчетаПоПартнерам,
		|		РасчетыСКлиентамиПоСрокам.ОбъектРасчетов                                            КАК ОбъектРасчетов,
		|		РасчетыСКлиентамиПоСрокам.Валюта                                                    КАК Валюта,
		|		
		|		0                                                                                   КАК Сумма,
		|		РасчетыСКлиентамиПоСрокам.ДолгОстаток - РасчетыСКлиентамиПоСрокам.ПредоплатаОстаток КАК СуммаПоСрокам
		|	ИЗ
		|		РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(&НачалоМесяца, АналитикаУчетаПоПартнерам В
		|			(ВЫБРАТЬ
		|				ВтАналитика.АналитикаУчетаПоПартнерам
		|			ИЗ
		|				ВтАналитика КАК ВтАналитика)) КАК РасчетыСКлиентамиПоСрокам
		|	ГДЕ
		|		РасчетыСКлиентамиПоСрокам.ДолгОстаток <> 0
		|		ИЛИ РасчетыСКлиентамиПоСрокам.ПредоплатаОстаток <> 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком) КАК ТипРасчетов,
		|		РасчетыСПоставщиками.АналитикаУчетаПоПартнерам                     КАК АналитикаУчетаПоПартнерам,
		|		РасчетыСПоставщиками.ОбъектРасчетов                                КАК ОбъектРасчетов,
		|		РасчетыСПоставщиками.Валюта                                        КАК Валюта,
		|		
		|		РасчетыСПоставщиками.СуммаОстаток                                  КАК Сумма,
		|		0                                                                  КАК СуммаПоСрокам
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщиками.Остатки(&НачалоМесяца, АналитикаУчетаПоПартнерам В
		|			(ВЫБРАТЬ
		|				ВтАналитика.АналитикаУчетаПоПартнерам
		|			ИЗ
		|				ВтАналитика КАК ВтАналитика)) КАК РасчетыСПоставщиками
		|	ГДЕ
		|		РасчетыСПоставщиками.СуммаОстаток <> 0
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)                        КАК ТипРасчетов,
		|		РасчетыСПоставщикамиПоСрокам.АналитикаУчетаПоПартнерам                                    КАК АналитикаУчетаПоПартнерам,
		|		РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов                                               КАК ОбъектРасчетов,
		|		РасчетыСПоставщикамиПоСрокам.Валюта                                                       КАК Валюта,
		|		
		|		0                                                                                         КАК Сумма,
		|		РасчетыСПоставщикамиПоСрокам.ПредоплатаОстаток - РасчетыСПоставщикамиПоСрокам.ДолгОстаток КАК СуммаПоСрокам
		|	ИЗ
		|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(&НачалоМесяца, АналитикаУчетаПоПартнерам В
		|			(ВЫБРАТЬ
		|				ВтАналитика.АналитикаУчетаПоПартнерам
		|			ИЗ
		|				ВтАналитика КАК ВтАналитика)) КАК РасчетыСПоставщикамиПоСрокам
		|	ГДЕ
		|		РасчетыСПоставщикамиПоСрокам.ДолгОстаток <> 0
		|		ИЛИ РасчетыСПоставщикамиПоСрокам.ПредоплатаОстаток <> 0) КАК ВложенныйЗапрос
		|СГРУППИРОВАТЬ ПО 
		|	ВложенныйЗапрос.ТипРасчетов,
		|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам,
		|	ВложенныйЗапрос.ОбъектРасчетов,
		|	ВложенныйЗапрос.Валюта
		|ИМЕЮЩИЕ
		|	СУММА(ВложенныйЗапрос.СуммаПоСрокам) <> СУММА(ВложенныйЗапрос.Сумма)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)    КАК ТипРасчетов,
		|	РасчетыПоСрокам.АналитикаУчетаПоПартнерам                          КАК АналитикаУчетаПоПартнерам,
		|	РасчетыПоСрокам.ОбъектРасчетов                                     КАК ОбъектРасчетов,
		|	РасчетыПоСрокам.Валюта                                             КАК Валюта,
		|	ВЫБОР КОГДА НЕ РасчетыПоСрокам.РасчетныйДокумент ЕСТЬ NULL
		|		И НЕ РасчетыПоСрокам.ДатаПлановогоПогашения ЕСТЬ NULL
		|		И НЕ РасчетыПоСрокам.ДатаВозникновения ЕСТЬ NULL
		|		ТОГДА 0
		|		ИНАЧЕ 0 
		|	КОНЕЦ                                                              КАК Сумма,
		|	РасчетыПоСрокам.ДолгОстаток + РасчетыПоСрокам.ПредоплатаОстаток    КАК СуммаПоСрокам
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(&НачалоМесяца, АналитикаУчетаПоПартнерам В
		|			(ВЫБРАТЬ
		|				ВтАналитика.АналитикаУчетаПоПартнерам
		|			ИЗ
		|				ВтАналитика КАК ВтАналитика)) КАК РасчетыПоСрокам
		|ГДЕ
		|	РасчетыПоСрокам.ДолгОстаток < 0
		|	ИЛИ РасчетыПоСрокам.ПредоплатаОстаток < 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком) КАК ТипРасчетов,
		|	РасчетыПоСрокам.АналитикаУчетаПоПартнерам                          КАК АналитикаУчетаПоПартнерам,
		|	РасчетыПоСрокам.ОбъектРасчетов                                     КАК ОбъектРасчетов,
		|	РасчетыПоСрокам.Валюта                                             КАК Валюта,
		|	ВЫБОР КОГДА НЕ РасчетыПоСрокам.РасчетныйДокумент ЕСТЬ NULL
		|		И НЕ РасчетыПоСрокам.ДатаПлановогоПогашения ЕСТЬ NULL
		|		И НЕ РасчетыПоСрокам.ДатаВозникновения ЕСТЬ NULL
		|		ТОГДА 0
		|		ИНАЧЕ 0 
		|	КОНЕЦ                                                              КАК Сумма,
		|	РасчетыПоСрокам.ДолгОстаток + РасчетыПоСрокам.ПредоплатаОстаток    КАК СуммаПоСрокам
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(&НачалоМесяца, АналитикаУчетаПоПартнерам В
		|			(ВЫБРАТЬ
		|				ВтАналитика.АналитикаУчетаПоПартнерам
		|			ИЗ
		|				ВтАналитика КАК ВтАналитика)) КАК РасчетыПоСрокам
		|ГДЕ
		|	РасчетыПоСрокам.ДолгОстаток < 0
		|	ИЛИ РасчетыПоСрокам.ПредоплатаОстаток < 0
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Аналитика.Организация             КАК Организация,
		|	Остатки.ТипРасчетов               КАК ТипРасчетов,
		|	Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Остатки.ОбъектРасчетов            КАК ОбъектРасчетов,
		|	Остатки.Валюта                    КАК ВалютаРасчетов
		|%ТекстПоместить%
		|ИЗ ВтОстатки КАК Остатки
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитика КАК Аналитика
		|		ПО Аналитика.АналитикаУчетаПоПартнерам = Остатки.АналитикаУчетаПоПартнерам";
	
	Если ЗначениеЗаполнено(ИмяВТ) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ТекстПоместить%","ПОМЕСТИТЬ "+ИмяВТ);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ТекстПоместить%","");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Формирует текст запроса для поиска записей с развернутым сальдо в расчетных регистрах. 
// 
// Параметры:
// 	ИмяВТ - Строка - Имя временной таблицы для помещения результата
// Возвращаемое значение:
// 	Строка - Текст запроса
Функция ТекстЗапросаРазвернутоеСальдо(ИмяВт = "") Экспорт
	
	ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Ключи.Ссылка      КАК АналитикаУчетаПоПартнерам,
		|	Ключи.Организация КАК Организация
		|ПОМЕСТИТЬ ВтАналитика
		|ИЗ
		|	Справочник.КлючиАналитикиУчетаПоПартнерам КАК Ключи
		|ГДЕ
		|	Ключи.Организация В (&МассивОрганизаций)
		|ИНДЕКСИРОВАТЬ ПО
		|	АналитикаУчетаПоПартнерам
		|;
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом) КАК ТипРасчетов,
		|	РасчетыСКлиентамиОстатки.АналитикаУчетаПоПартнерам              КАК АналитикаУчетаПоПартнерам,
		|	РасчетыСКлиентамиОстатки.ОбъектРасчетов                         КАК ОбъектРасчетов,
		|	РасчетыСКлиентамиОстатки.Валюта                                 КАК Валюта,
		|	РасчетыСКлиентамиОстатки.ДолгОстаток                            КАК ДолгОстаток,
		|	РасчетыСКлиентамиОстатки.ПредоплатаОстаток                      КАК ПредоплатаОстаток
		|ПОМЕСТИТЬ ВтСальдо
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(&НачалоМесяца, АналитикаУчетаПоПартнерам В
		|			(ВЫБРАТЬ
		|				ВтАналитика.АналитикаУчетаПоПартнерам
		|			ИЗ
		|				ВтАналитика КАК ВтАналитика)) КАК РасчетыСКлиентамиОстатки
		|ГДЕ
		|	РасчетыСКлиентамиОстатки.ДолгОстаток > 0 
		|	И РасчетыСКлиентамиОстатки.ПредоплатаОстаток > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком) КАК ТипРасчетов,
		|	РасчетыСПоставщикамиОстатки.АналитикаУчетаПоПартнерам              КАК АналитикаУчетаПоПартнерам,
		|	РасчетыСПоставщикамиОстатки.ОбъектРасчетов                         КАК ОбъектРасчетов,
		|	РасчетыСПоставщикамиОстатки.Валюта                                 КАК Валюта,
		|	РасчетыСПоставщикамиОстатки.ДолгОстаток                            КАК ДолгОстаток,
		|	РасчетыСПоставщикамиОстатки.ПредоплатаОстаток                      КАК ПредоплатаОстаток
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(&НачалоМесяца, АналитикаУчетаПоПартнерам В
		|			(ВЫБРАТЬ
		|				ВтАналитика.АналитикаУчетаПоПартнерам
		|			ИЗ
		|				ВтАналитика КАК ВтАналитика)) КАК РасчетыСПоставщикамиОстатки
		|ГДЕ
		|	РасчетыСПоставщикамиОстатки.ДолгОстаток > 0 
		|	И РасчетыСПоставщикамиОстатки.ПредоплатаОстаток > 0
		|;
		|ВЫБРАТЬ
		|	Аналитика.Организация            КАК Организация,
		|	Сальдо.ТипРасчетов               КАК ТипРасчетов,
		|	Сальдо.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Сальдо.ОбъектРасчетов            КАК ОбъектРасчетов,
		|	Сальдо.Валюта                    КАК ВалютаРасчетов,
		|	Сальдо.ДолгОстаток               КАК ДолгОстаток,
		|	Сальдо.ПредоплатаОстаток         КАК ПредоплатаОстаток
		|%ТекстПоместить%
		|ИЗ ВтСальдо КАК Сальдо
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтАналитика КАК Аналитика
		|		ПО Аналитика.АналитикаУчетаПоПартнерам = Сальдо.АналитикаУчетаПоПартнерам";
	
	Если ИмяВт <> "" Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ТекстПоместить%","ПОМЕСТИТЬ "+ИмяВт);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ТекстПоместить%","");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Исправление остатков по взаиморасчетам
// 
// Параметры:
// 	Период - Дата - Период проверки, на начало месяца периода будут проверены остатки, 
//		если они некорректные, то будет создана корректировка на конец предыдущего месяца.
//		Если на начало периода остатки в порядке, а на начало следующего месяца - нет, то будет запущен частичный пересчет расчетов
// 	МассивОрганизаций - Массив - Массив организация, по которым требуется исправить остатки взаиморасчетов
Процедура ИсправитьОстаткиВзаиморасчетов(Период, ЗНАЧ МассивОрганизаций = Неопределено) Экспорт
	
	ДатаКорректировки    = НачалоМесяца(Период)-1; //Для корректировки и движений
	ПорядокКорректировки = Формат(ДатаКорректировки,"ДФ=ггггММдд9ЧЧммсс99"); //Для запроса данных остатков.
	ПериодРасчета        = НачалоМесяца(Период); //Для сравнения остатков
	ПорядокРасчета       = Формат(ПериодРасчета, "ДФ=ггггММдд00000000"); //Для запуска пересчета
	
	МассивОрганизаций = ?(МассивОрганизаций = Неопределено,
							Справочники.Организации.ДоступныеОрганизации(),
							МассивОрганизаций);
	
	ТипыРасчетов = Новый Массив;
	ТипыРасчетов.Добавить(Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
	ТипыРасчетов.Добавить(Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = ТекстЗапросаНекорректныхОстаткиВзаиморасчетовПоСрокам();
	Запрос.УстановитьПараметр("НачалоМесяца",       ПериодРасчета);
	Запрос.УстановитьПараметр("МассивОрганизаций",  МассивОрганизаций);
	Запрос.УстановитьПараметр("Порядок",            ПорядокКорректировки);
	
	//Удалим корректировки
	НекорректныеОстатки = Запрос.Выполнить().Выгрузить();
	
	Если НекорректныеОстатки.Количество() > 0 Тогда
		МассивОрганизацийДляОбработки = НекорректныеОстатки.Скопировать(,"Организация");
		МассивОрганизацийДляОбработки.Свернуть("Организация");
		МассивОрганизацийДляОбработки = МассивОрганизацийДляОбработки.ВыгрузитьКолонку("Организация");
		Для Каждого Организация Из МассивОрганизаций Цикл
			УдалитьСистемныеКорректировкиРегистров(ДатаКорректировки,Организация)
		КонецЦикла;
		
		Запрос.Текст = "УНИЧТОЖИТЬ ВтАналитика; УНИЧТОЖИТЬ ВтОстатки";
		Запрос.Выполнить();
		
		//Перечитываем остатки
		Запрос.Текст = ТекстЗапросаНекорректныхОстаткиВзаиморасчетовПоСрокам();
		
		НекорректныеОстатки = Запрос.Выполнить().Выгрузить();
		НекорректныеОстатки.Индексы.Добавить("ТипРасчетов, Организация");
		СтруктураПоиска = Новый Структура("ТипРасчетов, Организация");
		
		МассивОрганизацийДляОбработки = НекорректныеОстатки.Скопировать(,"Организация");
		МассивОрганизацийДляОбработки.Свернуть("Организация");
		МассивОрганизацийДляОбработки = МассивОрганизацийДляОбработки.ВыгрузитьКолонку("Организация");
		
		Для Каждого Организация Из МассивОрганизацийДляОбработки Цикл
			
			//удалим корректировки развернутого сальдо, т.к. они могут быть уже неактуальны
			КорректировкаОбъект = КорректировкаРегистров(ДатаКорректировки, Организация, Перечисления.ОперацииКорректировкиРегистров.ИсправлениеРазвернутогоСальдоВзаиморасчетов);
			КорректировкаОбъект.Удалить();
			
			КорректировкаОбъект = КорректировкаРегистров(ДатаКорректировки, Организация, Перечисления.ОперацииКорректировкиРегистров.ИсправлениеРазрывовОстатковВзаиморасчетов);
			
			Для Каждого ТипРасчетов Из ТипыРасчетов Цикл
				
				ТипРасчетовСтрокой = ?(ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом,"РасчетыСКлиентами","РасчетыСПоставщиками");
				
				Движения = КорректировкаОбъект.Движения[ТипРасчетовСтрокой + "ПоСрокам"]; // РегистрНакопленияНаборЗаписей
				
				СтруктураПоиска.ТипРасчетов = ТипРасчетов;
				СтруктураПоиска.Организация = Организация;
				ЗаписиНекорректныхОстатков = НекорректныеОстатки.НайтиСтроки(СтруктураПоиска);
				
				Для Каждого ЗаписьНекорректныхОстатков Из ЗаписиНекорректныхОстатков Цикл
					
					//Рассчитаем корректные остатки.
					
					ДополнительныеСвойства = Новый Структура;
					
					ОсновныеПараметры = СтруктураПараметровЗаполненияВзаиморасчетов();
					
					ЗаполнитьЗначенияСвойств(ОсновныеПараметры, ЗаписьНекорректныхОстатков);
					ОсновныеПараметры.ЭтоРасчетыСКлиентами             = ТипРасчетовСтрокой = "РасчетыСКлиентами";
					ОсновныеПараметры.ДополнительныеСвойстваПроведения = ДополнительныеСвойства;
					ОсновныеПараметры.ЗаписыватьИзменения              = Ложь;
					
					ЗаполнитьОперативныеВзаиморасчеты(ОсновныеПараметры);
					
					//Сравним с остатками до и рассчитаем записи корректировки.
					
					Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам", ЗаписьНекорректныхОстатков.АналитикаУчетаПоПартнерам);
					Запрос.УстановитьПараметр("ОбъектРасчетов",            ЗаписьНекорректныхОстатков.ОбъектРасчетов);
					Запрос.УстановитьПараметр("Валюта",                    ЗаписьНекорректныхОстатков.ВалютаРасчетов);
					Запрос.УстановитьПараметр("РасчетыПоСрокам",           ДополнительныеСвойства[ТипРасчетовСтрокой + "ПоСрокам"]);
					
					Запрос.Текст = "
						//Записи после
						|ВЫБРАТЬ
						|	РасчетыПоСрокамПосле.Период                        КАК Период,
						|	РасчетыПоСрокамПосле.ВидДвижения                   КАК ВидДвижения,
						|	
						|	РасчетыПоСрокамПосле.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
						|	РасчетыПоСрокамПосле.ОбъектРасчетов                КАК ОбъектРасчетов,
						|	РасчетыПоСрокамПосле.Валюта                        КАК Валюта,
						|	РасчетыПоСрокамПосле.РасчетныйДокумент             КАК РасчетныйДокумент,
						|	РасчетыПоСрокамПосле.ДатаПлановогоПогашения        КАК ДатаПлановогоПогашения,
						|	РасчетыПоСрокамПосле.ДатаВозникновения             КАК ДатаВозникновения,
						|	
						|	ВЫРАЗИТЬ(РасчетыПоСрокамПосле.Предоплата КАК ЧИСЛО(31,2))     КАК Предоплата,
						|	ВЫРАЗИТЬ(РасчетыПоСрокамПосле.ПредоплатаРегл КАК ЧИСЛО(31,2)) КАК ПредоплатаРегл,
						|	ВЫРАЗИТЬ(РасчетыПоСрокамПосле.ПредоплатаУпр КАК ЧИСЛО(31,2))  КАК ПредоплатаУпр,
						|	ВЫРАЗИТЬ(РасчетыПоСрокамПосле.Долг КАК ЧИСЛО(31,2))           КАК Долг,
						|	ВЫРАЗИТЬ(РасчетыПоСрокамПосле.ДолгРегл КАК ЧИСЛО(31,2))       КАК ДолгРегл,
						|	ВЫРАЗИТЬ(РасчетыПоСрокамПосле.ДолгУпр КАК ЧИСЛО(31,2))        КАК ДолгУпр,
						|	
						|	РасчетыПоСрокамПосле.ПорядокЗачета                 КАК ПорядокЗачета,
						|	РасчетыПоСрокамПосле.ПорядокОперации               КАК ПорядокОперации,
						|	РасчетыПоСрокамПосле.СвязанныйДокумент             КАК СвязанныйДокумент,
						|	РасчетыПоСрокамПосле.ВалютаДокумента               КАК ВалютаДокумента,
						|	РасчетыПоСрокамПосле.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств
						|ПОМЕСТИТЬ РасчетыПоСрокамПосле
						|ИЗ &РасчетыПоСрокам КАК РасчетыПоСрокамПосле
						|ИНДЕКСИРОВАТЬ ПО
						|	АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта, РасчетныйДокумент
						|;
						//Расхождения
						|ВЫБРАТЬ
						|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
						|	ВложенныйЗапрос.ОбъектРасчетов            КАК ОбъектРасчетов,
						|	ВложенныйЗапрос.Валюта                    КАК Валюта,
						|	ВложенныйЗапрос.РасчетныйДокумент         КАК РасчетныйДокумент,
						|	ВложенныйЗапрос.ДатаПлановогоПогашения    КАК ДатаПлановогоПогашения,
						|	ВложенныйЗапрос.ДатаВозникновения         КАК ДатаВозникновения,
						|	СУММА(ВложенныйЗапрос.Предоплата)         КАК Предоплата,
						|	СУММА(ВложенныйЗапрос.ПредоплатаРегл)     КАК ПредоплатаРегл,
						|	СУММА(ВложенныйЗапрос.ПредоплатаУпр)      КАК ПредоплатаУпр,
						|	СУММА(ВложенныйЗапрос.Долг)               КАК Долг,
						|	СУММА(ВложенныйЗапрос.ДолгРегл)           КАК ДолгРегл,
						|	СУММА(ВложенныйЗапрос.ДолгУпр)            КАК ДолгУпр
						|ПОМЕСТИТЬ ТаблицаИзменений
						|ИЗ
						|	(ВЫБРАТЬ
						|		РасчетыПоСрокамДо.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
						|		РасчетыПоСрокамДо.ОбъектРасчетов            КАК ОбъектРасчетов,
						|		РасчетыПоСрокамДо.Валюта                    КАК Валюта,
						|		РасчетыПоСрокамДо.РасчетныйДокумент         КАК РасчетныйДокумент,
						|		РасчетыПоСрокамДо.ДатаПлановогоПогашения    КАК ДатаПлановогоПогашения,
						|		РасчетыПоСрокамДо.ДатаВозникновения         КАК ДатаВозникновения,
						|		-РасчетыПоСрокамДо.ПредоплатаОстаток        КАК Предоплата,
						|		-РасчетыПоСрокамДо.ПредоплатаРеглОстаток    КАК ПредоплатаРегл,
						|		-РасчетыПоСрокамДо.ПредоплатаУпрОстаток     КАК ПредоплатаУпр,
						|		-РасчетыПоСрокамДо.ДолгОстаток              КАК Долг,
						|		-РасчетыПоСрокамДо.ДолгРеглОстаток          КАК ДолгРегл,
						|		-РасчетыПоСрокамДо.ДолгУпрОстаток           КАК ДолгУпр
						|	ИЗ
						|		РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(&НачалоМесяца, 
						|			АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
						|			И ОбъектРасчетов = &ОбъектРасчетов
						|			И Валюта = &Валюта) КАК РасчетыПоСрокамДо
						|		
						|	ОБЪЕДИНИТЬ ВСЕ
						|	
						|	ВЫБРАТЬ
						|		РасчетыПоСрокамПосле.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
						|		РасчетыПоСрокамПосле.ОбъектРасчетов            КАК ОбъектРасчетов,
						|		РасчетыПоСрокамПосле.Валюта                    КАК Валюта,
						|		РасчетыПоСрокамПосле.РасчетныйДокумент         КАК РасчетныйДокумент,
						|		РасчетыПоСрокамПосле.ДатаПлановогоПогашения    КАК ДатаПлановогоПогашения,
						|		РасчетыПоСрокамПосле.ДатаВозникновения         КАК ДатаВозникновения,
						|		ВЫБОР КОГДА РасчетыПоСрокамПосле.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
						|				ТОГДА -РасчетыПоСрокамПосле.Предоплата
						|			ИНАЧЕ РасчетыПоСрокамПосле.Предоплата
						|		КОНЕЦ                                          КАК Предоплата,
						|		ВЫБОР КОГДА РасчетыПоСрокамПосле.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
						|				ТОГДА -РасчетыПоСрокамПосле.ПредоплатаРегл
						|			ИНАЧЕ РасчетыПоСрокамПосле.ПредоплатаРегл
						|		КОНЕЦ                                          КАК ПредоплатаРегл,
						|		ВЫБОР КОГДА РасчетыПоСрокамПосле.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
						|				ТОГДА -РасчетыПоСрокамПосле.ПредоплатаУпр
						|			ИНАЧЕ РасчетыПоСрокамПосле.ПредоплатаУпр
						|		КОНЕЦ                                          КАК ПредоплатаУпр,
						|		ВЫБОР КОГДА РасчетыПоСрокамПосле.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
						|				ТОГДА -РасчетыПоСрокамПосле.Долг
						|			ИНАЧЕ РасчетыПоСрокамПосле.Долг
						|		КОНЕЦ                                          КАК Долг,
						|		ВЫБОР КОГДА РасчетыПоСрокамПосле.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
						|				ТОГДА -РасчетыПоСрокамПосле.ДолгРегл
						|			ИНАЧЕ РасчетыПоСрокамПосле.ДолгРегл
						|		КОНЕЦ                                          КАК ДолгРегл,
						|		ВЫБОР КОГДА РасчетыПоСрокамПосле.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
						|				ТОГДА -РасчетыПоСрокамПосле.ДолгУпр
						|			ИНАЧЕ РасчетыПоСрокамПосле.ДолгУпр
						|		КОНЕЦ                                          КАК ДолгУпр
						|	ИЗ
						|		РасчетыПоСрокамПосле КАК РасчетыПоСрокамПосле
						|	ГДЕ
						|		РасчетыПоСрокамПосле.Период < &НачалоМесяца) КАК ВложенныйЗапрос
						|СГРУППИРОВАТЬ ПО
						|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам,
						|	ВложенныйЗапрос.ОбъектРасчетов,
						|	ВложенныйЗапрос.Валюта,
						|	ВложенныйЗапрос.РасчетныйДокумент,
						|	ВложенныйЗапрос.ДатаПлановогоПогашения,
						|	ВложенныйЗапрос.ДатаВозникновения
						|ИМЕЮЩИЕ
						|	СУММА(ВложенныйЗапрос.Предоплата) <> 0 ИЛИ СУММА(ВложенныйЗапрос.Долг) <> 0
						|ИНДЕКСИРОВАТЬ ПО
						|	АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта, РасчетныйДокумент
						|;
						|
						//Данные для движений
						|ВЫБРАТЬ
						|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)                       КАК ВидДвижения,
						|	
						|	Изменения.АналитикаУчетаПоПартнерам                          КАК АналитикаУчетаПоПартнерам,
						|	Изменения.ОбъектРасчетов                                     КАК ОбъектРасчетов,
						|	Изменения.Валюта                                             КАК Валюта,
						|	Изменения.РасчетныйДокумент                                  КАК РасчетныйДокумент,
						|	Изменения.ДатаПлановогоПогашения                             КАК ДатаПлановогоПогашения,
						|	Изменения.ДатаВозникновения                                  КАК ДатаВозникновения,
						|	
						|	Изменения.Предоплата                                         КАК Предоплата,
						|	Изменения.ПредоплатаРегл                                     КАК ПредоплатаРегл,
						|	Изменения.ПредоплатаУпр                                      КАК ПредоплатаУпр,
						|	Изменения.Долг                                               КАК Долг,
						|	Изменения.ДолгРегл                                           КАК ДолгРегл,
						|	Изменения.ДолгУпр                                            КАК ДолгУпр,
						|	
						|	МИНИМУМ(РасчетыПоСрокамПосле.ПорядокЗачета)                  КАК ПорядокЗачета,
						|	МИНИМУМ(РасчетыПоСрокамПосле.ПорядокОперации)                КАК ПорядокОперации,
						|	МАКСИМУМ(РасчетыПоСрокамПосле.СвязанныйДокумент)             КАК СвязанныйДокумент,
						|	МИНИМУМ(РасчетыПоСрокамПосле.ВалютаДокумента)                КАК ВалютаДокумента,
						|	МАКСИМУМ(РасчетыПоСрокамПосле.СтатьяДвиженияДенежныхСредств) КАК СтатьяДвиженияДенежныхСредств,
						|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)    КАК ХозяйственнаяОперация
						|
						|ИЗ
						|	ТаблицаИзменений КАК Изменения
						|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетыПоСрокамПосле КАК РасчетыПоСрокамПосле
						|			ПО РасчетыПоСрокамПосле.АналитикаУчетаПоПартнерам    = Изменения.АналитикаУчетаПоПартнерам
						|				И РасчетыПоСрокамПосле.ОбъектРасчетов            = Изменения.ОбъектРасчетов
						|				И РасчетыПоСрокамПосле.Валюта                    = Изменения.Валюта
						|				И РасчетыПоСрокамПосле.РасчетныйДокумент         = Изменения.РасчетныйДокумент
						|ГДЕ
						|	Изменения.Предоплата > 0 ИЛИ Изменения.Долг > 0
						|СГРУППИРОВАТЬ ПО
						|	Изменения.АналитикаУчетаПоПартнерам,
						|	Изменения.ОбъектРасчетов,
						|	Изменения.Валюта,
						|	Изменения.РасчетныйДокумент,
						|	Изменения.ДатаПлановогоПогашения,
						|	Изменения.ДатаВозникновения,
						|	Изменения.Предоплата,
						|	Изменения.ПредоплатаРегл,
						|	Изменения.ПредоплатаУпр,
						|	Изменения.Долг,
						|	Изменения.ДолгРегл,
						|	Изменения.ДолгУпр
						|	
						|ОБЪЕДИНИТЬ ВСЕ
						|	
						|ВЫБРАТЬ
						|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
						|	
						|	Изменения.АналитикаУчетаПоПартнерам                       КАК АналитикаУчетаПоПартнерам,
						|	Изменения.ОбъектРасчетов                                  КАК ОбъектРасчетов,
						|	Изменения.Валюта                                          КАК Валюта,
						|	Изменения.РасчетныйДокумент                               КАК РасчетныйДокумент,
						|	Изменения.ДатаПлановогоПогашения                          КАК ДатаПлановогоПогашения,
						|	Изменения.ДатаВозникновения                               КАК ДатаВозникновения,
						|	
						|	-Изменения.Предоплата                                     КАК Предоплата,
						|	-Изменения.ПредоплатаРегл                                 КАК ПредоплатаРегл,
						|	-Изменения.ПредоплатаУпр                                  КАК ПредоплатаУпр,
						|	-Изменения.Долг                                           КАК Долг,
						|	-Изменения.ДолгРегл                                       КАК ДолгРегл,
						|	-Изменения.ДолгУпр                                        КАК ДолгУпр,
						|	
						|	МИНИМУМ(РасчетыПоСрокамДо.ПорядокЗачета)                  КАК ПорядокЗачета,
						|	МИНИМУМ(РасчетыПоСрокамДо.ПорядокОперации)                КАК ПорядокОперации,
						|	МАКСИМУМ(РасчетыПоСрокамДо.СвязанныйДокумент)             КАК СвязанныйДокумент,
						|	МИНИМУМ(РасчетыПоСрокамДо.ВалютаДокумента)                КАК ВалютаДокумента,
						|	МАКСИМУМ(РасчетыПоСрокамДо.СтатьяДвиженияДенежныхСредств) КАК СтатьяДвиженияДенежныхСредств,
						|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация
						|
						|ИЗ
						|	ТаблицаИзменений КАК Изменения
						|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокамДо
						|			ПО РасчетыПоСрокамДо.АналитикаУчетаПоПартнерам    = Изменения.АналитикаУчетаПоПартнерам
						|				И РасчетыПоСрокамДо.ОбъектРасчетов            = Изменения.ОбъектРасчетов
						|				И РасчетыПоСрокамДо.Валюта                    = Изменения.Валюта
						|				И РасчетыПоСрокамДо.РасчетныйДокумент         = Изменения.РасчетныйДокумент
						|				И РасчетыПоСрокамДо.Период                    < &НачалоМесяца
						|				И РасчетыПоСрокамДо.Активность
						|ГДЕ
						|	Изменения.Предоплата < 0 ИЛИ Изменения.Долг < 0
						|СГРУППИРОВАТЬ ПО
						|	Изменения.АналитикаУчетаПоПартнерам,
						|	Изменения.ОбъектРасчетов,
						|	Изменения.Валюта,
						|	Изменения.РасчетныйДокумент,
						|	Изменения.ДатаПлановогоПогашения,
						|	Изменения.ДатаВозникновения,
						|	-Изменения.Предоплата,
						|	-Изменения.ПредоплатаРегл,
						|	-Изменения.ПредоплатаУпр,
						|	-Изменения.Долг,
						|	-Изменения.ДолгРегл,
						|	-Изменения.ДолгУпр";
						
						Запрос.Текст = СтрЗаменить(Запрос.Текст, "РасчетыСКлиентами", ТипРасчетовСтрокой);
						
						Результат = Запрос.Выполнить();
						Выборка = Результат.Выбрать();
						
						Запрос.Текст = "УНИЧТОЖИТЬ РасчетыПоСрокамПосле; УНИЧТОЖИТЬ ТаблицаИзменений";
						Запрос.Выполнить();
						
						Пока Выборка.Следующий() Цикл
							
							НовСтр = Движения.Добавить();
							ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
							
							НовСтр.ДокументРегистратор = КорректировкаОбъект.Ссылка;
							НовСтр.Период = ДатаКорректировки;
							
						КонецЦикла;
						
				КонецЦикла;
				
				Движения.Записать();
				
				Для Каждого ЗаписьНекорректныхОстатков Из ЗаписиНекорректныхОстатков Цикл
					
					ОсновныеПараметры = СтруктураПараметровЗаполненияВзаиморасчетов();
					
					ЗаполнитьЗначенияСвойств(ОсновныеПараметры, ЗаписьНекорректныхОстатков);
					ОсновныеПараметры.ЭтоРасчетыСКлиентами = ТипРасчетовСтрокой = "РасчетыСКлиентами";
					ОсновныеПараметры.ПорядокФакт              = ПорядокРасчета;
					ОсновныеПараметры.ПорядокПлан              = ПорядокРасчета;
					
					ЗаполнитьОперативныеВзаиморасчеты(ОсновныеПараметры);
					
				КонецЦикла;
				
			КонецЦикла;
			
			Если КорректировкаОбъект.Движения.РасчетыСКлиентамиПоСрокам.Количество() = 0 
				И КорректировкаОбъект.Движения.РасчетыСПоставщикамиПоСрокам.Количество() = 0 Тогда
				КорректировкаОбъект.Удалить();
			Иначе
				ДополнитьКорректировкуДвижениямиПоПрочимДоходамРасходам(КорректировкаОбъект);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос.Текст = "УНИЧТОЖИТЬ ВтАналитика; УНИЧТОЖИТЬ ВтОстатки";
	Запрос.Выполнить();
	
	ПроверитьИсправитьПлановыеОплаты(ПериодРасчета);
	
	//Если на начало периода все хорошо, а на конец есть некорректные остатки - пересчитаем их.
	Запрос.Текст = ТекстЗапросаНекорректныхОстаткиВзаиморасчетовПоСрокам();
	Запрос.УстановитьПараметр("НачалоМесяца",       КонецМесяца(ПериодРасчета));
	Запрос.УстановитьПараметр("Порядок",            Формат(КонецМесяца(ПериодРасчета),"ДФ=ггггММдд9ЧЧммсс99"));
	НекорректныеОстатки = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр Из НекорректныеОстатки Цикл
		
		ОсновныеПараметры = СтруктураПараметровЗаполненияВзаиморасчетов();
		
		ЗаполнитьЗначенияСвойств(ОсновныеПараметры, Стр);
		ОсновныеПараметры.ЭтоРасчетыСКлиентами = Стр.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
		ОсновныеПараметры.ПорядокПлан              = ПорядокРасчета;
		ОсновныеПараметры.ПорядокФакт              = ПорядокРасчета;
		
		ЗаполнитьОперативныеВзаиморасчеты(ОсновныеПараметры);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьИсправитьПлановыеОплаты(НачалоМесяца)
	 //Проверим плановые оплаты на развернутый остаток, если есть - пересчитаем с начала ведения учета.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиПланОплатОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентамиПланОплатОстатки.ОбъектРасчетов            КАК ОбъектРасчетов,
	|	РасчетыСКлиентамиПланОплатОстатки.Валюта                    КАК ВалютаРасчетов,
	|	РасчетыСКлиентамиПланОплатОстатки.КОплатеОстаток            КАК КОплатеОстаток,
	|	РасчетыСКлиентамиПланОплатОстатки.ОплаченоОстаток           КАК ОплаченоОстаток,
	|	ИСТИНА                                                      КАК ЭтоРасчетыСКлиентами
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПланОплат.Остатки(&НачалоМесяца, ) КАК РасчетыСКлиентамиПланОплатОстатки
	|ГДЕ
	|	РасчетыСКлиентамиПланОплатОстатки.КОплатеОстаток <> 0
	|	И РасчетыСКлиентамиПланОплатОстатки.ОплаченоОстаток <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСПоставщикамиПланОплат.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщикамиПланОплат.ОбъектРасчетов            КАК ОбъектРасчетов,
	|	РасчетыСПоставщикамиПланОплат.Валюта                    КАК ВалютаРасчетов,
	|	РасчетыСПоставщикамиПланОплат.КОплатеОстаток            КАК КОплатеОстаток,
	|	РасчетыСПоставщикамиПланОплат.ОплаченоОстаток           КАК ОплаченоОстаток,
	|	ЛОЖЬ                                                    КАК ЭтоРасчетыСКлиентами
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПланОплат.Остатки(&НачалоМесяца, ) КАК РасчетыСПоставщикамиПланОплат
	|ГДЕ
	|	РасчетыСПоставщикамиПланОплат.КОплатеОстаток <> 0
	|	И РасчетыСПоставщикамиПланОплат.ОплаченоОстаток <> 0";
	
	НекорректныеОстаткиПланов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр Из НекорректныеОстаткиПланов Цикл
		
		ОсновныеПараметры = СтруктураПараметровЗаполненияВзаиморасчетов();
		ЗаполнитьЗначенияСвойств(ОсновныеПараметры, Стр);
		ОсновныеПараметры.НачальноеЗаполнение = Истина;
		ЗаполнитьОперативныеВзаиморасчеты(ОсновныеПараметры);
		
	КонецЦикла;
	
КонецПроцедуры

// Исправление развернутого сальдо по взаиморасчетам
// 
// Параметры:
// 	Период - Дата - Период проверки, требуется указать конец месяца
// 	МассивОрганизаций - Массив - Массив организация, по которым требуется исправить развернутое сальдо взаиморасчетов
Процедура ИсправитьРазвернутоеСальдо(Период, ЗНАЧ МассивОрганизаций = Неопределено) Экспорт
	
	ДатаКорректировки    = НачалоМесяца(Период)-1; //Для корректировки и движений
	ПорядокКорректировки = Формат(ДатаКорректировки,"ДФ=ггггММдд9ЧЧммсс99"); //Для запроса данных остатков.
	ПериодРасчета        = НачалоМесяца(Период); //Для сравнения остатков
	ПорядокРасчета       = Формат(ПериодРасчета, "ДФ=ггггММдд00000000"); //Для запуска пересчета
	
	МассивОрганизаций = ?(МассивОрганизаций = Неопределено,
							Справочники.Организации.ДоступныеОрганизации(),
							МассивОрганизаций);
	
	ТипыРасчетов = Новый Массив;
	ТипыРасчетов.Добавить(Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом);
	ТипыРасчетов.Добавить(Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = ТекстЗапросаРазвернутоеСальдо("АналитикиСуммы");
	Запрос.УстановитьПараметр("НачалоМесяца",       ПериодРасчета);
	Запрос.УстановитьПараметр("МассивОрганизаций",  МассивОрганизаций);
	Запрос.УстановитьПараметр("Порядок",            ПорядокКорректировки);
	Запрос.Выполнить();
	
	РазвернутоеСальдо = Запрос.МенеджерВременныхТаблиц.Таблицы["АналитикиСуммы"].ПолучитьДанные().Выгрузить();
	
	МассивОрганизацийДляОбработки = РазвернутоеСальдо.Скопировать(,"Организация");
	МассивОрганизацийДляОбработки.Свернуть("Организация");
	МассивОрганизацийДляОбработки = МассивОрганизацийДляОбработки.ВыгрузитьКолонку("Организация");
	
	Если РазвернутоеСальдо.Количество() > 0 Тогда
		Для Каждого Организация Из МассивОрганизаций Цикл
			УдалитьСистемныеКорректировкиРегистров(ДатаКорректировки, Организация, Перечисления.ОперацииКорректировкиРегистров.ИсправлениеРазвернутогоСальдоВзаиморасчетов)
		КонецЦикла;
		ПроверитьИсправитьПлановыеОплаты(ПериодРасчета);
		
		Запрос.Текст = "УНИЧТОЖИТЬ ВтАналитика; УНИЧТОЖИТЬ ВтСальдо; УНИЧТОЖИТЬ АналитикиСуммы";
		Запрос.Выполнить();
		
		//Перечитываем остатки
		
		Запрос.Текст = ТекстЗапросаРазвернутоеСальдо("АналитикиСуммы");
		Запрос.Выполнить();
		РазвернутоеСальдо = Запрос.МенеджерВременныхТаблиц.Таблицы["АналитикиСуммы"].ПолучитьДанные().Выгрузить();
		
		РазвернутоеСальдо.Индексы.Добавить("ТипРасчетов, Организация");
		СтруктураПоиска = Новый Структура("ТипРасчетов, Организация");
		
		Запрос.Текст = "ВЫБРАТЬ
			|	РасчетыСКлиентамиПоСрокамОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	РасчетыСКлиентамиПоСрокамОстатки.ОбъектРасчетов КАК ОбъектРасчетов,
			|	РасчетыСКлиентамиПоСрокамОстатки.Валюта КАК Валюта,
			|	РасчетыСКлиентамиПоСрокамОстатки.РасчетныйДокумент КАК РасчетныйДокумент,
			|	РасчетыСКлиентамиПоСрокамОстатки.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
			|	РасчетыСКлиентамиПоСрокамОстатки.ДатаВозникновения КАК ДатаВозникновения,
			|	РасчетыСКлиентамиПоСрокамОстатки.ПредоплатаОстаток КАК Предоплата,
			|	РасчетыСКлиентамиПоСрокамОстатки.ПредоплатаРеглОстаток КАК ПредоплатаРегл,
			|	РасчетыСКлиентамиПоСрокамОстатки.ПредоплатаУпрОстаток КАК ПредоплатаУпр,
			|	РасчетыСКлиентамиПоСрокамОстатки.ДолгОстаток КАК Долг,
			|	РасчетыСКлиентамиПоСрокамОстатки.ДолгРеглОстаток КАК ДолгРегл,
			|	РасчетыСКлиентамиПоСрокамОстатки.ДолгУпрОстаток КАК ДолгУпр
			|ПОМЕСТИТЬ ВТРасчетыСКлиентамиПоСрокамОстатки
			|ИЗ
			|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(&НачалоМесяца, 
			|		(АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта)
			|			В (ВЫБРАТЬ АналитикаУчетаПоПартнерам, ОбъектРасчетов, ВалютаРасчетов 
			|				ИЗ АналитикиСуммы
			|				ГДЕ ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
			|				)) КАК РасчетыСКлиентамиПоСрокамОстатки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта, РасчетныйДокумент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РасчетыСПоставщикамиПоСрокамОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	РасчетыСПоставщикамиПоСрокамОстатки.ОбъектРасчетов КАК ОбъектРасчетов,
			|	РасчетыСПоставщикамиПоСрокамОстатки.Валюта КАК Валюта,
			|	РасчетыСПоставщикамиПоСрокамОстатки.РасчетныйДокумент КАК РасчетныйДокумент,
			|	РасчетыСПоставщикамиПоСрокамОстатки.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
			|	РасчетыСПоставщикамиПоСрокамОстатки.ДатаВозникновения КАК ДатаВозникновения,
			|	РасчетыСПоставщикамиПоСрокамОстатки.ПредоплатаОстаток КАК ПредоплатаОстаток,
			|	РасчетыСПоставщикамиПоСрокамОстатки.ПредоплатаРеглОстаток КАК ПредоплатаРеглОстаток,
			|	РасчетыСПоставщикамиПоСрокамОстатки.ПредоплатаУпрОстаток КАК ПредоплатаУпрОстаток,
			|	РасчетыСПоставщикамиПоСрокамОстатки.ДолгОстаток КАК ДолгОстаток,
			|	РасчетыСПоставщикамиПоСрокамОстатки.ДолгРеглОстаток КАК ДолгРеглОстаток,
			|	РасчетыСПоставщикамиПоСрокамОстатки.ДолгУпрОстаток КАК ДолгУпрОстаток
			|ПОМЕСТИТЬ ВТРасчетыСПоставщикамиПоСрокамОстатки
			|ИЗ
			|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Остатки(&НачалоМесяца, 
			|		(АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта)
			|			В (ВЫБРАТЬ АналитикаУчетаПоПартнерам, ОбъектРасчетов, ВалютаРасчетов 
			|					ИЗ АналитикиСуммы
			|					ГДЕ ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
			|					)) КАК РасчетыСПоставщикамиПоСрокамОстатки
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта, РасчетныйДокумент
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом) КАК ТипРасчетов,
			|	РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
			|	РасчетыПоСрокамОстатки.ОбъектРасчетов КАК ОбъектРасчетов,
			|	РасчетыПоСрокамОстатки.Валюта КАК Валюта,
			|	РасчетыПоСрокамОстатки.РасчетныйДокумент КАК РасчетныйДокумент,
			|	РасчетыПоСрокамОстатки.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
			|	РасчетыПоСрокамОстатки.ДатаВозникновения КАК ДатаВозникновения,
			|	РасчетыПоСрокамОстатки.Предоплата КАК Предоплата,
			|	РасчетыПоСрокамОстатки.ПредоплатаРегл КАК ПредоплатаРегл,
			|	РасчетыПоСрокамОстатки.ПредоплатаУпр КАК ПредоплатаУпр,
			|	РасчетыПоСрокамОстатки.Долг КАК Долг,
			|	РасчетыПоСрокамОстатки.ДолгРегл КАК ДолгРегл,
			|	РасчетыПоСрокамОстатки.ДолгУпр КАК ДолгУпр,
			|	МИНИМУМ(РасчетыПоСрокамДо.ПорядокЗачета) КАК ПорядокЗачета,
			|	МИНИМУМ(РасчетыПоСрокамДо.ПорядокОперации) КАК ПорядокОперации,
			|	МАКСИМУМ(РасчетыПоСрокамДо.СвязанныйДокумент) КАК СвязанныйДокумент,
			|	МИНИМУМ(РасчетыПоСрокамДо.ВалютаДокумента) КАК ВалютаДокумента,
			|	МАКСИМУМ(РасчетыПоСрокамДо.СтатьяДвиженияДенежныхСредств) КАК СтатьяДвиженияДенежныхСредств,
			|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация
			|ИЗ
			|	ВТРасчетыСКлиентамиПоСрокамОстатки КАК РасчетыПоСрокамОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокамДо
			|		ПО (РасчетыПоСрокамДо.АналитикаУчетаПоПартнерам = РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам)
			|			И (РасчетыПоСрокамДо.ОбъектРасчетов = РасчетыПоСрокамОстатки.ОбъектРасчетов)
			|			И (РасчетыПоСрокамДо.Валюта = РасчетыПоСрокамОстатки.Валюта)
			|			И (РасчетыПоСрокамДо.РасчетныйДокумент = РасчетыПоСрокамОстатки.РасчетныйДокумент)
			|			И (РасчетыПоСрокамДо.Период < &НачалоМесяца)
			|			И (РасчетыПоСрокамДо.Активность)
			|
			|СГРУППИРОВАТЬ ПО
			|	РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам,
			|	РасчетыПоСрокамОстатки.ОбъектРасчетов,
			|	РасчетыПоСрокамОстатки.Валюта,
			|	РасчетыПоСрокамОстатки.РасчетныйДокумент,
			|	РасчетыПоСрокамОстатки.ДатаПлановогоПогашения,
			|	РасчетыПоСрокамОстатки.ДатаВозникновения,
			|	РасчетыПоСрокамОстатки.Предоплата,
			|	РасчетыПоСрокамОстатки.ПредоплатаРегл,
			|	РасчетыПоСрокамОстатки.ПредоплатаУпр,
			|	РасчетыПоСрокамОстатки.Долг,
			|	РасчетыПоСрокамОстатки.ДолгРегл,
			|	РасчетыПоСрокамОстатки.ДолгУпр
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком),
			|	РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам,
			|	РасчетыПоСрокамОстатки.ОбъектРасчетов,
			|	РасчетыПоСрокамОстатки.Валюта,
			|	РасчетыПоСрокамОстатки.РасчетныйДокумент,
			|	РасчетыПоСрокамОстатки.ДатаПлановогоПогашения,
			|	РасчетыПоСрокамОстатки.ДатаВозникновения,
			|	РасчетыПоСрокамОстатки.ПредоплатаОстаток,
			|	РасчетыПоСрокамОстатки.ПредоплатаРеглОстаток,
			|	РасчетыПоСрокамОстатки.ПредоплатаУпрОстаток,
			|	РасчетыПоСрокамОстатки.ДолгОстаток,
			|	РасчетыПоСрокамОстатки.ДолгРеглОстаток,
			|	РасчетыПоСрокамОстатки.ДолгУпрОстаток,
			|	МИНИМУМ(РасчетыПоСрокамДо.ПорядокЗачета),
			|	МИНИМУМ(РасчетыПоСрокамДо.ПорядокОперации),
			|	МАКСИМУМ(РасчетыПоСрокамДо.СвязанныйДокумент),
			|	МИНИМУМ(РасчетыПоСрокамДо.ВалютаДокумента),
			|	МАКСИМУМ(РасчетыПоСрокамДо.СтатьяДвиженияДенежныхСредств),
			|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
			|ИЗ
			|	ВТРасчетыСПоставщикамиПоСрокамОстатки КАК РасчетыПоСрокамОстатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыПоСрокамДо
			|		ПО (РасчетыПоСрокамДо.АналитикаУчетаПоПартнерам = РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам)
			|			И (РасчетыПоСрокамДо.ОбъектРасчетов = РасчетыПоСрокамОстатки.ОбъектРасчетов)
			|			И (РасчетыПоСрокамДо.Валюта = РасчетыПоСрокамОстатки.Валюта)
			|			И (РасчетыПоСрокамДо.РасчетныйДокумент = РасчетыПоСрокамОстатки.РасчетныйДокумент)
			|			И (РасчетыПоСрокамДо.Период < &НачалоМесяца)
			|			И (РасчетыПоСрокамДо.Активность)
			|
			|СГРУППИРОВАТЬ ПО
			|	РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам,
			|	РасчетыПоСрокамОстатки.ОбъектРасчетов,
			|	РасчетыПоСрокамОстатки.Валюта,
			|	РасчетыПоСрокамОстатки.РасчетныйДокумент,
			|	РасчетыПоСрокамОстатки.ДатаПлановогоПогашения,
			|	РасчетыПоСрокамОстатки.ДатаВозникновения,
			|	РасчетыПоСрокамОстатки.ПредоплатаОстаток,
			|	РасчетыПоСрокамОстатки.ПредоплатаРеглОстаток,
			|	РасчетыПоСрокамОстатки.ПредоплатаУпрОстаток,
			|	РасчетыПоСрокамОстатки.ДолгОстаток,
			|	РасчетыПоСрокамОстатки.ДолгРеглОстаток,
			|	РасчетыПоСрокамОстатки.ДолгУпрОстаток
			|
			|УПОРЯДОЧИТЬ ПО
			|	МИНИМУМ(РасчетыПоСрокамДо.ПорядокОперации)";
		
		ДетальныеЗаписи = Запрос.Выполнить().Выгрузить();
		ДетальныеЗаписи.Индексы.Добавить("ТипРасчетов, АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта");
		СтруктураПоискаДетальныхЗаписей = Новый Структура("ТипРасчетов, АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта");
		
		МассивОрганизацийДляОбработки = РазвернутоеСальдо.Скопировать(,"Организация");
		МассивОрганизацийДляОбработки.Свернуть("Организация");
		МассивОрганизацийДляОбработки = МассивОрганизацийДляОбработки.ВыгрузитьКолонку("Организация");
		
		Для Каждого Организация Из МассивОрганизацийДляОбработки Цикл
			
			КорректировкаОбъект = КорректировкаРегистров(ДатаКорректировки, Организация, Перечисления.ОперацииКорректировкиРегистров.ИсправлениеРазвернутогоСальдоВзаиморасчетов);
			
			Для Каждого ТипРасчетов Из ТипыРасчетов Цикл
				
				ТипРасчетовСтрокой = ?(ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом,"РасчетыСКлиентами","РасчетыСПоставщиками");
				
				Движения = КорректировкаОбъект.Движения[ТипРасчетовСтрокой + "ПоСрокам"]; // РегистрНакопленияНаборЗаписей
				
				СтруктураПоиска.ТипРасчетов = ТипРасчетов;
				СтруктураПоиска.Организация = Организация;
				ЗаписиРазвернутогоСальдо = РазвернутоеСальдо.НайтиСтроки(СтруктураПоиска);
				
				Для Каждого ЗаписьРазвернутогоСальдо Из ЗаписиРазвернутогоСальдо Цикл
					ЗаполнитьЗначенияСвойств(СтруктураПоискаДетальныхЗаписей, ЗаписьРазвернутогоСальдо);
					СтруктураПоискаДетальныхЗаписей.Валюта = ЗаписьРазвернутогоСальдо.ВалютаРасчетов;
					ДетальныеЗаписиАналитики = ДетальныеЗаписи.НайтиСтроки(СтруктураПоискаДетальныхЗаписей);
					
					СуммаКРаспределениюДолг = Мин(ЗаписьРазвернутогоСальдо.ДолгОстаток, ЗаписьРазвернутогоСальдо.ПредоплатаОстаток);
					СуммаКРаспределениюПредоплата = СуммаКРаспределениюДолг;
					
					Для Каждого СтрокаДетальныхЗаписей Из ДетальныеЗаписиАналитики Цикл
						
						Если СуммаКРаспределениюДолг = 0 И СуммаКРаспределениюПредоплата = 0 Тогда
							Прервать;
						КонецЕсли;
						
						НовСтр = Движения.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтр, СтрокаДетальныхЗаписей);
						
						НовСтр.Период              = ДатаКорректировки;
						НовСтр.ВидДвижения         = ВидДвиженияНакопления.Расход;
						НовСтр.ДокументРегистратор = КорректировкаОбъект.Ссылка;
						НовСтр.ПорядокОперации     = ПорядокКорректировки;
						
						Если СтрокаДетальныхЗаписей.Долг > 0 Тогда
							СуммаСписания = Мин(СуммаКРаспределениюДолг, СтрокаДетальныхЗаписей.Долг);
							
							НовСтр.ДолгРегл = СтрокаДетальныхЗаписей.ДолгРегл / СтрокаДетальныхЗаписей.Долг * СуммаСписания;
							НовСтр.ДолгУпр  = СтрокаДетальныхЗаписей.ДолгУпр / СтрокаДетальныхЗаписей.Долг * СуммаСписания;
							НовСтр.Долг     = СуммаСписания;
							
							СуммаКРаспределениюДолг = СуммаКРаспределениюДолг - СуммаСписания;
						КонецЕсли;
						
						Если СтрокаДетальныхЗаписей.Предоплата > 0 Тогда
							СуммаСписания = Мин(СуммаКРаспределениюПредоплата, СтрокаДетальныхЗаписей.Предоплата);
							
							НовСтр.ПредоплатаРегл = СтрокаДетальныхЗаписей.ПредоплатаРегл / СтрокаДетальныхЗаписей.Предоплата * СуммаСписания;
							НовСтр.ПредоплатаУпр  = СтрокаДетальныхЗаписей.ПредоплатаУпр / СтрокаДетальныхЗаписей.Предоплата * СуммаСписания;
							НовСтр.Предоплата     = СуммаСписания;
							
							СуммаКРаспределениюПредоплата = СуммаКРаспределениюПредоплата - СуммаСписания;
						КонецЕсли;
						
					КонецЦикла;
				КонецЦикла;
				
				Движения.Записать();
				
				Для Каждого СтрокаАналитики Из ЗаписиРазвернутогоСальдо Цикл
					
					ОсновныеПараметры = СтруктураПараметровЗаполненияВзаиморасчетов();
					
					ЗаполнитьЗначенияСвойств(ОсновныеПараметры, СтрокаАналитики);
					ОсновныеПараметры.ЭтоРасчетыСКлиентами = ТипРасчетовСтрокой = "РасчетыСКлиентами";
					ОсновныеПараметры.ПорядокФакт              = ПорядокРасчета;
					ОсновныеПараметры.ПорядокПлан              = ПорядокРасчета;
					
					ЗаполнитьОперативныеВзаиморасчеты(ОсновныеПараметры);
					
				КонецЦикла;
				
			КонецЦикла;
			
			Если КорректировкаОбъект.Движения.РасчетыСКлиентамиПоСрокам.Количество() = 0 
				И КорректировкаОбъект.Движения.РасчетыСПоставщикамиПоСрокам.Количество() = 0 Тогда
				КорректировкаОбъект.Удалить();
			Иначе
				ДополнитьКорректировкуДвижениямиПоПрочимДоходамРасходам(КорректировкаОбъект);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос.Текст = "УНИЧТОЖИТЬ ВтАналитика; УНИЧТОЖИТЬ ВтСальдо";
	Запрос.Выполнить();
	
	//Если на начало периода все хорошо, а на конец есть развернутое сальдо - пересчитаем их.
	Запрос.Текст = ТекстЗапросаРазвернутоеСальдо();
	Запрос.УстановитьПараметр("НачалоМесяца",       КонецМесяца(ПериодРасчета));
	Запрос.УстановитьПараметр("Порядок",            Формат(КонецМесяца(ПериодРасчета),"ДФ=ггггММдд9ЧЧммсс99"));
	НекорректныеОстатки = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Стр Из НекорректныеОстатки Цикл
		
		ОсновныеПараметры = СтруктураПараметровЗаполненияВзаиморасчетов();
		
		ЗаполнитьЗначенияСвойств(ОсновныеПараметры, Стр);
		ОсновныеПараметры.ЭтоРасчетыСКлиентами = Стр.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
		ОсновныеПараметры.ПорядокПлан              = ПорядокРасчета;
		ОсновныеПараметры.ПорядокФакт              = ПорядокРасчета;
		
		ЗаполнитьОперативныеВзаиморасчеты(ОсновныеПараметры);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет в движения данные по прочим доходам/расходам 
// 
// Параметры:
// 	КорректировкаОбъект - ДокументОбъект.КорректировкаРегистров - ДокументОбъект, с уже записанными движениями по расчетам.
Процедура ДополнитьКорректировкуДвижениямиПоПрочимДоходамРасходам(КорректировкаОбъект) Экспорт
	
	Если КорректировкаОбъект.ТаблицаРегистров.Найти("ПрочиеДоходы","Имя") = Неопределено Тогда
		НовСтр = КорректировкаОбъект.ТаблицаРегистров.Добавить();
		НовСтр.Имя = "ПрочиеДоходы";
	КонецЕсли;
	
	Если КорректировкаОбъект.ТаблицаРегистров.Найти("ПрочиеРасходы","Имя") = Неопределено Тогда
		НовСтр = КорректировкаОбъект.ТаблицаРегистров.Добавить();
		НовСтр.Имя = "ПрочиеРасходы";
	КонецЕсли;
	
	Если КорректировкаОбъект.ТаблицаРегистров.Найти("ПрочиеАктивыПассивы","Имя") = Неопределено Тогда
		НовСтр = КорректировкаОбъект.ТаблицаРегистров.Добавить();
		НовСтр.Имя = "ПрочиеАктивыПассивы";
	КонецЕсли;
	
	НачалоТекущегоПериода = КонецМесяца(КорректировкаОбъект.Дата)+1;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КорректировкаСсылка", КорректировкаОбъект.Ссылка);
	Запрос.УстановитьПараметр("Период", НачалоТекущегоПериода);
	Запрос.УстановитьПараметр("СтатьяДоходов", ПланыВидовХарактеристик.СтатьиДоходов.ПрибыльУбытокПрошлыхЛет);
	Запрос.УстановитьПараметр("СтатьяРасходов", ПланыВидовХарактеристик.СтатьиРасходов.ПрибыльУбытокПрошлыхЛет);
	Запрос.УстановитьПараметр("УправленческийУчетОрганизаций", РасчетСебестоимостиПовтИсп.УправленческийУчетОрганизаций(НачалоТекущегоПериода));
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	&Период                                 КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)  КАК ВидДвижения,
	|	ВложенныйЗапрос.Организация             КАК Организация,
	|	ВложенныйЗапрос.Подразделение           КАК Подразделение,
	|	ВложенныйЗапрос.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	&СтатьяДоходов                          КАК СтатьяДоходов,
	|	ВложенныйЗапрос.Организация             КАК АналитикаДоходов,
	|	СУММА(ВложенныйЗапрос.Сумма)            КАК Сумма,
	|	СУММА(ВложенныйЗапрос.СуммаРегл)        КАК СуммаРегл,
	|	СУММА(ВЫБОР КОГДА &УправленческийУчетОрганизаций 
	|				ТОГДА ВложенныйЗапрос.СуммаУпр
	|				ИНАЧЕ 0
	|		КОНЕЦ)                              КАК СуммаУпр
	|ИЗ (ВЫБРАТЬ
	|		Расчеты.АналитикаУчетаПоПартнерам.Организация             КАК Организация,
	|		ЕСТЬNULL(Расчеты.ОбъектРасчетов.Подразделение,
	|			ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|		Расчеты.АналитикаУчетаПоПартнерам.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		
	|		ВЫБОР КОГДА Расчеты.Долг < 0
	|			ТОГДА -Расчеты.Долг
	|			ИНАЧЕ Расчеты.Долг
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.Предоплата < 0
	|			ТОГДА -Расчеты.Предоплата
	|			ИНАЧЕ Расчеты.Предоплата
	|		КОНЕЦ                                                     КАК Сумма,
	|		ВЫБОР КОГДА Расчеты.ДолгРегл < 0
	|			ТОГДА -Расчеты.ДолгРегл
	|			ИНАЧЕ Расчеты.ДолгРегл
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.ПредоплатаРегл < 0
	|			ТОГДА -Расчеты.ПредоплатаРегл
	|			ИНАЧЕ Расчеты.ПредоплатаРегл
	|		КОНЕЦ                                                     КАК СуммаРегл,
	|		ВЫБОР КОГДА Расчеты.ДолгУпр < 0
	|			ТОГДА -Расчеты.ДолгУпр
	|			ИНАЧЕ Расчеты.ДолгУпр
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.ПредоплатаУпр < 0
	|			ТОГДА -Расчеты.ПредоплатаУпр
	|			ИНАЧЕ Расчеты.ПредоплатаУпр
	|		КОНЕЦ                                                     КАК СуммаУпр
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
	|	ГДЕ
	|		Расчеты.Активность
	|		И Расчеты.Регистратор = &КорректировкаСсылка
	|		И ((Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И (Расчеты.Предоплата > 0 ИЛИ Расчеты.Долг < 0))
	|			ИЛИ (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И (Расчеты.Долг > 0 ИЛИ Расчеты.Предоплата < 0)))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Расчеты.АналитикаУчетаПоПартнерам.Организация             КАК Организация,
	|		ЕСТЬNULL(Расчеты.ОбъектРасчетов.Подразделение,
	|			ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|		Расчеты.АналитикаУчетаПоПартнерам.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		
	|		ВЫБОР КОГДА Расчеты.Долг < 0
	|				ТОГДА -Расчеты.Долг
	|			ИНАЧЕ Расчеты.Долг
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.Предоплата < 0
	|			ТОГДА -Расчеты.Предоплата
	|			ИНАЧЕ Расчеты.Предоплата
	|		КОНЕЦ                                                     КАК Сумма,
	|		ВЫБОР КОГДА Расчеты.ДолгРегл < 0
	|			ТОГДА -Расчеты.ДолгРегл
	|			ИНАЧЕ Расчеты.ДолгРегл
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.ПредоплатаРегл < 0
	|			ТОГДА -Расчеты.ПредоплатаРегл
	|			ИНАЧЕ Расчеты.ПредоплатаРегл
	|		КОНЕЦ                                                     КАК СуммаРегл,
	|		ВЫБОР КОГДА Расчеты.ДолгУпр < 0
	|			ТОГДА -Расчеты.ДолгУпр
	|			ИНАЧЕ Расчеты.ДолгУпр
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.ПредоплатаУпр < 0
	|			ТОГДА -Расчеты.ПредоплатаУпр
	|			ИНАЧЕ Расчеты.ПредоплатаУпр
	|		КОНЕЦ                                                     КАК СуммаУпр
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК Расчеты
	|	ГДЕ	
	|		Расчеты.Активность
	|		И Расчеты.Регистратор = &КорректировкаСсылка
	|		И ((Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И (Расчеты.Предоплата > 0 ИЛИ Расчеты.Долг < 0))
	|			ИЛИ (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И (Расчеты.Долг > 0 ИЛИ Расчеты.Предоплата < 0)))) КАК ВложенныйЗапрос
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.НаправлениеДеятельности
	|;
	|ВЫБРАТЬ
	|	&Период                                 КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)  КАК ВидДвижения,
	|	ВложенныйЗапрос.Организация             КАК Организация,
	|	ВложенныйЗапрос.Подразделение           КАК Подразделение,
	|	ВложенныйЗапрос.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	&СтатьяРасходов                         КАК СтатьяРасходов,
	|	ВложенныйЗапрос.Организация             КАК АналитикаРасходов,
	|	СУММА(ВложенныйЗапрос.Сумма)            КАК Сумма,
	|	0                                       КАК СуммаБезНДС,
	|	СУММА(ВложенныйЗапрос.СуммаРегл)        КАК СуммаРегл,
	|	СУММА(ВЫБОР КОГДА &УправленческийУчетОрганизаций
	|				ТОГДА ВложенныйЗапрос.СуммаУпр
	|				ИНАЧЕ 0
	|		КОНЕЦ)                              КАК СуммаУпр,
	|	0                                       КАК ПостояннаяРазница,
	|	0                                       КАК ВременнаяРазница
	|ИЗ (ВЫБРАТЬ
	|		Расчеты.АналитикаУчетаПоПартнерам.Организация             КАК Организация,
	|		ЕСТЬNULL(Расчеты.ОбъектРасчетов.Подразделение,
	|			ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|		Расчеты.АналитикаУчетаПоПартнерам.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		
	|		ВЫБОР КОГДА Расчеты.Долг < 0
	|			ТОГДА -Расчеты.Долг
	|			ИНАЧЕ Расчеты.Долг
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.Предоплата < 0
	|			ТОГДА -Расчеты.Предоплата
	|			ИНАЧЕ Расчеты.Предоплата
	|		КОНЕЦ                                                     КАК Сумма,
	|		ВЫБОР КОГДА Расчеты.ДолгРегл < 0
	|			ТОГДА -Расчеты.ДолгРегл
	|			ИНАЧЕ Расчеты.ДолгРегл
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.ПредоплатаРегл < 0
	|			ТОГДА -Расчеты.ПредоплатаРегл
	|			ИНАЧЕ Расчеты.ПредоплатаРегл
	|		КОНЕЦ                                                     КАК СуммаРегл,
	|		ВЫБОР КОГДА Расчеты.ДолгУпр < 0
	|			ТОГДА -Расчеты.ДолгУпр
	|			ИНАЧЕ Расчеты.ДолгУпр
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.ПредоплатаУпр < 0
	|			ТОГДА -Расчеты.ПредоплатаУпр
	|			ИНАЧЕ Расчеты.ПредоплатаУпр
	|		КОНЕЦ                                                     КАК СуммаУпр
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Расчеты
	|	ГДЕ
	|		Расчеты.Активность
	|		И Расчеты.Регистратор = &КорректировкаСсылка
	|		И ((Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И (Расчеты.Предоплата > 0 ИЛИ Расчеты.Долг < 0))
	|			ИЛИ (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И (Расчеты.Долг > 0 ИЛИ Расчеты.Предоплата < 0)))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Расчеты.АналитикаУчетаПоПартнерам.Организация             КАК Организация,
	|		ЕСТЬNULL(Расчеты.ОбъектРасчетов.Подразделение,
	|			ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)) КАК Подразделение,
	|		Расчеты.АналитикаУчетаПоПартнерам.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		
	|		ВЫБОР КОГДА Расчеты.Долг < 0
	|				ТОГДА -Расчеты.Долг
	|			ИНАЧЕ Расчеты.Долг
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.Предоплата < 0
	|			ТОГДА -Расчеты.Предоплата
	|			ИНАЧЕ Расчеты.Предоплата
	|		КОНЕЦ                                                     КАК Сумма,
	|		ВЫБОР КОГДА Расчеты.ДолгРегл < 0
	|			ТОГДА -Расчеты.ДолгРегл
	|			ИНАЧЕ Расчеты.ДолгРегл
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.ПредоплатаРегл < 0
	|			ТОГДА -Расчеты.ПредоплатаРегл
	|			ИНАЧЕ Расчеты.ПредоплатаРегл
	|		КОНЕЦ                                                     КАК СуммаРегл,
	|		ВЫБОР КОГДА Расчеты.ДолгУпр < 0
	|			ТОГДА -Расчеты.ДолгУпр
	|			ИНАЧЕ Расчеты.ДолгУпр
	|		КОНЕЦ +
	|		ВЫБОР КОГДА Расчеты.ПредоплатаУпр < 0
	|			ТОГДА -Расчеты.ПредоплатаУпр
	|			ИНАЧЕ Расчеты.ПредоплатаУпр
	|		КОНЕЦ                                                     КАК СуммаУпр
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК Расчеты
	|	ГДЕ	
	|		Расчеты.Активность
	|		И Расчеты.Регистратор = &КорректировкаСсылка
	|		И ((Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И (Расчеты.Предоплата > 0 ИЛИ Расчеты.Долг < 0))
	|			ИЛИ (Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И (Расчеты.Долг > 0 ИЛИ Расчеты.Предоплата < 0)))) КАК ВложенныйЗапрос
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.НаправлениеДеятельности
	|";
	
	Результаты = Запрос.ВыполнитьПакет();
	
	Доходы = Результаты[0].Выгрузить();
	Расходы = Результаты[1].Выгрузить();
	
	ДвиженияДоходы = КорректировкаОбъект.Движения.ПрочиеДоходы;
	ДвиженияДоходы.Загрузить(Доходы);
	ДвиженияДоходы.Записать();
	
	ДвиженияРасходы = КорректировкаОбъект.Движения.ПрочиеРасходы;
	ДвиженияРасходы.Загрузить(Расходы);
	ДвиженияРасходы.Записать();
	
	КорректировкаОбъект.Записать();
	
	УправленческийУчетПроведениеСервер.ОбновитьДвиженияАктивовПассивов(КорректировкаОбъект.Ссылка, КорректировкаОбъект.Движения);
	
	АктивыПассивы = КорректировкаОбъект.Движения.ПрочиеАктивыПассивы.Выгрузить();
	АктивыПассивы.ЗаполнитьЗначения(НачалоТекущегоПериода, "Период");
	КорректировкаОбъект.Движения.ПрочиеАктивыПассивы.Загрузить(АктивыПассивы);
	КорректировкаОбъект.Движения.ПрочиеАктивыПассивы.Записать();
	
КонецПроцедуры

#КонецОбласти

Процедура ЗарегистрироватьИзмененияКОтложенномуРаспределению(ЭтоРасчетыСКлиентами, МенеджерВТ, Регистратор) Экспорт
	
	Если НЕ Константы.НоваяАрхитектураВзаиморасчетов.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаИзменений = ТаблицаИзмененийДляПересчета(МенеджерВТ, ЭтоРасчетыСКлиентами, Регистратор);
	
	Если ЭтоРасчетыСКлиентами Тогда
		ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
	Иначе
		ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком;
	КонецЕсли;
	
	Для Каждого СтрокаИзменений Из ТаблицаИзменений Цикл
		
		НаборЗаписей = РегистрыСведений.ЗаданияКРаспределениюРасчетов.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.ТипРасчетов.Установить(ТипРасчетов);
		НаборЗаписей.Отбор.АналитикаУчетаПоПартнерам.Установить(СтрокаИзменений.АналитикаУчетаПоПартнерам);
		НаборЗаписей.Отбор.ОбъектРасчетов.Установить(СтрокаИзменений.ОбъектРасчетов);
		НаборЗаписей.Отбор.Валюта.Установить(СтрокаИзменений.ВалютаРасчетов);
		Если СтрокаИзменений.ПорядокФакт = "" ИЛИ СтрокаИзменений.ПорядокФакт = "9" Тогда
			ДатаФакт = Дата(1,1,1);
		Иначе
			ДатаФакт = Дата(Лев(СтрокаИзменений.ПорядокФакт, 8));
		КонецЕсли;	
		НаборЗаписей.Отбор.ДатаПересчета.Установить(ДатаФакт);
		НаборЗаписей.Отбор.Документ.Установить(Регистратор);
		
		НовСтр = НаборЗаписей.Добавить();
		НовСтр.ТипРасчетов = ТипРасчетов;
		НовСтр.АналитикаУчетаПоПартнерам = СтрокаИзменений.АналитикаУчетаПоПартнерам;
		НовСтр.ОбъектРасчетов = СтрокаИзменений.ОбъектРасчетов;
		НовСтр.Валюта = СтрокаИзменений.ВалютаРасчетов;
		НовСтр.ДатаПересчета = ДатаФакт;
		НовСтр.Документ = Регистратор;
		Если ЗначениеЗаполнено(СтрокаИзменений.КорОбъектРасчетов) Тогда
			НовСтр.Приоритет = 2;
		Иначе
			НовСтр.Приоритет = 1;
		КонецЕсли;
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьОтложенноеРаспределение() Экспорт
	
	Если НЕ Константы.НоваяАрхитектураВзаиморасчетов.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВЫБОР КОГДА Задания.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ                             КАК ЭтоРасчетыСКлиентами,
	|	Задания.ТипРасчетов               КАК ТипРасчетов,
	|	Задания.Приоритет                 КАК Приоритет,
 	|	Задания.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Задания.ОбъектРасчетов            КАК ОбъектРасчетов,
	|	Задания.Валюта                    КАК ВалютаРасчетов,
	|	МИНИМУМ(Задания.ДатаПересчета)    КАК ДатаПересчета
	|ИЗ
	|	РегистрСведений.ЗаданияКРаспределениюРасчетов КАК Задания
	|СГРУППИРОВАТЬ ПО
	|	Задания.ТипРасчетов,
	|	Задания.АналитикаУчетаПоПартнерам,
 	|	Задания.ОбъектРасчетов,
 	|	Задания.Приоритет,
	|	Задания.Валюта
	|УПОРЯДОЧИТЬ ПО
	|	Задания.Приоритет ВОЗР";
	Выборка = Запрос.Выполнить().Выбрать();

	НачальныеГраницыНДС_Клиенты = НДСОбщегоНазначенияСервер.ПодготовитьТаблицуНачальныхГраниц();
	НачальныеГраницыНДС_Поставщики = НДСОбщегоНазначенияСервер.ПодготовитьТаблицуНачальныхГраниц();
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыРаспределения = СтруктураПараметровЗаполненияВзаиморасчетов();
		ЗаполнитьЗначенияСвойств(ПараметрыРаспределения, Выборка);
		ПараметрыРаспределения.Вставить("НачальныеГраницыНДС", ?(Выборка.ЭтоРасчетыСКлиентами, НачальныеГраницыНДС_Клиенты, НачальныеГраницыНДС_Поставщики));		
		ЗаполнитьОперативныеВзаиморасчеты(ПараметрыРаспределения);
		
		Набор = РегистрыСведений.ЗаданияКРаспределениюРасчетов.СоздатьНаборЗаписей();
		Набор.Отбор.ТипРасчетов.Установить(Выборка.ТипРасчетов);
		Набор.Отбор.АналитикаУчетаПоПартнерам.Установить(Выборка.АналитикаУчетаПоПартнерам);
		Набор.Отбор.ОбъектРасчетов.Установить(Выборка.ОбъектРасчетов);
		Набор.Отбор.Валюта.Установить(Выборка.ВалютаРасчетов);
		
		Набор.Записать();
		
	КонецЦикла;

	Если НачальныеГраницыНДС_Клиенты.Количество() > 0 Тогда 
		НДСИсходящийСервер.ВыполнитьПроведениеДокументовПоВозникшемуНДС(НачальныеГраницыНДС_Клиенты);
	КонецЕсли;
	Если НачальныеГраницыНДС_Поставщики.Количество() > 0 Тогда
		НДСВходящийСервер.ВыполнитьПроведениеДокументовПоВозникшемуНДС(НачальныеГраницыНДС_Поставщики);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПолучениеДанных

//Формирует временные таблицы остатков и записей для распределения
Процедура СформироватьВТДанныхРегистровДоНачалаРасчетов(Запрос, ГлобальныеПеременные)
	
	//Данные расчетов до начала пересчета.
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	РасчетыПоСрокамОстатки.РасчетныйДокумент                  КАК РасчетныйДокумент,
	|	РасчетыПоСрокамОстатки.ДатаВозникновения                  КАК Период,
	|	РасчетыПоСрокамОстатки.ДатаПлановогоПогашения             КАК ДатаПлановогоПогашения,
	|	РасчетыПоСрокамОстатки.ДатаВозникновения                  КАК ДатаВозникновения,
	|	РасчетыПоСрокамДо.ПорядокЗачета                           КАК ПорядокЗачета,
	|	МИНИМУМ(РасчетыПоСрокамДо.ПорядокОперации)                КАК ПорядокОперации,
	|	МАКСИМУМ(РасчетыПоСрокамДо.СвязанныйДокумент)             КАК СвязанныйДокумент,
	|	МИНИМУМ(РасчетыПоСрокамДо.ВалютаДокумента)                КАК ВалютаДокумента,
	|	МАКСИМУМ(РасчетыПоСрокамДо.СтатьяДвиженияДенежныхСредств) КАК СтатьяДвиженияДенежныхСредств,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация,
	|	МИНИМУМ(ВЫБОР КОГДА РасчетыПоСрокамОстатки.РасчетныйДокумент ССЫЛКА Документ.ПервичныйДокумент
	|		ТОГДА РасчетыПоСрокамДо.ДокументРегистратор
	|		ИНАЧЕ РасчетыПоСрокамОстатки.РасчетныйДокумент
	|	КОНЕЦ)                                                    КАК ДокументРегистратор,
	|	
	|	РасчетыПоСрокамОстатки.ПредоплатаОстаток                  КАК Предоплата,
	|	РасчетыПоСрокамОстатки.ПредоплатаРеглОстаток              КАК ПредоплатаРегл,
	|	РасчетыПоСрокамОстатки.ПредоплатаУпрОстаток               КАК ПредоплатаУпр,
	|	РасчетыПоСрокамОстатки.ДолгОстаток                        КАК Долг,
	|	РасчетыПоСрокамОстатки.ДолгРеглОстаток                    КАК ДолгРегл,
	|	РасчетыПоСрокамОстатки.ДолгУпрОстаток                     КАК ДолгУпр
	|ПОМЕСТИТЬ ВТРасчетыПоСрокамОстатки
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(&НачалоДняПорядка, 
	|															АналитикаУчетаПоПартнерам   = &АналитикаУчетаПоПартнерам
	|															И ОбъектРасчетов            = &ОбъектРасчетов
	|															И Валюта                    = &ВалютаРасчетов) КАК РасчетыПоСрокамОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокамДо
	|			ПО РасчетыПоСрокамДо.АналитикаУчетаПоПартнерам = РасчетыПоСрокамОстатки.АналитикаУчетаПоПартнерам
	|				И РасчетыПоСрокамДо.ОбъектРасчетов            = РасчетыПоСрокамОстатки.ОбъектРасчетов
	|				И РасчетыПоСрокамДо.Валюта                    = РасчетыПоСрокамОстатки.Валюта
	|				И РасчетыПоСрокамДо.РасчетныйДокумент         = РасчетыПоСрокамОстатки.РасчетныйДокумент
	|				И РасчетыПоСрокамДо.ДатаПлановогоПогашения    = РасчетыПоСрокамОстатки.ДатаПлановогоПогашения
	|				И РасчетыПоСрокамДо.Период                    < &НачалоДняПорядка
	|				И РасчетыПоСрокамДо.Активность
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоСрокамОстатки.РасчетныйДокумент,
	|	РасчетыПоСрокамОстатки.ДатаПлановогоПогашения,
	|	РасчетыПоСрокамОстатки.ДатаВозникновения,
	|	РасчетыПоСрокамДо.ПорядокЗачета,
	|	РасчетыПоСрокамОстатки.ПредоплатаОстаток,
	|	РасчетыПоСрокамОстатки.ПредоплатаРеглОстаток,
	|	РасчетыПоСрокамОстатки.ПредоплатаУпрОстаток,
	|	РасчетыПоСрокамОстатки.ДолгОстаток,
	|	РасчетыПоСрокамОстатки.ДолгРеглОстаток,
	|	РасчетыПоСрокамОстатки.ДолгУпрОстаток
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	//Планы оплат.
	|ВЫБРАТЬ
	|	РасчетыПланОплатДо.ДокументПлан КАК ДокументПлан,
	|	РасчетыПланОплатДо.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	МИНИМУМ(РасчетыПланОплатДо.ПорядокЗачета) КАК ПорядокЗачета
	|ПОМЕСТИТЬ РасчетыПланОплатДо 
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПланОплат КАК РасчетыПланОплатДо
	|ГДЕ
	|	АналитикаУчетаПоПартнерам   = &АналитикаУчетаПоПартнерам
	|	И ОбъектРасчетов            = &ОбъектРасчетов
	|	И Валюта                    = &ВалютаРасчетов	
	|	И Период                    < &НачалоДняПорядка
	|	И РасчетыПланОплатДо.Активность
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПланОплатДо.ДокументПлан,
	|	РасчетыПланОплатДо.ДатаПлановогоПогашения
	|;
	|
	|ВЫБРАТЬ
	|	ДАТАВРЕМЯ(1,1,1)                                          КАК Период,
	|	РасчетыПланыОплатОстатки.ДокументПлан                     КАК ДокументПлан,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка) КАК ХозяйственнаяОперация,
	|	РасчетыПланыОплатОстатки.ДатаПлановогоПогашения           КАК ДатаПлановогоПогашения,
	|	РасчетыПланыОплатОстатки.ДатаВозникновения                КАК ДатаВозникновения,
	|	РасчетыПланОплатДо.ПорядокЗачета                          КАК ПорядокЗачета,
	|	РасчетыПланыОплатОстатки.ВариантОплаты                    КАК ВариантОплаты,
	|	РасчетыПланыОплатОстатки.КОплатеОстаток                   КАК КОплате,
	|	РасчетыПланыОплатОстатки.ОплаченоОстаток                  КАК Оплачено
	|	
	|ПОМЕСТИТЬ ВТРасчетыПланОплатОстатки
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПланОплат.Остатки(&НачалоДняПорядка, 
	|															АналитикаУчетаПоПартнерам   = &АналитикаУчетаПоПартнерам
	|															И ОбъектРасчетов            = &ОбъектРасчетов
	|															И Валюта                    = &ВалютаРасчетов) КАК РасчетыПланыОплатОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РасчетыПланОплатДо КАК РасчетыПланОплатДо
	|			ПО РасчетыПланОплатДо.ДокументПлан              = РасчетыПланыОплатОстатки.ДокументПлан
	|				И РасчетыПланОплатДо.ДатаПлановогоПогашения = РасчетыПланыОплатОстатки.ДатаПлановогоПогашения
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументПлан,
	|	ДатаПлановогоПогашения
	|;
	//Планы отгрузок.
	|ВЫБРАТЬ
	|	РасчетыПланОтгрузокОстатки.ДокументПлан           КАК ДокументПлан,
	|	ДАТАВРЕМЯ(1,1,1)                                  КАК Период,
	|	РасчетыПланОтгрузокОстатки.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	РасчетыПланОтгрузокОстатки.ДатаВозникновения      КАК ДатаВозникновения,
	|	МИНИМУМ(РасчетыПланОтгрузокДо.ПорядокЗачета)      КАК ПорядокЗачета,
	|	
	|	РасчетыПланОтгрузокОстатки.СуммаОстаток           КАК Сумма
	|	
	|ПОМЕСТИТЬ ВТРасчетыПланОтгрузокПоставокОстатки
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПланОтгрузок.Остатки(&НачалоДняПорядка, 
	|															АналитикаУчетаПоПартнерам   = &АналитикаУчетаПоПартнерам
	|															И ОбъектРасчетов            = &ОбъектРасчетов
	|															И Валюта                    = &ВалютаРасчетов) КАК РасчетыПланОтгрузокОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПланОтгрузок КАК РасчетыПланОтгрузокДо
	|			ПО РасчетыПланОтгрузокДо.АналитикаУчетаПоПартнерам = РасчетыПланОтгрузокОстатки.АналитикаУчетаПоПартнерам
	|				И РасчетыПланОтгрузокДо.ОбъектРасчетов            = РасчетыПланОтгрузокОстатки.ОбъектРасчетов
	|				И РасчетыПланОтгрузокДо.Валюта                    = РасчетыПланОтгрузокОстатки.Валюта
	|				И РасчетыПланОтгрузокДо.ДокументПлан              = РасчетыПланОтгрузокОстатки.ДокументПлан
	|				И РасчетыПланОтгрузокДо.Период                    < &НачалоДняПорядка
	|				И РасчетыПланОтгрузокДо.Активность
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПланОтгрузокОстатки.ДокументПлан,
	|	РасчетыПланОтгрузокОстатки.ДатаПлановогоПогашения,
	|	РасчетыПланОтгрузокОстатки.ДатаВозникновения,
	|	РасчетыПланОтгрузокОстатки.СуммаОстаток
	|;";
	
	Если НЕ ГлобальныеПеременные.ЭтоРасчетыСКлиентами Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РасчетыСКлиентамиПоСрокам", "РасчетыСПоставщикамиПоСрокам");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РасчетыСКлиентамиПланОплат", "РасчетыСПоставщикамиПланОплат");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РасчетыСКлиентамиПланОтгрузок", "РасчетыСПоставщикамиПланПоставок");
		
	КонецЕсли;
	
	Запрос.Выполнить();
	
КонецПроцедуры

//Возвращает записи до начала расчета (порядка), количество которых в служебном документе регистраторе меньше размера порции записи
Функция ЗаписиДоНачалаРасчета(Запрос, ГлобальныеПеременные, ИмяТаблицы)
	
	Если НЕ ГлобальныеПеременные.НачальноеЗаполнение Тогда
	
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Таблица.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.%ИмяТаблицы% КАК Таблица
		|ГДЕ
		|	Таблица.АналитикаУчетаПоПартнерам   = &АналитикаУчетаПоПартнерам
		|	И Таблица.ОбъектРасчетов            = &ОбъектРасчетов
		|	И Таблица.Валюта                    = &ВалютаРасчетов
		|	И Таблица.Период                    < &НачалоДняПорядка
		|	И Таблица.Активность
		|СГРУППИРОВАТЬ ПО
		|	Таблица.Регистратор
		|ИМЕЮЩИЕ 
		|	КОЛИЧЕСТВО(Таблица.НомерСтроки) = &РазмерПорцииЗаписи";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяТаблицы%", ИмяТаблицы);
		Если Найти(ИмяТаблицы,"ПоСрокам") <> 0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НачалоДняПорядка", "&НачалоДняПорядкаФакт");
		КонецЕсли;
		ПолныеРегистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	Иначе
		ПолныеРегистраторы = Новый Массив;
	КонецЕсли;
	
	ГлобальныеПеременные.Вставить(ИмяТаблицы + "Регистраторы", ПолныеРегистраторы);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрНакопления.%ИмяТаблицы% КАК Таблица
	|ГДЕ
	|	НЕ Таблица.Регистратор В (&МассивПолныхРегистраторов%ИмяТаблицы%) //Если количество записей <> порции то они будут перераспределены.
	|	И Таблица.АналитикаУчетаПоПартнерам   = &АналитикаУчетаПоПартнерам
	|	И Таблица.ОбъектРасчетов            = &ОбъектРасчетов
	|	И Таблица.Валюта                    = &ВалютаРасчетов
	|	И Таблица.Период                    < &НачалоДняПорядка
	|	И Таблица.Активность";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ИмяТаблицы%", ИмяТаблицы);
	Если Найти(ИмяТаблицы,"ПоСрокам") <> 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&НачалоДняПорядка", "&НачалоДняПорядкаФакт");
	КонецЕсли;
	Запрос.УстановитьПараметр("МассивПолныхРегистраторов"+ИмяТаблицы, ПолныеРегистраторы);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//Возвращает таблицу планов оплат для распределения.
Функция ПолучитьПланыОплат(Запрос, ГлобальныеПеременные)
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Расчеты.Период                 КАК Период,
	|	Расчеты.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	Расчеты.ДатаВозникновения      КАК ДатаВозникновения,
	|	Расчеты.ПорядокОперации        КАК ПорядокОперации,
	|	Расчеты.ПорядокЗачетаПоДатеПлатежа КАК ПорядокЗачетаПоДатеПлатежа,
	|	Расчеты.Регистратор            КАК Регистратор,
	|	Расчеты.РасчетныйДокумент      КАК ДокументПлан,
	|	Расчеты.ХозяйственнаяОперация  КАК ХозяйственнаяОперация,
	|	Расчеты.ВариантОплаты          КАК ВариантОплаты,
	|	Расчеты.ВариантОплаты.Порядок  КАК ВариантОплатыПорядок,
	|	Расчеты.КОплате                КАК КОплате,
	|	0                              КАК Оплачено,
	|	ЛОЖЬ                           КАК ПриходДобавлен
	|ИЗ
	|	ВТРасчетыОтгрузкиПоставки КАК Расчеты
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) В (&СписокТиповЗаказов)
	|	И Расчеты.КОплате <> 0 
	|	//УсловиеПорядок
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиПланаОплат.Период                 КАК Период,
	|	ОстаткиПланаОплат.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	ОстаткиПланаОплат.ДатаВозникновения      КАК ДатаВозникновения,
	|	&Порядок                                 КАК ПорядокОперации,
	|	ОстаткиПланаОплат.ПорядокЗачета          КАК ПорядокЗачетаПоДатеПлатежа,
	|	ОстаткиПланаОплат.ДокументПлан           КАК Регистратор,
	|	ОстаткиПланаОплат.ДокументПлан           КАК ДокументПлан,
	|	ОстаткиПланаОплат.ХозяйственнаяОперация  КАК ХозяйственнаяОперация,
	|	ОстаткиПланаОплат.ВариантОплаты          КАК ВариантОплаты,
	|	ОстаткиПланаОплат.ВариантОплаты.Порядок  КАК ВариантОплатыПорядок,
	|	ОстаткиПланаОплат.КОплате                КАК КОплате,
	|	ОстаткиПланаОплат.Оплачено               КАК Оплачено,
	|	ИСТИНА                                   КАК ПриходДобавлен
	|ИЗ 
	|	ВТРасчетыПланОплатОстатки КАК ОстаткиПланаОплат
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокЗачетаПоДатеПлатежа ВОЗР,
	|	ВариантОплатыПорядок ВОЗР";
	
	Если ГлобальныеПеременные.Порядок <> "" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УсловиеПорядок", "И Расчеты.ПорядокОперации >= &Порядок");
	КонецЕсли;
	
	Результат  = Запрос.Выполнить();
	ПланыОплат = Результат.Выгрузить();
	ПланыОплат.Индексы.Добавить("Регистратор");
	
	Возврат ПланыОплат;
	
КонецФункции

//Возвращает таблицу планов отгрузок/поставок для распределения.
Функция ПолучитьПланыОтгрузокПоставок(Запрос, ГлобальныеПеременные)
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Расчеты.Период                 КАК Период,
	|	Расчеты.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	Расчеты.ДатаВозникновения      КАК ДатаВозникновения,
	|	Расчеты.ПорядокОперации        КАК ПорядокОперации,
	|	Расчеты.ПорядокЗачетаПоДатеПлатежа КАК ПорядокЗачетаПоДатеПлатежа,
	|	Расчеты.Регистратор            КАК Регистратор,
	|	Расчеты.КОтгрузкеПоставке      КАК КОтгрузкеПоставке,
	|	ЛОЖЬ                           КАК ПриходДобавлен
	|ИЗ
	|	ВТРасчетыОтгрузкиПоставки КАК Расчеты
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) В (&СписокТиповЗаказов) И
	|	Расчеты.КОтгрузкеПоставке > 0
	|	//УсловиеПорядок
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиПланаОтгрузокПоставок.Период                 КАК Период,
	|	ОстаткиПланаОтгрузокПоставок.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	ОстаткиПланаОтгрузокПоставок.ДатаВозникновения      КАК ДатаВозникновения,
	|	ОстаткиПланаОтгрузокПоставок.ПорядокЗачета          КАК ПорядокОперации,
	|	ОстаткиПланаОтгрузокПоставок.ПорядокЗачета          КАК ПорядокЗачетаПоДатеПлатежа,
	|	ОстаткиПланаОтгрузокПоставок.ДокументПлан           КАК Регистратор,
	|	ОстаткиПланаОтгрузокПоставок.Сумма                  КАК КОтгрузкеПоставке,
	|	ИСТИНА                                              КАК ПриходДобавлен
	|ИЗ
	|	ВТРасчетыПланОтгрузокПоставокОстатки КАК ОстаткиПланаОтгрузокПоставок
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПлановогоПогашения ВОЗР";
	
	Если ГлобальныеПеременные.Порядок <> "" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеПорядок","И Расчеты.ПорядокОперации >= &Порядок");
	КонецЕсли;
	
	Результат  = Запрос.Выполнить();
	ПланыОтгрузокПоставок = Результат.Выгрузить();
	
	Возврат ПланыОтгрузокПоставок;
	
КонецФункции

//Возвращает таблицу оплат для распределения.
Функция ПолучитьОплаты(Запрос, ГлобальныеПеременные)
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Период                                      КАК Период,
	|	ВложенныйЗапрос.ДатаВозникновения                           КАК ДатаВозникновения,
	|	ВложенныйЗапрос.ПорядокОперации                             КАК ПорядокОперации,
	|	ВложенныйЗапрос.ПорядокЗачетаПоДатеПлатежа                  КАК ПорядокЗачетаПоДатеПлатежа,
	|	ВложенныйЗапрос.Регистратор                                 КАК Регистратор,
	|	ВложенныйЗапрос.РасчетныйДокумент                           КАК РасчетныйДокумент,
	|	ВложенныйЗапрос.КорОбъектРасчетов                           КАК КорОбъектРасчетов,
	|	ВложенныйЗапрос.КорАналитикаУчетаПоПартнерам                КАК КорАналитикаУчетаПоПартнерам,
	|	ВложенныйЗапрос.СвязанныйДокумент                           КАК СвязанныйДокумент,
	|	ВложенныйЗапрос.ЭтоКорректировка                            КАК ЭтоКорректировка,
	|	ВложенныйЗапрос.ХозяйственнаяОперация                       КАК ХозяйственнаяОперация,
	|	ВложенныйЗапрос.ВалютаДокумента = &ВалютаРегл 
	|		ИЛИ &ВалютаРасчетов = &ВалютаРегл
	|		ИЛИ ВложенныйЗапрос.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности КАК РучнойКурсРегл,
	|	ВложенныйЗапрос.ВалютаДокумента = &ВалютаУпр 
	|		ИЛИ &ВалютаРасчетов = &ВалютаУпр
	|		ИЛИ ВложенныйЗапрос.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности КАК РучнойКурсУпр,
	|	ВложенныйЗапрос.ВалютаДокумента                             КАК ВалютаДокумента,
	|	ВложенныйЗапрос.СтатьяДвиженияДенежныхСредств               КАК СтатьяДвиженияДенежныхСредств,
	|	ВложенныйЗапрос.ПриходДобавлен                              КАК ПриходДобавлен,
	|	ВложенныйЗапрос.ГрафикСписан                                КАК ГрафикСписан,
	|	ВложенныйЗапрос.Сумма                                       КАК Сумма,
	|	ВложенныйЗапрос.СуммаРегл                                   КАК СуммаРегл,
	|	ВложенныйЗапрос.СуммаУпр                                    КАК СуммаУпр,
	|	ВложенныйЗапрос.ЭтоОстаток                                  КАК ЭтоОстаток
	|ПОМЕСТИТЬ ВТРасчетыОплаты
	|ИЗ (
	|	ВЫБРАТЬ
	|		Расчеты.Период                                                   КАК Период,
	|		НАЧАЛОПЕРИОДА(Расчеты.ДатаРегистратора, ДЕНЬ)                    КАК ДатаВозникновения,
	|		Расчеты.ПорядокОперации                                          КАК ПорядокОперации,
	|		Расчеты.ПорядокЗачетаПоДатеПлатежа                               КАК ПорядокЗачетаПоДатеПлатежа,
	|		Расчеты.ВалютаДокумента                                          КАК ВалютаДокумента,
	|		Расчеты.СтатьяДвиженияДенежныхСредств                            КАК СтатьяДвиженияДенежныхСредств,
	|		Расчеты.Регистратор                                              КАК Регистратор,
	|		Расчеты.СвязанныйДокумент                                        КАК СвязанныйДокумент,
	|		ВЫБОР 
	|			КОГДА Расчеты.РасчетныйДокумент = Неопределено 
	|					ИЛИ Расчеты.РасчетныйДокумент = ЗНАЧЕНИЕ(Документ.ПервичныйДокумент.ПустаяСсылка)
	|				ТОГДА Расчеты.Регистратор 
	|			ИНАЧЕ Расчеты.РасчетныйДокумент
	|		КОНЕЦ                                                            КАК РасчетныйДокумент,
	|		ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)                КАК КорОбъектРасчетов,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка) КАК КорАналитикаУчетаПоПартнерам,
	|		
	|		Расчеты.ХозяйственнаяОперация                                    КАК ХозяйственнаяОперация,
	|		ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) В
	|			(ТИП(Документ.КорректировкаРеализации),ТИП(Документ.КорректировкаПриобретения)) КАК ЭтоКорректировка,
	|		ЛОЖЬ                                                             КАК ПриходДобавлен,
	|		ЛОЖЬ                                                             КАК ГрафикСписан,
	|		СУММА(ВЫБОР	КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И НЕ &ЭтоРасчетыСКлиентами
	|						ИЛИ Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И &ЭтоРасчетыСКлиентами
	|					ТОГДА -Расчеты.Сумма
	|				ИНАЧЕ Расчеты.Сумма
	|		КОНЕЦ)                                                           КАК Сумма,
	|		СУММА(ВЫБОР	КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И НЕ &ЭтоРасчетыСКлиентами
	|						ИЛИ Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И &ЭтоРасчетыСКлиентами
	|					ТОГДА -Расчеты.СуммаРегл
	|				ИНАЧЕ Расчеты.СуммаРегл
	|		КОНЕЦ)                                                           КАК СуммаРегл,
	|		СУММА(ВЫБОР	КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И НЕ &ЭтоРасчетыСКлиентами
	|						ИЛИ Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И &ЭтоРасчетыСКлиентами
	|					ТОГДА -Расчеты.СуммаУпр
	|				ИНАЧЕ Расчеты.СуммаУпр
	|		КОНЕЦ)                                                           КАК СуммаУпр,
	|		ЛОЖЬ                                                             КАК ЭтоОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|	ГДЕ
	|		Расчеты.Активность
	|		И Расчеты.ОбъектРасчетов            = &ОбъектРасчетов
	|		И Расчеты.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
	|		И Расчеты.Валюта                    = &ВалютаРасчетов
	|		И НЕ Расчеты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|		И (Расчеты.КорОбъектРасчетов         = ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|			ИЛИ &Объект            <> Расчеты.Регистратор)
	|		//УсловиеПорядок
	|	
	|	СГРУППИРОВАТЬ ПО
	|		НАЧАЛОПЕРИОДА(Расчеты.ДатаРегистратора, ДЕНЬ),
	|		Расчеты.Период,
	|		Расчеты.ПорядокОперации,
	|		ВЫБОР КОГДА &ПорядокЗачетаПоДатеПлатежа
	|				ТОГДА Расчеты.ПорядокЗачетаПоДатеПлатежа
	|			ИНАЧЕ Расчеты.ПорядокОперации
	|		КОНЕЦ,
	|		Расчеты.ПорядокЗачетаПоДатеПлатежа,
	|		Расчеты.ВалютаДокумента,
	|		Расчеты.СтатьяДвиженияДенежныхСредств,
	|		Расчеты.Регистратор,
	|		Расчеты.СвязанныйДокумент,
	|		ВЫБОР
	|			КОГДА Расчеты.РасчетныйДокумент = Неопределено
	|					ИЛИ Расчеты.РасчетныйДокумент = ЗНАЧЕНИЕ(Документ.ПервичныйДокумент.ПустаяСсылка)
	|				ТОГДА Расчеты.Регистратор
	|			ИНАЧЕ Расчеты.РасчетныйДокумент
	|		КОНЕЦ,
	|		Расчеты.ХозяйственнаяОперация
	|	ИМЕЮЩИЕ
	|		СУММА(ВЫБОР	КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И НЕ &ЭтоРасчетыСКлиентами
	|						ИЛИ Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И &ЭтоРасчетыСКлиентами
	|					ТОГДА -Расчеты.Сумма
	|				ИНАЧЕ Расчеты.Сумма
	|		КОНЕЦ) > 0
	|		
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Расчеты.Период                                                   КАК Период,
	|		НАЧАЛОПЕРИОДА(Расчеты.ДатаРегистратора, ДЕНЬ)                    КАК ДатаВозникновения,
	|		Расчеты.ПорядокОперации                                          КАК ПорядокОперации,
	|		Расчеты.ПорядокЗачетаПоДатеПлатежа                               КАК ПорядокЗачетаПоДатеПлатежа,
	|		Расчеты.ВалютаДокумента                                          КАК ВалютаДокумента,
	|		РасчетыПоСрокам.СтатьяДвиженияДенежныхСредств                    КАК СтатьяДвиженияДенежныхСредств,
	|		Расчеты.Регистратор                                              КАК Регистратор,
	|		Расчеты.СвязанныйДокумент                                        КАК СвязанныйДокумент,
	|		РасчетыПоСрокам.РасчетныйДокумент                                КАК РасчетныйДокумент,
	|		Расчеты.КорОбъектРасчетов                                        КАК КорОбъектРасчетов,
	|		Расчеты.КорАналитикаУчетаПоПартнерам                             КАК КорАналитикаУчетаПоПартнерам,
	|		Расчеты.ХозяйственнаяОперация                                    КАК ХозяйственнаяОперация,
	|		ЛОЖЬ                                                             КАК ЭтоКорректировка,
	|		ЛОЖЬ                                                             КАК ПриходДобавлен,
	|		ЛОЖЬ                                                             КАК ГрафикСписан,
	|		СУММА(РасчетыПоСрокам.Долг + РасчетыПоСрокам.Предоплата)         КАК Сумма,
	|		СУММА(РасчетыПоСрокам.ДолгРегл + РасчетыПоСрокам.ПредоплатаРегл) КАК СуммаРегл,
	|		СУММА(РасчетыПоСрокам.ДолгУпр + РасчетыПоСрокам.ПредоплатаУпр)   КАК СуммаУпр,
	|		ЛОЖЬ                                                             КАК ЭтоОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыПоСрокам 
	|				ПО Расчеты.Регистратор = РасчетыПоСрокам.ДокументРегистратор
	|				И Расчеты.КорОбъектРасчетов = РасчетыПоСрокам.ОбъектРасчетов
	|				И Расчеты.КорАналитикаУчетаПоПартнерам = РасчетыПоСрокам.АналитикаУчетаПоПартнерам
	|				И РасчетыПоСрокам.ОбъектРасчетов <> &ОбъектРасчетов
	|				И РасчетыПоСрокам.Активность
	|	ГДЕ
	|		Расчеты.Активность
	|		И Расчеты.ОбъектРасчетов            = &ОбъектРасчетов
	|		И Расчеты.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
	|		И Расчеты.Валюта                    = &ВалютаРасчетов
	|		И Расчеты.КорОбъектРасчетов         <> ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|		И &Объект           = Расчеты.Регистратор
	|		И НЕ Расчеты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|		//УсловиеПорядок
	|	СГРУППИРОВАТЬ ПО
	|		Расчеты.Период,
	|		НАЧАЛОПЕРИОДА(Расчеты.ДатаРегистратора, ДЕНЬ),
	|		Расчеты.ПорядокОперации,
	|		Расчеты.ПорядокЗачетаПоДатеПлатежа,
	|		Расчеты.ВалютаДокумента,
	|		РасчетыПоСрокам.СтатьяДвиженияДенежныхСредств,
	|		Расчеты.Регистратор,
	|		Расчеты.СвязанныйДокумент,
	|		РасчетыПоСрокам.РасчетныйДокумент,
	|		Расчеты.ХозяйственнаяОперация,
	|		Расчеты.КорОбъектРасчетов,
	|		Расчеты.КорАналитикаУчетаПоПартнерам
	|	ИМЕЮЩИЕ
	|		СУММА(РасчетыПоСрокам.Долг + РасчетыПоСрокам.Предоплата) > 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОстаткиОплат.Период                                         КАК Период,
	|		ОстаткиОплат.ДатаВозникновения                              КАК ДатаВозникновения,
	|		//у оплат порядок зачета и порядок операции всегда один
	|		ОстаткиОплат.ПорядокЗачета                                  КАК ПорядокОперации,
	|		ОстаткиОплат.ПорядокЗачета                                  КАК ПорядокЗачетаПоДатеПлатежа,
	|		ОстаткиОплат.ВалютаДокумента                                КАК ВалютаДокумента,
	|		ОстаткиОплат.СтатьяДвиженияДенежныхСредств                  КАК СтатьяДвиженияДенежныхСредств,
	|		ОстаткиОплат.ДокументРегистратор                            КАК Регистратор,
	|		ОстаткиОплат.СвязанныйДокумент                              КАК СвязанныйДокумент,
	|		ОстаткиОплат.РасчетныйДокумент                              КАК РасчетныйДокумент,
	|		ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)           КАК КорОбъектРасчетов,
	|		ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка) КАК КорАналитикаУчетаПоПартнерам,
	|		ОстаткиОплат.ХозяйственнаяОперация                          КАК ХозяйственнаяОперация,
	|	
	|		ТИПЗНАЧЕНИЯ(ОстаткиОплат.РасчетныйДокумент) В (ТИП(Документ.КорректировкаРеализации),
	|		                                              ТИП(Документ.КорректировкаПриобретения)) КАК ЭтоКорректировка,
	|		ИСТИНА                                                      КАК ПриходДобавлен,
	|		ИСТИНА                                                      КАК ГрафикСписан,
	|	
	|		ОстаткиОплат.Предоплата                                     КАК Сумма,
	|		ОстаткиОплат.ПредоплатаРегл                                 КАК СуммаРегл,
	|		ОстаткиОплат.ПредоплатаУпр                                  КАК СуммаУпр,
	|		ИСТИНА                                                      КАК ЭтоОстаток
	|	ИЗ
	|		ВТРасчетыПоСрокамОстатки КАК ОстаткиОплат
	|	ГДЕ
	|		ОстаткиОплат.Предоплата > 0 ) КАК ВложенныйЗапрос
	|;
	|ВЫБРАТЬ
	|	РасчетыОплаты.Период                                      КАК Период,
	|	РасчетыОплаты.ДатаВозникновения                           КАК ДатаВозникновения,
	|	РасчетыОплаты.ПорядокОперации                             КАК ПорядокОперации,
	|	//Остатки сворачиваются по порядку зачета, он должен быть один на расчетный документ
	|	РасчетыОплаты.ПорядокЗачетаПоДатеПлатежа                  КАК ПорядокЗачетаПоДатеПлатежа,
	|	РасчетыОплаты.Регистратор                                 КАК Регистратор,
	|	РасчетыОплаты.СвязанныйДокумент                           КАК СвязанныйДокумент,
	|	РасчетыОплаты.РасчетныйДокумент                           КАК РасчетныйДокумент,
	|	РасчетыОплаты.КорОбъектРасчетов                           КАК КорОбъектРасчетов,
	|	РасчетыОплаты.КорАналитикаУчетаПоПартнерам                КАК КорАналитикаУчетаПоПартнерам,
	|
	|	РасчетыОплаты.ЭтоКорректировка                            КАК ЭтоКорректировка,
	|	РасчетыОплаты.ХозяйственнаяОперация                       КАК ХозяйственнаяОперация,
	|	РасчетыОплаты.ВалютаДокумента                             КАК ВалютаДокумента,
	|	РасчетыОплаты.СтатьяДвиженияДенежныхСредств               КАК СтатьяДвиженияДенежныхСредств,
	|
	|	РасчетыОплаты.Сумма                                       КАК Сумма,
	|	РасчетыОплаты.СуммаРегл                                   КАК СуммаРегл,
	|	РасчетыОплаты.СуммаУпр                                    КАК СуммаУпр,
	|
	|	РасчетыОплаты.РучнойКурсРегл                              КАК РучнойКурсРегл,
	|	РасчетыОплаты.РучнойКурсУпр                               КАК РучнойКурсУпр,
	|
	|	РасчетыОплаты.ПриходДобавлен                              КАК ПриходДобавлен,
	|	РасчетыОплаты.ГрафикСписан                                КАК ГрафикСписан,
	|	РасчетыОплаты.ЭтоОстаток                                  КАК ЭтоОстаток
	|ИЗ
	|	ВТРасчетыОплаты КАК РасчетыОплаты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокОперации ВОЗР
	|";
	
	Если ГлобальныеПеременные.Порядок<>"" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеПорядок","И Расчеты.ПорядокОперации >= &Порядок");
	КонецЕсли;
	Если НЕ Запрос.Параметры.ЭтоРасчетыСКлиентами Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,".РасчетыСКлиентами",".РасчетыСПоставщиками");
	КонецЕсли;
	
	Результат     = Запрос.Выполнить();
	РасчетыОплаты = Результат.Выгрузить();
	
	Возврат РасчетыОплаты;
	
КонецФункции

//Возвращает таблицу отгрузок/поставок для распределения.
Функция ПолучитьОтгрузкиПоставки(Запрос, ГлобальныеПеременные)
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	МИНИМУМ(ВЫБОР КОГДА Расчеты.Регистратор ССЫЛКА Документ.ВводОстатков 
	|		ИЛИ Расчеты.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов
	|			ТОГДА Расчеты.Период
	|		ИНАЧЕ Расчеты.ДатаРегистратора
	|	КОНЕЦ)                                              КАК Период,
	|	НАЧАЛОПЕРИОДА(ВЫБОР
	|		КОГДА Расчеты.ДатаПлатежа = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА Расчеты.Период
	|		ИНАЧЕ Расчеты.ДатаПлатежа
	|	КОНЕЦ , ДЕНЬ)                                       КАК ДатаПлановогоПогашения,
	|	НАЧАЛОПЕРИОДА(Расчеты.ДатаРегистратора, ДЕНЬ)       КАК ДатаВозникновения,
	|	Расчеты.ХозяйственнаяОперация                       КАК ХозяйственнаяОперация,
	|	Расчеты.ВариантОплаты                               КАК ВариантОплаты,
	|	Расчеты.ВалютаДокумента                             КАК ВалютаДокумента,
	|	Расчеты.СтатьяДвиженияДенежныхСредств               КАК СтатьяДвиженияДенежныхСредств,
	|	Расчеты.ПорядокОперации                             КАК ПорядокОперации,
	|	Расчеты.ПорядокЗачетаПоДатеПлатежа                  КАК ПорядокЗачетаПоДатеПлатежа,
	|	Расчеты.Регистратор                                 КАК Регистратор,
	|	Расчеты.СвязанныйДокумент                           КАК СвязанныйДокумент,
	|
	|	ВЫБОР
	|		КОГДА &ГрафикВДоговоре ТОГДА &ГрафикИсполненияДоговора
	|		КОГДА &РасчетыПоЗаказу ТОГДА &Объект
	|		ИНАЧЕ Расчеты.ПродажаПоЗаказу 
	|	КОНЕЦ                                               КАК Заказ,
	|	ВЫБОР 
	|		КОГДА Расчеты.РасчетныйДокумент = Неопределено ИЛИ Расчеты.РасчетныйДокумент = ЗНАЧЕНИЕ(Документ.ПервичныйДокумент.ПустаяСсылка)
	|			ТОГДА Расчеты.Регистратор 
	|		ИНАЧЕ Расчеты.РасчетныйДокумент
	|	КОНЕЦ                                               КАК РасчетныйДокумент,
	|	
	|	ВЫБОР КОГДА СУММА(ВЫБОР
	|						КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|							ТОГДА -Расчеты.Сумма
	|						ИНАЧЕ Расчеты.Сумма
	|					КОНЕЦ) < 0 ТОГДА 0
	|		ИНАЧЕ СУММА(ВЫБОР
	|						КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|							ТОГДА -Расчеты.Сумма
	|						ИНАЧЕ Расчеты.Сумма
	|					КОНЕЦ)
	|	КОНЕЦ КАК Сумма,
	|	
	|	ВЫБОР КОГДА СУММА(ВЫБОР
	|						КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|							ТОГДА -Расчеты.СуммаРегл
	|						ИНАЧЕ Расчеты.СуммаРегл
	|					КОНЕЦ) < 0 ТОГДА 0 
	|		ИНАЧЕ СУММА(ВЫБОР
	|						КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|							ТОГДА -Расчеты.СуммаРегл
	|						ИНАЧЕ Расчеты.СуммаРегл
	|					КОНЕЦ)
	|	КОНЕЦ КАК СуммаРегл,
	|
	|	ВЫБОР КОГДА СУММА(ВЫБОР
	|						КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|							ТОГДА -Расчеты.СуммаУпр
	|						ИНАЧЕ Расчеты.СуммаУпр
	|					КОНЕЦ) < 0 ТОГДА 0 
	|		ИНАЧЕ СУММА(ВЫБОР
	|						КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|							ТОГДА -Расчеты.СуммаУпр
	|						ИНАЧЕ Расчеты.СуммаУпр
	|					КОНЕЦ)
	|	КОНЕЦ КАК СуммаУпр,
	|	
	|	СУММА(ВЫБОР
	|				КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И Расчеты.КОплате > 0 
	|					ИЛИ Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И Расчеты.КОплате < 0 
	|					ТОГДА 0
	|				ИНАЧЕ ВЫБОР КОГДА Расчеты.КОплате < 0 ТОГДА -Расчеты.КОплате ИНАЧЕ Расчеты.КОплате КОНЕЦ
	|		КОНЕЦ) КАК КОплате,
	|
	|	СУММА(ВЫБОР
	|			КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -Расчеты.КОтгрузке
	|			ИНАЧЕ Расчеты.КОтгрузке
	|		КОНЕЦ) КАК КОтгрузкеПоставке
	|	
	|ПОМЕСТИТЬ ВТРасчетыОтгрузкиПоставки
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|ГДЕ
	|	&ЭтоРасчетыСКлиентами
	|	И Расчеты.Активность
	|	И Расчеты.ОбъектРасчетов            = &ОбъектРасчетов
	|	И Расчеты.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
	|	И Расчеты.Валюта                    = &ВалютаРасчетов
	|	И НЕ Расчеты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|	//УсловиеПорядок
	|	
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Расчеты.ДатаРегистратора, ДЕНЬ),
	|	НАЧАЛОПЕРИОДА(ВЫБОР
	|		КОГДА Расчеты.ДатаПлатежа = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА Расчеты.Период
	|		ИНАЧЕ Расчеты.ДатаПлатежа
	|	КОНЕЦ , ДЕНЬ),
	|	Расчеты.ХозяйственнаяОперация,
	|	Расчеты.ВариантОплаты,
	|	Расчеты.ВалютаДокумента,
	|	Расчеты.СтатьяДвиженияДенежныхСредств,
	|	Расчеты.ПорядокОперации,
	|	Расчеты.ПорядокЗачетаПоДатеПлатежа,
	|	Расчеты.Регистратор,
	|	Расчеты.СвязанныйДокумент,
	|	ВЫБОР
	|		КОГДА &ГрафикВДоговоре ТОГДА &ГрафикИсполненияДоговора
	|		КОГДА &РасчетыПоЗаказу ТОГДА &Объект
	|		ИНАЧЕ Расчеты.ПродажаПоЗаказу 
	|	КОНЕЦ,
	|	Расчеты.РасчетныйДокумент
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -Расчеты.Сумма
	|			ИНАЧЕ Расчеты.Сумма
	|		КОНЕЦ) > 0 
	|	ИЛИ СУММА(Расчеты.КОплате) > 0
	|	ИЛИ СУММА(ВЫБОР
	|				КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|					ТОГДА -Расчеты.КОтгрузке
	|				ИНАЧЕ Расчеты.КОтгрузке
	|			КОНЕЦ) <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МИНИМУМ(ВЫБОР КОГДА Расчеты.Регистратор ССЫЛКА Документ.ВводОстатков
	|		ИЛИ Расчеты.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов
	|			ТОГДА Расчеты.Период
	|		ИНАЧЕ Расчеты.ДатаРегистратора
	|	КОНЕЦ)                                               КАК Период,
	|	НАЧАЛОПЕРИОДА(ВЫБОР
	|		КОГДА Расчеты.ДатаПлатежа = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА Расчеты.Период
	|		ИНАЧЕ Расчеты.ДатаПлатежа
	|	КОНЕЦ , ДЕНЬ)                                       КАК ДатаПлановогоПогашения,
	|	НАЧАЛОПЕРИОДА(Расчеты.ДатаРегистратора, ДЕНЬ)       КАК ДатаВозникновения,
	|	Расчеты.ХозяйственнаяОперация                       КАК ХозяйственнаяОперация,
	|	Расчеты.ВариантОплаты                               КАК ВариантОплаты,
	|	Расчеты.ВалютаДокумента                             КАК ВалютаДокумента,
	|	Расчеты.СтатьяДвиженияДенежныхСредств               КАК СтатьяДвиженияДенежныхСредств,
	|	Расчеты.ПорядокОперации                             КАК ПорядокОперации,
	|	Расчеты.ПорядокЗачетаПоДатеПлатежа                  КАК ПорядокЗачетаПоДатеПлатежа,
	|	Расчеты.Регистратор                                 КАК Регистратор,
	|	Расчеты.СвязанныйДокумент                           КАК СвязанныйДокумент,
	|
	|	ВЫБОР
	|		КОГДА &ГрафикВДоговоре ТОГДА &ГрафикИсполненияДоговора
	|		КОГДА &РасчетыПоЗаказу ТОГДА &Объект
	|		ИНАЧЕ Расчеты.ЗакупкаПоЗаказу 
	|	КОНЕЦ                                               КАК Заказ,
	|	ВЫБОР 
	|		КОГДА Расчеты.РасчетныйДокумент = Неопределено ИЛИ Расчеты.РасчетныйДокумент = ЗНАЧЕНИЕ(Документ.ПервичныйДокумент.ПустаяСсылка)
	|			ТОГДА Расчеты.Регистратор 
	|		ИНАЧЕ Расчеты.РасчетныйДокумент
	|	КОНЕЦ                                               КАК РасчетныйДокумент,
	|	
	|	ВЫБОР КОГДА СУММА(ВЫБОР
	|						КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|							ТОГДА -Расчеты.Сумма
	|						ИНАЧЕ Расчеты.Сумма
	|					КОНЕЦ) < 0 ТОГДА 0 
	|		ИНАЧЕ СУММА(ВЫБОР
	|						КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|							ТОГДА -Расчеты.Сумма
	|						ИНАЧЕ Расчеты.Сумма
	|					КОНЕЦ)
	|	КОНЕЦ                                                    КАК Сумма,
	|	
	|	ВЫБОР КОГДА СУММА(ВЫБОР
	|						КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|							ТОГДА -Расчеты.СуммаРегл
	|						ИНАЧЕ Расчеты.СуммаРегл
	|					КОНЕЦ) < 0 ТОГДА 0 
	|		ИНАЧЕ СУММА(ВЫБОР
	|						КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|							ТОГДА -Расчеты.СуммаРегл
	|						ИНАЧЕ Расчеты.СуммаРегл
	|					КОНЕЦ)
	|	КОНЕЦ                                                    КАК СуммаРегл,
	|	
	|	ВЫБОР КОГДА СУММА(ВЫБОР
	|						КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|							ТОГДА -Расчеты.СуммаУпр
	|						ИНАЧЕ Расчеты.СуммаУпр
	|					КОНЕЦ) < 0 ТОГДА 0 
	|		ИНАЧЕ СУММА(ВЫБОР
	|						КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|							ТОГДА -Расчеты.СуммаУпр
	|						ИНАЧЕ Расчеты.СуммаУпр
	|					КОНЕЦ)
	|	КОНЕЦ                                                    КАК СуммаУпр,
	|	
	|	СУММА(ВЫБОР
	|				КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И Расчеты.КОплате > 0 
	|					ИЛИ Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И Расчеты.КОплате < 0 
	|					ТОГДА 0
	|				ИНАЧЕ ВЫБОР КОГДА Расчеты.КОплате < 0 ТОГДА -Расчеты.КОплате ИНАЧЕ Расчеты.КОплате КОНЕЦ
	|		КОНЕЦ) КАК КОплате,
	|	
	|	СУММА(ВЫБОР
	|			КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА -Расчеты.КПоступлению
	|			ИНАЧЕ Расчеты.КПоступлению
	|		КОНЕЦ)                                                    КАК КОтгрузкеПоставке
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|ГДЕ
	|	НЕ &ЭтоРасчетыСКлиентами
	|	И Расчеты.Активность
	|	И Расчеты.ОбъектРасчетов            = &ОбъектРасчетов
	|	И Расчеты.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
	|	И Расчеты.Валюта                    = &ВалютаРасчетов
	|	И НЕ Расчеты.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|	//УсловиеПорядок
	|	
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(Расчеты.ДатаРегистратора, ДЕНЬ),
	|	НАЧАЛОПЕРИОДА(ВЫБОР
	|		КОГДА Расчеты.ДатаПлатежа = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА Расчеты.Период
	|		ИНАЧЕ Расчеты.ДатаПлатежа
	|	КОНЕЦ , ДЕНЬ),
	|	Расчеты.ХозяйственнаяОперация,
	|	Расчеты.ВариантОплаты,
	|	Расчеты.ВалютаДокумента,
	|	Расчеты.СтатьяДвиженияДенежныхСредств,
	|	Расчеты.ПорядокОперации,
	|	Расчеты.ПорядокЗачетаПоДатеПлатежа,
	|	Расчеты.Регистратор,
	|	Расчеты.СвязанныйДокумент,
	|	ВЫБОР
	|		КОГДА &ГрафикВДоговоре ТОГДА &ГрафикИсполненияДоговора
	|		КОГДА &РасчетыПоЗаказу ТОГДА &Объект
	|		ИНАЧЕ Расчеты.ЗакупкаПоЗаказу 
	|	КОНЕЦ,
	|	Расчеты.РасчетныйДокумент
	|ИМЕЮЩИЕ
	|	СУММА(ВЫБОР
	|			КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -Расчеты.Сумма
	|			ИНАЧЕ Расчеты.Сумма
	|		КОНЕЦ) > 0 
	|	ИЛИ СУММА(Расчеты.КОплате) > 0
	|	ИЛИ СУММА(ВЫБОР
	|				КОГДА Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					ТОГДА -Расчеты.КПоступлению
	|				ИНАЧЕ Расчеты.КПоступлению
	|			КОНЕЦ) <> 0
	|;
	|
	|ВЫБРАТЬ
	|	РасчетыОтгрузкиПоставки.Период                        КАК Период,
	|	РасчетыОтгрузкиПоставки.ДатаПлановогоПогашения        КАК ДатаПлановогоПогашения,
	|	РасчетыОтгрузкиПоставки.ДатаВозникновения             КАК ДатаВозникновения,
	|	РасчетыОтгрузкиПоставки.ПорядокОперации               КАК ПорядокОперации,
	|	РасчетыОтгрузкиПоставки.ПорядокЗачетаПоДатеПлатежа    КАК ПорядокЗачетаПоДатеПлатежа,
	|	РасчетыОтгрузкиПоставки.Регистратор                   КАК Регистратор,
	|	РасчетыОтгрузкиПоставки.Заказ                         КАК Заказ,
	|	РасчетыОтгрузкиПоставки.РасчетныйДокумент             КАК РасчетныйДокумент,
	|	РасчетыОтгрузкиПоставки.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
	|	
	|	РасчетыОтгрузкиПоставки.Сумма                         КАК Сумма,
	|	РасчетыОтгрузкиПоставки.СуммаРегл                     КАК СуммаРегл,
	|	РасчетыОтгрузкиПоставки.СуммаУпр                      КАК СуммаУпр,
	|	РасчетыОтгрузкиПоставки.СуммаРегл                     КАК СуммаРеглДляПереоценки,
	|	РасчетыОтгрузкиПоставки.СуммаУпр                      КАК СуммаУпрДляПереоценки,
	|	РасчетыОтгрузкиПоставки.КОплате                       КАК КОплате,
	|	РасчетыОтгрузкиПоставки.КОтгрузкеПоставке             КАК КОтгрузкеПоставке,
	|	
	|	ЛОЖЬ                                                  КАК ПриходДобавлен,
	|	ЛОЖЬ                                                  КАК ПланОтгрузокПоставокСписан,
	|	РасчетыОтгрузкиПоставки.Сумма <> 0                    КАК ЕстьОстаток,
	|	РасчетыОтгрузкиПоставки.ВалютаДокумента = &ВалютаРегл 
	|		ИЛИ &ВалютаРасчетов =&ВалютаРегл
	|		ИЛИ РасчетыОтгрузкиПоставки.ХозяйственнаяОперация В (&НепересчитываемыеХО) КАК РучнойКурсРегл,
	|	РасчетыОтгрузкиПоставки.ВалютаДокумента = &ВалютаУпр 
	|		ИЛИ &ВалютаРасчетов =&ВалютаУпр
	|		ИЛИ РасчетыОтгрузкиПоставки.ХозяйственнаяОперация В (&НепересчитываемыеХО)  КАК РучнойКурсУпр,
	|	ВЫБОР
	|		КОГДА РасчетыОтгрузкиПоставки.Сумма = 0 
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(РасчетыОтгрузкиПоставки.СуммаРегл
	|				/ РасчетыОтгрузкиПоставки.Сумма КАК ЧИСЛО(31,17))
	|	КОНЕЦ                                                 КАК КурсРегл,
	|	ВЫБОР
	|		КОГДА РасчетыОтгрузкиПоставки.Сумма = 0 
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(РасчетыОтгрузкиПоставки.СуммаУпр
	|				/ РасчетыОтгрузкиПоставки.Сумма КАК ЧИСЛО(31,17))
	|	КОНЕЦ                                                 КАК КурсУпр,
	|	
	|	РасчетыОтгрузкиПоставки.ВалютаДокумента               КАК ВалютаДокумента,
	|	РасчетыОтгрузкиПоставки.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	РасчетыОтгрузкиПоставки.Период                        КАК ДатаПереоценки,
	|	ВЫБОР 
	|		КОГДА &ЭтоРасчетыСКлиентами
	|			 	И (РасчетыОтгрузкиПоставки.Регистратор Ссылка Документ.СписаниеБезналичныхДенежныхСредств
	|					ИЛИ РасчетыОтгрузкиПоставки.Регистратор Ссылка Документ.РасходныйКассовыйОрдер)
	|			ИЛИ НЕ &ЭтоРасчетыСКлиентами 
	|				И (РасчетыОтгрузкиПоставки.Регистратор Ссылка Документ.ПоступлениеБезналичныхДенежныхСредств
	|					ИЛИ РасчетыОтгрузкиПоставки.Регистратор Ссылка Документ.ПриходныйКассовыйОрдер)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратАванса,
	|	РасчетыОтгрузкиПоставки.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|	ИЛИ РасчетыОтгрузкиПоставки.Регистратор ССЫЛКА Документ.КорректировкаПриобретения КАК ЭтоКорректировка,
	|	РасчетыОтгрузкиПоставки.СвязанныйДокумент КАК СвязанныйДокумент,
	|	ЛОЖЬ КАК ЭтоОстаток
	|	
	|ИЗ ВТРасчетыОтгрузкиПоставки КАК РасчетыОтгрузкиПоставки
	|ГДЕ
	|	РасчетыОтгрузкиПоставки.Сумма <> 0
	|	ИЛИ РасчетыОтгрузкиПоставки.КОтгрузкеПоставке < 0
	|	ИЛИ РасчетыОтгрузкиПоставки.КОплате <> 0 И НЕ ТИПЗНАЧЕНИЯ(РасчетыОтгрузкиПоставки.Регистратор) В (&СписокТиповЗаказов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыПоСрокамОстатки.Период                                   КАК Период,
	|	РасчетыПоСрокамОстатки.ДатаПлановогоПогашения                   КАК ДатаПлановогоПогашения,
	|	РасчетыПоСрокамОстатки.ДатаВозникновения                        КАК ДатаВозникновения,
	|	РасчетыПоСрокамОстатки.ПорядокОперации                          КАК ПорядокОперации,
	|	РасчетыПоСрокамОстатки.ПорядокЗачета                            КАК ПорядокЗачетаПоДатеПлатежа,
	|	РасчетыПоСрокамОстатки.ДокументРегистратор                      КАК Регистратор,
	|	Неопределено                                                    КАК Заказ,
	|	РасчетыПоСрокамОстатки.РасчетныйДокумент                        КАК РасчетныйДокумент,
	|	РасчетыПоСрокамОстатки.ХозяйственнаяОперация                    КАК ХозяйственнаяОперация,
	|		
	|	СУММА(РасчетыПоСрокамОстатки.Долг)                              КАК Сумма,
	|	СУММА(РасчетыПоСрокамОстатки.ДолгРегл)                          КАК СуммаРегл,
	|	СУММА(РасчетыПоСрокамОстатки.ДолгУпр)                           КАК СуммаУпр,
	|	СУММА(РасчетыПоСрокамОстатки.ДолгРегл)                          КАК СуммаРеглДляПереоценки,
	|	СУММА(РасчетыПоСрокамОстатки.ДолгУпр)                           КАК СуммаУпрДляПереоценки,
	|	0                                                               КАК КОплате,
	|//План по отгрузке/поставке остаток в ВТРасчетыПланОтгрузокПоставокОстатки
	|	0                                                               КАК КОтгрузкеПоставке, 
	|
	|	ИСТИНА                                                          КАК ПриходДобавлен,
	|	ИСТИНА                                                          КАК ПланОтгрузокПоставокСписан,
	|	ИСТИНА                                                          КАК ЕстьОстаток,
	|
	|	РасчетыПоСрокамОстатки.ВалютаДокумента = &ВалютаРегл 
	|		ИЛИ &ВалютаРасчетов =&ВалютаРегл
	|		ИЛИ РасчетыПоСрокамОстатки.ХозяйственнаяОперация В (&НепересчитываемыеХО)  КАК РучнойКурсРегл,
	|	РасчетыПоСрокамОстатки.ВалютаДокумента = &ВалютаУпр 
	|		ИЛИ &ВалютаРасчетов =&ВалютаУпр
	|		ИЛИ РасчетыПоСрокамОстатки.ХозяйственнаяОперация В (&НепересчитываемыеХО) КАК РучнойКурсУпр,
	|	ВЫБОР 
	|		КОГДА СУММА(РасчетыПоСрокамОстатки.Долг) = 0 
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(РасчетыПоСрокамОстатки.ДолгРегл) 
	|					/ СУММА(РасчетыПоСрокамОстатки.Долг) КАК ЧИСЛО(31,17))
	|	КОНЕЦ                                                           КАК КурсРегл,
	|	ВЫБОР 
	|		КОГДА СУММА(РасчетыПоСрокамОстатки.Долг) = 0 
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(СУММА(РасчетыПоСрокамОстатки.ДолгУпр)
	|					/ СУММА(РасчетыПоСрокамОстатки.Долг) КАК ЧИСЛО(31,17))
	|	КОНЕЦ                                                           КАК КурсУпр,
	|
	|	РасчетыПоСрокамОстатки.ВалютаДокумента                          КАК ВалютаДокумента,
	|	ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка) КАК СтатьяДвиженияДенежныхСредств,
	|	&ДатаПереоценки                                                 КАК ДатаПереоценки,
	|	ВЫБОР 
	|		КОГДА &ЭтоРасчетыСКлиентами
	|			 	И (РасчетыПоСрокамОстатки.РасчетныйДокумент Ссылка Документ.СписаниеБезналичныхДенежныхСредств
	|					ИЛИ РасчетыПоСрокамОстатки.РасчетныйДокумент Ссылка Документ.РасходныйКассовыйОрдер)
	|			ИЛИ НЕ &ЭтоРасчетыСКлиентами 
	|				И (РасчетыПоСрокамОстатки.РасчетныйДокумент Ссылка Документ.ПоступлениеБезналичныхДенежныхСредств
	|					ИЛИ РасчетыПоСрокамОстатки.РасчетныйДокумент Ссылка Документ.ПриходныйКассовыйОрдер)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозвратАванса,
	|	ТИПЗНАЧЕНИЯ(РасчетыПоСрокамОстатки.РасчетныйДокумент)= ТИП(Документ.КорректировкаРеализации)
	|	ИЛИ ТИПЗНАЧЕНИЯ(РасчетыПоСрокамОстатки.РасчетныйДокумент)= ТИП(Документ.КорректировкаПриобретения) КАК ЭтоКорректировка,
	|	РасчетыПоСрокамОстатки.СвязанныйДокумент КАК СвязанныйДокумент,
	|	ИСТИНА КАК ЭтоОстаток
	|ИЗ
	|	ВТРасчетыПоСрокамОстатки КАК РасчетыПоСрокамОстатки
	|ГДЕ
	|	РасчетыПоСрокамОстатки.Долг > 0
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоСрокамОстатки.Период,
	|	РасчетыПоСрокамОстатки.ДатаПлановогоПогашения,
	|	РасчетыПоСрокамОстатки.ДатаВозникновения,
	|	РасчетыПоСрокамОстатки.ПорядокОперации,
	|	РасчетыПоСрокамОстатки.ПорядокЗачета,
	|	РасчетыПоСрокамОстатки.РасчетныйДокумент,
	|	РасчетыПоСрокамОстатки.ДокументРегистратор,
	|	РасчетыПоСрокамОстатки.ХозяйственнаяОперация,
	|	РасчетыПоСрокамОстатки.ВалютаДокумента,
	|	РасчетыПоСрокамОстатки.СвязанныйДокумент
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокОперации ВОЗР,
	|	ПорядокЗачетаПоДатеПлатежа ВОЗР";
	
	Если ГлобальныеПеременные.Порядок <> "" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеПорядок","И Расчеты.ПорядокОперации          >= &Порядок");
		Если Запрос.Параметры.Регистратор = Тип("ДокументСсылка.ВводОстатков") 
			Или Запрос.Параметры.Регистратор = Тип("ДокументСсылка.ВводОстатковВзаиморасчетов") Тогда
			Запрос.УстановитьПараметр("ДатаПереоценки", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГлобальныеПеременные.Регистратор, "Дата"));
		Иначе
			Запрос.УстановитьПараметр("ДатаПереоценки",НачалоДня(Дата(Лев(ГлобальныеПеременные.Порядок,8))-1));
		КонецЕсли;
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ДатаПереоценки","РасчетыПоСрокамОстатки.Период");
	КонецЕсли;
	
	Результат       = Запрос.Выполнить();
	РасчетыОтгрузки = Результат.Выгрузить();
	
	Возврат РасчетыОтгрузки;
	
КонецФункции


//Возвращает таблицу курсов валют на промежуток между первой записью расчетов и текущей датой.
Функция ПолучитьКурсыВалют(Запрос, ДатаНачала, ГлобальныеПеременные)
	
	ДатаОкончания = НачалоДня(ТекущаяДатаСеанса());
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Курсы.Дата КАК Дата,
	|	СУММА(Курсы.КурсРегл) КАК КурсРегл,
	|	СУММА(Курсы.КурсУпр) КАК КурсУпр
	|ИЗ
	|	(ВЫБРАТЬ
	|		КурсыВалютыРасчетов.Период КАК Дата,
	|		КурсыВалютыРасчетов.Курс / КурсыВалютыРасчетов.Кратность  КАК КурсРегл,
	|		0 КАК КурсУпр
	|	ИЗ
	|		РегистрСведений.КурсыВалют КАК КурсыВалютыРасчетов
	|	ГДЕ КурсыВалютыРасчетов.Валюта = &ВалютаРасчетов
	|		И КурсыВалютыРасчетов.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	
	|	ОБЪЕДИНИТЬ ВСЕ 
	|	
	|	ВЫБРАТЬ
	|		КурсыВалютыУпр.Период КАК Дата,
	|		0  КАК КурсРегл,
	|		КурсыВалютыУпр.Курс / КурсыВалютыУпр.Кратность КАК КурсУпр
	|	ИЗ
	|		РегистрСведений.КурсыВалют КАК КурсыВалютыУпр
	|	ГДЕ КурсыВалютыУпр.Валюта = &ВалютаУпр
	|		И КурсыВалютыУпр.Период МЕЖДУ &ДатаНачала И &ДатаОкончания) КАК Курсы
	|СГРУППИРОВАТЬ ПО
	|	Дата
	|УПОРЯДОЧИТЬ ПО
	|	Дата ВОЗР
	|;
	|ВЫБРАТЬ
	|	СУММА(Курсы.КурсРегл) КАК КурсРегл,
	|	СУММА(Курсы.КурсУпр) КАК КурсУпр
	|ИЗ
	|	(ВЫБРАТЬ
	|		КурсыВалютыРасчетов.Период КАК Дата,
	|		КурсыВалютыРасчетов.Курс / КурсыВалютыРасчетов.Кратность  КАК КурсРегл,
	|		0 КАК КурсУпр
	|	ИЗ
	|		РегистрСведений.КурсыВалют.СрезПоследних(&ДатаНачала) КАК КурсыВалютыРасчетов
	|	ГДЕ КурсыВалютыРасчетов.Валюта = &ВалютаРасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ 
	|	
	|	ВЫБРАТЬ
	|		КурсыВалютыУпр.Период КАК Дата,
	|		0  КАК КурсРегл,
	|		КурсыВалютыУпр.Курс / КурсыВалютыУпр.Кратность КАК КурсУпр
	|	ИЗ
	|		РегистрСведений.КурсыВалют.СрезПоследних(&ДатаНачала) КАК КурсыВалютыУпр
	|	ГДЕ КурсыВалютыУпр.Валюта = &ВалютаУпр) КАК Курсы
	|;";
	
	Запрос.УстановитьПараметр("ДатаНачала",           НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания",        ДатаОкончания);
	Запрос.УстановитьПараметр("ВалютаРасчетов",       ГлобальныеПеременные.ВалютаРасчетов);
	Запрос.УстановитьПараметр("ВалютаУпр",            ГлобальныеПеременные.ВалютаУправленческогоУчета);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	КурсыВалюты = Результаты[0].Выгрузить();
	КурсыВалютСрезПоследних = Результаты[1].Выгрузить();
	
	ТекущийКурсРегл = ?(КурсыВалютСрезПоследних.Количество() > 0, КурсыВалютСрезПоследних[0].КурсРегл, 1);
	ТекущийКурсУпр = ?(КурсыВалютСрезПоследних.Количество() > 0, КурсыВалютСрезПоследних[0].КурсУпр, 1);
	
	ТекущаяДата = НачалоДня(ДатаНачала);
	сч = 0;
	Пока ТекущаяДата <= ДатаОкончания Цикл
		Если КурсыВалюты.Количество() = 0
			ИЛИ сч >= КурсыВалюты.Количество()
			ИЛИ КурсыВалюты[сч].Дата <> ТекущаяДата Тогда
			НовСтр = КурсыВалюты.Вставить(сч);
			НовСтр.Дата = ТекущаяДата;
			НовСтр.КурсРегл = ТекущийКурсРегл;
			НовСтр.КурсУпр = ТекущийКурсРегл / ТекущийКурсУпр;
		Иначе
			Если КурсыВалюты[сч].КурсРегл = 0 Тогда
				КурсыВалюты[сч].КурсРегл = ТекущийКурсРегл;
			Иначе
				ТекущийКурсРегл = КурсыВалюты[сч].КурсРегл;
			КонецЕсли;
			Если КурсыВалюты[сч].КурсУпр <> 0 Тогда
				ТекущийКурсУпр = КурсыВалюты[сч].КурсУпр ;
			КонецЕсли;
			КурсыВалюты[сч].КурсУпр = ТекущийКурсРегл / ТекущийКурсУпр;
		КонецЕсли;
		ТекущаяДата = ТекущаяДата + 24*60*60;
		сч = сч + 1 ;
	КонецЦикла;
	
	КурсыВалюты.Индексы.Добавить("Дата");
	
	Возврат КурсыВалюты;
	
КонецФункции

//Возвращает таблицу накладных и зачтенных на них, на момент пересчета, авансов.
Функция ПолучитьДанныеНакладных(Запрос)
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.СвязанныйДокумент КАК СвязанныйДокумент
	|ПОМЕСТИТЬ ВтСвязанныеДокументы
	|ИЗ (
	|	ВЫБРАТЬ
	|		Оплаты.СвязанныйДокумент КАК СвязанныйДокумент
	|	ИЗ ВТРасчетыОплаты КАК Оплаты
	|	ГДЕ ТИПЗНАЧЕНИЯ(Оплаты.Регистратор) В (ТИП(Документ.КорректировкаРеализации),ТИП(Документ.КорректировкаПриобретения))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ 
	|		Отгрузки.СвязанныйДокумент КАК СвязанныйДокумент
	|	ИЗ ВТРасчетыОтгрузкиПоставки КАК Отгрузки
	|	ГДЕ ТИПЗНАЧЕНИЯ(Отгрузки.Регистратор) В (ТИП(Документ.КорректировкаРеализации),ТИП(Документ.КорректировкаПриобретения))) КАК Расчеты
	|;
	|ВЫБРАТЬ
	|	СвязанныеДокументы.СвязанныйДокумент КАК Накладная,
	|	СУММА(ЕСТЬNULL(ВЫБОР
	|			КОГДА ВТРасчетыПоСрокамДо.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ВТРасчетыПоСрокамДо.Предоплата - ВТРасчетыПоСрокамДо.Долг
	|			ИНАЧЕ ВТРасчетыПоСрокамДо.Долг
	|		КОНЕЦ,0)) КАК Сумма,
	|	СУММА(ЕСТЬNULL(ВЫБОР
	|			КОГДА ВТРасчетыПоСрокамДо.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ВТРасчетыПоСрокамДо.ПредоплатаРегл - ВТРасчетыПоСрокамДо.ДолгРегл
	|			ИНАЧЕ ВТРасчетыПоСрокамДо.ДолгРегл
	|		КОНЕЦ,0)) КАК СуммаРегл,
	|	СУММА(ЕСТЬNULL(ВЫБОР
	|			КОГДА ВТРасчетыПоСрокамДо.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				ТОГДА ВТРасчетыПоСрокамДо.ПредоплатаУпр - ВТРасчетыПоСрокамДо.ДолгУпр
	|			ИНАЧЕ ВТРасчетыПоСрокамДо.ДолгУпр
	|		КОНЕЦ,0)) КАК СуммаУпр
	|ИЗ
	|	ВтСвязанныеДокументы КАК СвязанныеДокументы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК ВТРасчетыПоСрокамДо
	|			ПО СвязанныеДокументы.СвязанныйДокумент = ВТРасчетыПоСрокамДо.ДокументРегистратор
	|				И ВТРасчетыПоСрокамДо.АналитикаУчетаПоПартнерам   = &АналитикаУчетаПоПартнерам
	|				И ВТРасчетыПоСрокамДо.ОбъектРасчетов              = &ОбъектРасчетов
	|				И ВТРасчетыПоСрокамДо.Валюта                      = &ВалютаРасчетов
	|				И ВТРасчетыПоСрокамДо.ПорядокОперации             < &Порядок
	|				И НЕ ВТРасчетыПоСрокамДо.ДокументРегистратор      = &Регистратор
	|				И ВТРасчетыПоСрокамДо.Активность
	|
	|СГРУППИРОВАТЬ ПО
	|	СвязанныеДокументы.СвязанныйДокумент
	|";
	
	Если НЕ Запрос.Параметры.ЭтоРасчетыСКлиентами Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РасчетыСКлиентамиПоСрокам", "РасчетыСПоставщикамиПоСрокам");		
	КонецЕсли;
	
	ДанныеНакладных = Запрос.Выполнить().Выгрузить();
	
	Возврат ДанныеНакладных
	
КонецФункции

#КонецОбласти

#Область ОбщиеМетодыДобавленияСтрок

//Переоценивает долг до момента оплаты.
Процедура ПереоценитьДолг(ГлобальныеПеременные, ТаблицаРасчетовПоДокументам, СтрокаОтгрузки, СтрокаОплаты = Неопределено, ПереоценкаНаДатуОплаты = ИСТИНА)
	
	Если ГлобальныеПеременные.ЕжедневнаяПереоценка Тогда
		ДатаКэш = НачалоДня(СтрокаОтгрузки.ДатаПереоценки);
	Иначе
		ДатаКэш = НачалоДня(КонецМесяца(СтрокаОтгрузки.ДатаПереоценки));
	КонецЕсли;
	
	ОкончательнаяДатаПереоценки = ?(СтрокаОплаты <> Неопределено, НачалоДня(СтрокаОплаты.Период), ТекущаяДатаСеанса());
	
	Пока ДатаКэш < ОкончательнаяДатаПереоценки Цикл
		
		//Отгрузку могли уже переоценить до даты предыдущей оплаты.
		Если ДатаКэш > СтрокаОтгрузки.ДатаПереоценки Тогда
			СтрокаКурса = ГлобальныеПеременные.ТаблицаКурсовВалют.Найти(ДатаКэш, "Дата");
			
			СуммаПереоценкиРегл = Окр(СтрокаОтгрузки.Сумма * СтрокаКурса.КурсРегл, 2) - СтрокаОтгрузки.СуммаРеглДляПереоценки;
			СуммаПереоценкиУпр = Окр(СтрокаОтгрузки.Сумма * СтрокаКурса.КурсУпр, 2) - СтрокаОтгрузки.СуммаУпрДляПереоценки;
			
			Если СуммаПереоценкиРегл <> 0 ИЛИ СуммаПереоценкиУпр <> 0 Тогда
				ДобавитьЗаписьПереоценки(ГлобальныеПеременные, ТаблицаРасчетовПоДокументам, КонецДня(ДатаКэш), СтрокаОтгрузки, "Долг", СуммаПереоценкиРегл, СуммаПереоценкиУпр);
			КонецЕсли;
			
			СтрокаОтгрузки.СуммаРеглДляПереоценки      = СтрокаОтгрузки.СуммаРеглДляПереоценки + СуммаПереоценкиРегл;
			СтрокаОтгрузки.СуммаУпрДляПереоценки       = СтрокаОтгрузки.СуммаУпрДляПереоценки + СуммаПереоценкиУпр;
			
			СтрокаОтгрузки.ДатаПереоценки = ДатаКэш;
			
		КонецЕсли;
		
		Если ГлобальныеПеременные.ЕжедневнаяПереоценка Тогда
			ДатаКэш = ДатаКэш + 86400;
		Иначе
			ДатаКэш = НачалоДня(КонецМесяца(КонецМесяца(ДатаКэш)+1));
		КонецЕсли;
		
	КонецЦикла;
	
	//Требуется переоценка на дату оплаты.
	Если СтрокаОплаты <> Неопределено И НачалоДня(СтрокаОплаты.Период) > СтрокаОтгрузки.ДатаПереоценки И ПереоценкаНаДатуОплаты Тогда
		
		СтрокаКурса = ГлобальныеПеременные.ТаблицаКурсовВалют.Найти(НачалоДня(СтрокаОплаты.Период), "Дата");
		//Долг всегда переоценивается на дату оплаты.
		СуммаПереоценкиРегл = Окр(СтрокаОтгрузки.Сумма * СтрокаКурса.КурсРегл, 2) - СтрокаОтгрузки.СуммаРеглДляПереоценки;
		СуммаПереоценкиУпр = Окр(СтрокаОтгрузки.Сумма * СтрокаКурса.КурсУпр, 2) - СтрокаОтгрузки.СуммаУпрДляПереоценки;
		
		Если СуммаПереоценкиРегл <> 0 ИЛИ СуммаПереоценкиУпр <> 0 Тогда
			ДобавитьЗаписьПереоценки(ГлобальныеПеременные, ТаблицаРасчетовПоДокументам, НачалоДня(СтрокаОплаты.Период), СтрокаОтгрузки, "Долг", СуммаПереоценкиРегл, СуммаПереоценкиУпр);
		КонецЕсли;
		
		СтрокаОтгрузки.СуммаРеглДляПереоценки      = СтрокаОтгрузки.СуммаРеглДляПереоценки + СуммаПереоценкиРегл;
		СтрокаОтгрузки.СуммаУпрДляПереоценки       = СтрокаОтгрузки.СуммаУпрДляПереоценки + СуммаПереоценкиУпр;
		
		СтрокаОтгрузки.ДатаПереоценки = НачалоДня(СтрокаОплаты.Период);
		
	КонецЕсли;
	
КонецПроцедуры

//Добавляет записи прихода по ресурсам долг и предоплата.
Процедура ДобавитьПриход(ГлобальныеПеременные, ТаблицаДвиженийРасчетов, СтрокаРасчетов, ТипИсточника)
	
	Если СтрокаРасчетов.ПорядокОперации < ГлобальныеПеременные.ПорядокФакт Тогда
		СтрокаРасчетов.ПриходДобавлен = Истина;
		Возврат;
	КонецЕсли;
	
	НовСтр = ТаблицаДвиженийРасчетов.Добавить();
	НовСтр.ВидДвижения                   = ВидДвиженияНакопления.Приход;
	НовСтр.ДокументРегистратор           = СтрокаРасчетов.Регистратор;
	НовСтр.РасчетныйДокумент             = СтрокаРасчетов.РасчетныйДокумент;
	НовСтр.ХозяйственнаяОперация         = СтрокаРасчетов.ХозяйственнаяОперация;
	НовСтр.ВалютаДокумента               = СтрокаРасчетов.ВалютаДокумента;
	НовСтр.ДатаВозникновения             = СтрокаРасчетов.ДатаВозникновения;
	НовСтр.Период                        = СтрокаРасчетов.Период;
	НовСтр.ПорядокЗачета                 = СтрокаРасчетов.ПорядокЗачетаПоДатеПлатежа;
	НовСтр.ПорядокОперации               = СтрокаРасчетов.ПорядокОперации;
	НовСтр.СтатьяДвиженияДенежныхСредств = СтрокаРасчетов.СтатьяДвиженияДенежныхСредств;

	Если ТипИсточника = "Оплата" Тогда
		
		НовСтр.СвязанныйДокумент     = СтрокаРасчетов.СвязанныйДокумент;
		НовСтр.КорОбъектРасчетов     = СтрокаРасчетов.КорОбъектРасчетов;
		
		НовСтр.Долг           = 0;
		НовСтр.ДолгРегл       = 0;
		НовСтр.ДолгУпр        = 0;
		
		НовСтр.Предоплата     = СтрокаРасчетов.Сумма;
		НовСтр.ПредоплатаРегл = СтрокаРасчетов.СуммаРегл;
		НовСтр.ПредоплатаУпр  = СтрокаРасчетов.СуммаУпр;
		НовСтр.ДатаПлановогоПогашения = Дата(1,1,1);
		
	ИначеЕсли ТипИсточника = "ОтгрузкаПоставка" Тогда
		
		НовСтр.Долг           = СтрокаРасчетов.Сумма;
		НовСтр.ДолгРегл       = СтрокаРасчетов.СуммаРегл;
		НовСтр.ДолгУпр        = СтрокаРасчетов.СуммаУпр;
		НовСтр.Предоплата     = 0;
		НовСтр.ПредоплатаРегл = 0;
		НовСтр.ПредоплатаУпр  = 0;
		
		НовСтр.ДатаПлановогоПогашения = СтрокаРасчетов.ДатаПлановогоПогашения;
		
		//Записи в ДанныеНакладных может не быть.
		Если ГлобальныеПеременные.ДанныеНакладных[СтрокаРасчетов.Регистратор] = Неопределено Тогда
			ГлобальныеПеременные.ДанныеНакладных.Вставить(СтрокаРасчетов.Регистратор, СтруктураСумм());
		КонецЕсли;
		
		//Если добавляем приход, значит авансы уже зачтены, и осталась часть долга по курсу накладной.
		ДанныеНакладной = ГлобальныеПеременные.ДанныеНакладных[СтрокаРасчетов.Регистратор];
		ДанныеНакладной.СуммаДокумента     = ДанныеНакладной.СуммаДокумента + СтрокаРасчетов.Сумма;
		ДанныеНакладной.СуммаДокументаРегл = ДанныеНакладной.СуммаДокументаРегл + СтрокаРасчетов.СуммаРегл;
		ДанныеНакладной.СуммаДокументаУпр  = ДанныеНакладной.СуммаДокументаУпр  + СтрокаРасчетов.СуммаУпр;
		
	КонецЕсли;
	
	СтрокаРасчетов.ПриходДобавлен = Истина;
	
КонецПроцедуры

//Добавляет записи переоценки долга.
Процедура ДобавитьЗаписьПереоценки(ГлобальныеПеременные, ТаблицаРасчетовПоДокументам, Период, СтрокаРасчетов, Тип, СуммаРегл, СуммаУпр)
	
	Если НЕ ГлобальныеПеременные.Свойство("ТаблицаКурсовВалют") Тогда
		Возврат;
	КонецЕсли;
	
	ПорядокПереоценки = ГлобальныеПеременные.ПорядокПереоценки.Получить(Период);
	Если ПорядокПереоценки = Неопределено Тогда
		ПорядокПереоценки = Порядок(Период,"",, Тип("ДокументСсылка.РасчетКурсовыхРазниц"));
		ГлобальныеПеременные.ПорядокПереоценки.Вставить(Период, ПорядокПереоценки);
	КонецЕсли;
	
	Если ПорядокПереоценки < ГлобальныеПеременные.ПорядокФакт Тогда
		Возврат;
	КонецЕсли;
	
	Если СуммаРегл < 0 ИЛИ СуммаУпр < 0 Тогда
		СтрокаПереоценки = ТаблицаРасчетовПоДокументам.Добавить();
		СтрокаПереоценки.ВидДвижения              = ВидДвиженияНакопления.Расход;
		СтрокаПереоценки.ДокументРегистратор      = ГлобальныеПеременные.ДокументыРасчетаКурсовыхРазниц[НачалоМесяца(Период)];
		СтрокаПереоценки.ХозяйственнаяОперация    = ГлобальныеПеременные.ХозяйственныеОперации["ПереоценкаОтрицательная"];
		СтрокаПереоценки.РасчетныйДокумент        = СтрокаРасчетов.РасчетныйДокумент;
		СтрокаПереоценки.ВалютаДокумента          = СтрокаРасчетов.ВалютаДокумента;
		СтрокаПереоценки.ДатаВозникновения        = СтрокаРасчетов.ДатаВозникновения;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаРасчетов,"ПорядокЗачетаПоДатеПлатежа") Тогда
			СтрокаПереоценки.ПорядокЗачета            = СтрокаРасчетов.ПорядокЗачетаПоДатеПлатежа;
		Иначе
			СтрокаПереоценки.ПорядокЗачета            = СтрокаРасчетов.ПорядокЗачета;
		КонецЕсли;
		СтрокаПереоценки.Период                   = Период;
		СтрокаПереоценки.ПорядокОперации          = ПорядокПереоценки;
		СтрокаПереоценки.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
		
		Если Тип = "Долг" Тогда
			СтрокаПереоценки.ДолгРегл             = ?(СуммаРегл < 0, -СуммаРегл, 0);
			СтрокаПереоценки.ДолгУпр              = ?(СуммаУпр < 0, -СуммаУпр, 0);
			СтрокаПереоценки.ДатаПлановогоПогашения   = СтрокаРасчетов.ДатаПлановогоПогашения;
		Иначе
			СтрокаПереоценки.ПредоплатаРегл       = ?(СуммаРегл < 0, -СуммаРегл, 0);
			СтрокаПереоценки.ПредоплатаУпр        = ?(СуммаУпр < 0, -СуммаУпр, 0);
		КонецЕсли;
	КонецЕсли;
	
	Если СуммаРегл > 0 ИЛИ СуммаУпр > 0 Тогда
		СтрокаПереоценки = ТаблицаРасчетовПоДокументам.Добавить();
		СтрокаПереоценки.ВидДвижения              = ВидДвиженияНакопления.Приход;
		СтрокаПереоценки.ДокументРегистратор      = ГлобальныеПеременные.ДокументыРасчетаКурсовыхРазниц[НачалоМесяца(Период)];
		СтрокаПереоценки.ХозяйственнаяОперация    = ГлобальныеПеременные.ХозяйственныеОперации["ПереоценкаПоложительная"];
		СтрокаПереоценки.РасчетныйДокумент        = СтрокаРасчетов.РасчетныйДокумент;
		СтрокаПереоценки.ВалютаДокумента          = СтрокаРасчетов.ВалютаДокумента;
		СтрокаПереоценки.ДатаВозникновения        = СтрокаРасчетов.ДатаВозникновения;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаРасчетов,"ПорядокЗачетаПоДатеПлатежа") Тогда
			СтрокаПереоценки.ПорядокЗачета            = СтрокаРасчетов.ПорядокЗачетаПоДатеПлатежа;
		Иначе
			СтрокаПереоценки.ПорядокЗачета            = СтрокаРасчетов.ПорядокЗачета;
		КонецЕсли;
		СтрокаПереоценки.Период                   = Период;
		СтрокаПереоценки.ПорядокОперации          = ПорядокПереоценки;
		СтрокаПереоценки.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
		
		Если Тип = "Долг" Тогда
			СтрокаПереоценки.ДолгРегл               = ?(СуммаРегл > 0, СуммаРегл, 0);
			СтрокаПереоценки.ДолгУпр                = ?(СуммаУпр > 0, СуммаУпр, 0);
			СтрокаПереоценки.ДатаПлановогоПогашения = СтрокаРасчетов.ДатаПлановогоПогашения;
		Иначе
			СтрокаПереоценки.ПредоплатаРегл         = ?(СуммаРегл > 0, СуммаРегл, 0);
			СтрокаПереоценки.ПредоплатаУпр          = ?(СуммаУпр > 0, СуммаУпр, 0);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//Добавляет расходные движения по плану отгрузок.
Процедура СписатьПланОтгрузкиПоставки(ГлобальныеПеременные, ТаблицаДвиженийПланОтгрузокПоставок, СтрокаРасчетов, ПланыОтгрузок)
	
	СуммаКРаспределению = -СтрокаРасчетов.КОтгрузкеПоставке;
	
	//Расчеты по договору, график по заказу.
	//Строки плана подбираются по заказу накладной, а не по объекту расчетов в общем.
	Если (ЗначениеЗаполнено(СтрокаРасчетов.Заказ) ИЛИ ГлобальныеПеременные.ГрафикВДоговоре) И СуммаКРаспределению > 0 Тогда
		
		СтрокиПлана = ПланыОтгрузок.НайтиСтроки(Новый Структура("Регистратор", СтрокаРасчетов.Заказ));
		Для Каждого СтрокаПланаОтгрузкиПоставки Из СтрокиПлана Цикл
			Если СтрокаПланаОтгрузкиПоставки.КОтгрузкеПоставке = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НовСтр = ТаблицаДвиженийПланОтгрузокПоставок.Добавить();
			НовСтр.ВидДвижения              = ВидДвиженияНакопления.Расход;
			
			НовСтр.ДокументРегистратор      = СтрокаРасчетов.Регистратор;
			НовСтр.ДокументПлан             = СтрокаПланаОтгрузкиПоставки.Регистратор;
			НовСтр.Период                   = СтрокаРасчетов.Период;
			НовСтр.ДатаПлановогоПогашения   = СтрокаПланаОтгрузкиПоставки.ДатаПлановогоПогашения;
			НовСтр.ДатаВозникновения        = СтрокаПланаОтгрузкиПоставки.ДатаВозникновения;
			НовСтр.ПорядокОперации          = СтрокаРасчетов.ПорядокОперации;
			НовСтр.ПорядокЗачета            = СтрокаПланаОтгрузкиПоставки.ПорядокЗачетаПоДатеПлатежа;
			
			НовСтр.Сумма = ВзаиморасчетыСервер.СписатьСумму(СтрокаПланаОтгрузкиПоставки.КОтгрузкеПоставке, СуммаКРаспределению);
		КонецЦикла;
		Для каждого СтрокаПланаОтгрузкиПоставки Из СтрокиПлана Цикл
			Если СтрокаПланаОтгрузкиПоставки.КОтгрузкеПоставке=0 Тогда
				ПланыОтгрузок.Удалить(СтрокаПланаОтгрузкиПоставки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	СтрокаРасчетов.ПланОтгрузокПоставокСписан = Истина;
	
КонецПроцедуры

//Пересчитывает сумму регл. и упр. учета строки расчетов по курсу связанного документа, если он проведен.
Процедура ПересчитатьСуммыЕслиЭтоКорректировка(ГлобальныеПеременные, СтрокаРасчетов)
	
	Если СтрокаРасчетов.ЭтоКорректировка
		И ГлобальныеПеременные.ДанныеНакладных[СтрокаРасчетов.СвязанныйДокумент] <> Неопределено
		И ГлобальныеПеременные.ДанныеНакладных[СтрокаРасчетов.СвязанныйДокумент].СуммаДокумента <> 0 Тогда
		СтрокаРасчетов.СуммаРегл = Окр(СтрокаРасчетов.Сумма *
			(ГлобальныеПеременные.ДанныеНакладных[СтрокаРасчетов.СвязанныйДокумент].СуммаДокументаРегл
				/ ГлобальныеПеременные.ДанныеНакладных[СтрокаРасчетов.СвязанныйДокумент].СуммаДокумента),2);
		СтрокаРасчетов.СуммаУпр = Окр(СтрокаРасчетов.Сумма *
			(ГлобальныеПеременные.ДанныеНакладных[СтрокаРасчетов.СвязанныйДокумент].СуммаДокументаУпр
				/ ГлобальныеПеременные.ДанныеНакладных[СтрокаРасчетов.СвязанныйДокумент].СуммаДокумента),2);
	КонецЕсли;
	
	СтрокаРасчетов.ЭтоКорректировка = Ложь;
	
КонецПроцедуры

Процедура ДобавитьЗаписьКРасчетуПланаОплат(ГлобальныеПеременные, СтрокаРасчетов, Сумма, ПланыОплат, ДокументПлан = Неопределено)
	
	Если Сумма = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НовСтр = ПланыОплат.Добавить();
	НовСтр.Регистратор               = СтрокаРасчетов.Регистратор;
	НовСтр.Период                    = СтрокаРасчетов.Период;
	НовСтр.ДатаВозникновения         = СтрокаРасчетов.ДатаВозникновения;

	НовСтр.ПорядокОперации           = СтрокаРасчетов.ПорядокОперации;
	НовСтр.ПорядокЗачетаПоДатеПлатежа = СтрокаРасчетов.ПорядокЗачетаПоДатеПлатежа;

	НовСтр.ХозяйственнаяОперация     = СтрокаРасчетов.ХозяйственнаяОперация;
	НовСтр.ДокументПлан              = ДокументПлан;
	НовСтр.ПриходДобавлен            = ЛОЖЬ;
	
	Если Сумма < 0 Тогда
		НовСтр.Оплачено                 = -Сумма;
	Иначе
		Если ГлобальныеПеременные.ЭтоРасчетыСКлиентами Тогда
			НовСтр.ВариантОплаты              = Перечисления.ВариантыОплатыКлиентом.КредитПослеОтгрузки;
		Иначе
			НовСтр.ВариантОплаты              = Перечисления.ВариантыОплатыПоставщику.КредитПослеПоступления;
		КонецЕсли;
		НовСтр.ДатаПлановогоПогашения   = СтрокаРасчетов.ДатаПлановогоПогашения;
		НовСтр.КОплате                  = Сумма;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДобавитьПриходПланаОплат(ТаблицаПланОплат, СтрокаПлана, ХозяйственнаяОперация, КОплате = 0, Оплачено = 0)
	
	Если НЕ СтрокаПлана.ПриходДобавлен Тогда
		НовСтр = ТаблицаПланОплат.Добавить();
		НовСтр.ВидДвижения               = ВидДвиженияНакопления.Приход;
		НовСтр.ДокументРегистратор       = СтрокаПлана.Регистратор;
		НовСтр.ДокументПлан              = СтрокаПлана.Регистратор;
		НовСтр.ВариантОплаты             = СтрокаПлана.ВариантОплаты;
		НовСтр.Период                    = СтрокаПлана.Период;
		НовСтр.ДатаВозникновения         = СтрокаПлана.ДатаВозникновения;
		НовСтр.ДатаПлановогоПогашения    = СтрокаПлана.ДатаПлановогоПогашения;
		НовСтр.КОплате                   = КОплате;
		НовСтр.Оплачено                  = Оплачено;
		НовСтр.ПорядокОперации           = СтрокаПлана.ПорядокОперации;
		НовСтр.ПорядокЗачета             = СтрокаПлана.ПорядокЗачетаПоДатеПлатежа;
		НовСтр.ХозяйственнаяОперация     = ХозяйственнаяОперация;
		СтрокаПлана.ДокументПлан = СтрокаПлана.Регистратор;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьРасходПланаОплат(ТаблицаПланОплат, Приход, Расход, СуммаКОплате, СуммаОплачено, ДокументПланРасхода = Ложь)
	
	НовСтр = ТаблицаПланОплат.Добавить();
	НовСтр.ВидДвижения               = ВидДвиженияНакопления.Расход;
	НовСтр.ДокументРегистратор       = Расход.Регистратор;
	Если НЕ ДокументПланРасхода Тогда
		НовСтр.ДокументПлан              = Приход.ДокументПлан;
	Иначе
		НовСтр.ДокументПлан              = Расход.ДокументПлан;
	КонецЕсли;
	НовСтр.ВариантОплаты             = Приход.ВариантОплаты;
	НовСтр.Период                    = Расход.Период;
	НовСтр.ДатаВозникновения         = Приход.ДатаВозникновения;
	НовСтр.ДатаПлановогоПогашения    = Приход.ДатаПлановогоПогашения;
	НовСтр.КОплате                   = СуммаКОплате;
	НовСтр.Оплачено                  = СуммаОплачено;
	НовСтр.ПорядокОперации           = Расход.ПорядокОперации;
	НовСтр.ПорядокЗачета             = Приход.ПорядокЗачетаПоДатеПлатежа;
	НовСтр.ХозяйственнаяОперация     = Расход.ХозяйственнаяОперация;
	
КонецПроцедуры

#КонецОбласти

#Область ПереходНаОнлайнВзаиморасчеты

Процедура ЗаполнитьРегистрПереходаНаОнлайн()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(РасчетыСКлиентами.ДатаДвижения) КАК ДатаДвижения,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом) КАК ТипРасчетов,
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентами.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыСКлиентами.Валюта КАК Валюта,
	|	КОЛИЧЕСТВО(*) КАК КоличествоДокументов,
	|	МАКСИМУМ(РасчетыСКлиентами.Приоритет) КАК Приоритет
	|ИЗ 
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		РасчетыСПартнерами.Период КАК ДатаДвижения,
	|		РасчетыСПартнерами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыСПартнерами.ЗаказКлиента КАК ОбъектРасчетов,
	|		РасчетыСПартнерами.Валюта КАК Валюта,
	|		РасчетыСПартнерами.Регистратор КАК Регистратор,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(Расчеты.КорОбъектРасчетов, ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка))
	|					= ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ КАК Приоритет
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСПартнерами
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентами КАК Расчеты
	|				ПО Расчеты.Регистратор = РасчетыСПартнерами.Регистратор
	|					И Расчеты.АналитикаУчетаПоПартнерам = РасчетыСПартнерами.АналитикаУчетаПоПартнерам
	|					И Расчеты.ОбъектРасчетов = РасчетыСПартнерами.ЗаказКлиента
	|		
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		РасчетыСПартнерами.Период КАК ДатаДвижения,
	|		РасчетыСПартнерами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыСПартнерами.ОбъектРасчетов КАК ОбъектРасчетов,
	|		РасчетыСПартнерами.Валюта КАК Валюта,
	|		РасчетыСПартнерами.Регистратор КАК Регистратор,
	|		ВЫБОР
	|			КОГДА РасчетыСПартнерами.КорОбъектРасчетов = ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ КАК Приоритет
	|	ИЗ 
	|		РегистрНакопления.РасчетыСКлиентами КАК РасчетыСПартнерами
	|	ГДЕ
	|		НЕ ИСТИНА В (
	|			ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыПоДокументам
	|			ГДЕ
	|				РасчетыСПартнерами.АналитикаУчетаПоПартнерам = РасчетыПоДокументам.АналитикаУчетаПоПартнерам
	|				И РасчетыСПартнерами.ОбъектРасчетов = РасчетыПоДокументам.ЗаказКлиента
	|				И РасчетыСПартнерами.Валюта = РасчетыПоДокументам.Валюта
	|		)
	|
	|	) КАК РасчетыСКлиентами
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентами.ОбъектРасчетов,
	|	РасчетыСКлиентами.Валюта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(РасчетыСПоставщиками.ДатаДвижения) КАК ДатаДвижения,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком) КАК ТипРасчетов,
	|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщиками.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыСПоставщиками.Валюта КАК Валюта,
	|	КОЛИЧЕСТВО(*) КАК КоличествоДокументов,
	|	МАКСИМУМ(РасчетыСПоставщиками.Приоритет) КАК Приоритет
	|ИЗ 
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		РасчетыСПартнерами.Период КАК ДатаДвижения,
	|		РасчетыСПартнерами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыСПартнерами.ЗаказПоставщику КАК ОбъектРасчетов,
	|		РасчетыСПартнерами.Валюта КАК Валюта,
	|		РасчетыСПартнерами.Регистратор КАК Регистратор,
	|		ВЫБОР
	|			КОГДА ЕСТЬNULL(Расчеты.КорОбъектРасчетов, ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка))
	|					= ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ КАК Приоритет
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПартнерами
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|				ПО Расчеты.Регистратор = РасчетыСПартнерами.Регистратор
	|					И Расчеты.АналитикаУчетаПоПартнерам = РасчетыСПартнерами.АналитикаУчетаПоПартнерам
	|					И Расчеты.ОбъектРасчетов = РасчетыСПартнерами.ЗаказПоставщику
	|		
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		РасчетыСПартнерами.Период КАК ДатаДвижения,
	|		РасчетыСПартнерами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыСПартнерами.ОбъектРасчетов КАК ОбъектРасчетов,
	|		РасчетыСПартнерами.Валюта КАК Валюта,
	|		РасчетыСПартнерами.Регистратор КАК Регистратор,
	|		ВЫБОР
	|			КОГДА РасчетыСПартнерами.КорОбъектРасчетов = ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ КАК Приоритет
	|	ИЗ 
	|		РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПартнерами
	|	ГДЕ
	|		НЕ ИСТИНА В (
	|			ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыПоДокументам
	|			ГДЕ
	|				РасчетыСПартнерами.АналитикаУчетаПоПартнерам = РасчетыПоДокументам.АналитикаУчетаПоПартнерам
	|				И РасчетыСПартнерами.ОбъектРасчетов = РасчетыПоДокументам.ЗаказПоставщику
	|				И РасчетыСПартнерами.Валюта = РасчетыПоДокументам.Валюта
	|		)
	|
	|	) КАК РасчетыСПоставщиками
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщиками.ОбъектРасчетов,
	|	РасчетыСПоставщиками.Валюта
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоДокументов УБЫВ,
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Выборка = Запрос.Выполнить().Выбрать();
	Набор = РегистрыСведений.ЗаданияКРаспределениюРасчетов.СоздатьНаборЗаписей();
	Набор.Записать();
	НомерСтроки = 0;
	Пока Выборка.Следующий() Цикл
		
		НомерСтроки = НомерСтроки + 1;
		ЗаполнитьЗначенияСвойств(Набор.Добавить(), Выборка);
		Если НомерСтроки = 1000 Тогда
			Набор.Записать(Ложь);
			Набор.Очистить();
			НомерСтроки = 0;
		КонецЕсли;
		
	КонецЦикла;
	Набор.Записать(Ложь);
	
	Текст = НСтр("ru='Включение онлайн взаиморасчетов с партнерами.';uk='Включення онлайн взаєморозрахунків з партнерами.'",ОбщегоНазначения.КодОсновногоЯзыка());
	ВсегоЗаписей = НСтр("ru='Всего кортежей к переносу';uk='Усього кортежів до переносу'")+": %1";
	ЗаписьЖурналаРегистрации(Текст,
		УровеньЖурналаРегистрации.Информация,,,СтрШаблон(ВсегоЗаписей, Выборка.Количество()));
	
КонецПроцедуры

Функция ВыполнитьМногопоточныйПереход(ВсеДатыПересчета = Ложь)
	
	Потоки = Новый Массив;
	КоличествоСвободныхПотоков = КоличествоПотоковПереходаНаОнлайнВзаиморасчеты();
	КоличествоОбъектовДляПереноса = РазмерПорцииПереносаВОдномПотоке() * КоличествоСвободныхПотоков;
	ПоследняяЗапись = НовыйКурсор();
	КоличествоОбработанныхЗаписей = 0;
	Пока КоличествоОбъектовДляПереноса > 0 Цикл
		
		Если КоличествоСвободныхПотоков > 0 Тогда
			
			ВсегоКОбработке = РазмерПорцииПереносаВОдномПотоке() * КоличествоСвободныхПотоков;
			Выборка = ДанныеДляОбработки(ПоследняяЗапись, ВсегоКОбработке, ВсеДатыПересчета);
			ПоследняяЗапись = НовыйКурсор();
			Если Выборка.Количество() = ВсегоКОбработке Тогда
				ЗаполнитьЗначенияСвойств(ПоследняяЗапись, Выборка[Выборка.Количество() - 1]);
			КонецЕсли;
			
			РазмерПорции = 1;
			Если Выборка.Количество()/КоличествоСвободныхПотоков > 1 Тогда
				РазмерПорции = Окр(Выборка.Количество()/КоличествоСвободныхПотоков,0,РежимОкругления.Окр15как20);
			КонецЕсли;
			КоличествоОбъектовДляПереноса = 0;
			Пока Выборка.Количество() > 0 Цикл
				
				ДанныеПотока = ВыбратьДанныеДляПотока(Выборка, РазмерПорции, КоличествоСвободныхПотоков);
				Поток = НовоеОписаниеПотока("ОперативныеВзаиморасчетыСервер.ВыполнитьПереносОфлайнВзаиморасчетов");
				ЗапуститьОбработкуВФоне(Поток, ДанныеПотока, ВсеДатыПересчета);
				КоличествоОбъектовДляПереноса = КоличествоОбъектовДляПереноса + ДанныеПотока.Количество();
				Потоки.Добавить(Поток);
				
			КонецЦикла;
			
		КонецЕсли;
		
		ОжидатьЗавершениеПотока(Поток);
		
		ЗавершитьПотокиВыполнившиеФЗ(Потоки, КоличествоОбработанныхЗаписей);
		Если ПоследняяЗапись.ОбъектРасчетов = Неопределено Тогда
			ОжидатьЗавершениеВсехПотоков(Потоки, КоличествоОбработанныхЗаписей);
		КонецЕсли;
		
		КоличествоДоступныхПотоков = КоличествоПотоковПереходаНаОнлайнВзаиморасчеты();
		КоличествоСвободныхПотоков = Макс(КоличествоДоступныхПотоков - Потоки.Количество(), 0);
		
	КонецЦикла;
	
	ОжидатьЗавершениеВсехПотоков(Потоки, КоличествоОбработанныхЗаписей);
	
	Возврат КоличествоОбработанныхЗаписей;
	
КонецФункции

Процедура ЗапуститьОбработкуВФоне(Поток, ДанныеКОбработке, ВсеДатыПересчета)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Неопределено);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru='Перенос офлайн взаиморасчетов';uk='Перенесення офлайн взаєморозрахунків'");
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, Новый УникальныйИдентификатор);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("ДанныеКОбработке", ДанныеКОбработке);
	ПараметрыПроцедуры.Вставить("ВсеДатыПересчета", ВсеДатыПересчета);
	
	РезультатЗапуска = ДлительныеОперации.ВыполнитьВФоне(Поток.Процедура, ПараметрыПроцедуры, ПараметрыВыполнения);
	
	Поток.АдресРезультата = РезультатЗапуска.АдресРезультата;
	Статус = РезультатЗапуска.Статус;
	
	Если Статус = "Выполняется" Тогда
		Поток.ИдентификаторЗадания = РезультатЗапуска.ИдентификаторЗадания;
	ИначеЕсли Статус <> "Выполняется" И Статус <> "Выполнено" Тогда
		ВызватьИсключение РезультатЗапуска.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
КонецПроцедуры

Функция ВыполнитьПереносОфлайнВзаиморасчетов(Параметры, АдресРезультата = Неопределено) Экспорт
	
	Если Параметры.Свойство("ДанныеКОбработке") Тогда
		ДанныеКОбработке = Параметры.ДанныеКОбработке;
	Иначе
		ДанныеКОбработке = ДанныеДляОбработки(,,Параметры.ВсеДатыПересчета);
	КонецЕсли;
	
	КоличествоОбработанныхЗаписей = 0;
	ПорядокОперации = Новый Соответствие();
	Запрос = Новый Запрос();
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ХозяйственныеОперацииНеОтгрузка", ХозяйственныеОперацииНеОтгрузка());
	Запрос.УстановитьПараметр("ТипыПлатежныхДокументов", ТипыПлатежныхДокументов());
	Запрос.УстановитьПараметр("ТипыПервичногоДокументаПлатежки", ТипыПервичногоДокументаПлатежки());
	Для Каждого Отбор Из ДанныеКОбработке Цикл
		
		НачатьТранзакцию();
		Попытка
			
			//1. Перенесем РасчетыПоДокументам.
			ЭтоРасчетыСКлиентами = Отбор.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
			Если ЭтоРасчетыСКлиентами Тогда
				Запрос.Текст = ТекстЗапросаРасчетыСКлиентамиПоДокументам();
			Иначе
				Запрос.Текст = ТекстЗапросаРасчетыСПоставщикамиПоДокументам();
			КонецЕсли;
			Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам", Отбор.АналитикаУчетаПоПартнерам);
			Запрос.УстановитьПараметр("ОбъектРасчетов", Отбор.ОбъектРасчетов);
			Запрос.УстановитьПараметр("Валюта", Отбор.Валюта);
			ТаблицаДетальныхЗаписей = Запрос.Выполнить().Выгрузить();
			
			Если ТаблицаДетальныхЗаписей.Количество() > 0 Тогда
				ЗаписатьНовыеЗаписиРасчетовПоСрокам(ЭтоРасчетыСКлиентами, ТаблицаДетальныхЗаписей, ПорядокОперации);
				КоличествоОбработанныхЗаписей = КоличествоОбработанныхЗаписей + ТаблицаДетальныхЗаписей.Количество();
			КонецЕсли;
			
			Запрос.Текст = "УНИЧТОЖИТЬ ВтРегистраторы; УНИЧТОЖИТЬ ПорядокДокументов; УНИЧТОЖИТЬ ВтРасчеты";
			Запрос.Выполнить();
			
			//2. Заполняем планы по новому алгоритму за весь период.
			ОсновныеПараметры = СтруктураПараметровЗаполненияВзаиморасчетов();
			ЗаполнитьЗначенияСвойств(ОсновныеПараметры,Отбор);
			ОсновныеПараметры.ВалютаРасчетов = Отбор.Валюта;
			ОсновныеПараметры.ЭтоРасчетыСКлиентами = ЭтоРасчетыСКлиентами;
			ОсновныеПараметры.НачальноеЗаполнение = НЕ ЗначениеЗаполнено(Отбор.ДатаПересчета);
			Если ЗначениеЗаполнено(Отбор.ДатаПересчета) Тогда
				ОсновныеПараметры.ПорядокФакт = Формат(Отбор.ДатаПересчета, "ДФ=yyyyMMdd000000");
				ОсновныеПараметры.ПорядокПлан = Формат(Отбор.ДатаПересчета, "ДФ=yyyyMMdd000000");
			КонецЕсли;
			ЗаполнитьОперативныеВзаиморасчеты(ОсновныеПараметры);
			
			ОтметитьВыполнениеПереноса(Отбор, Параметры.ВсеДатыПересчета);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(
				НСтр("ru='Включение онлайн взаиморасчетов с партнерами: Работа потока.';uk='Включення онлайн взаєморозрахунків з партнерами: Робота потоку.'",ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		КонецПопытки
		
	КонецЦикла;
	
	Если АдресРезультата <> Неопределено Тогда
		Результат = Новый Структура("КоличествоОбработанныхЗаписей", КоличествоОбработанныхЗаписей);
		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	КонецЕсли;
	
	Возврат КоличествоОбработанныхЗаписей;
	
КонецФункции

Процедура ЗаписатьНовыеЗаписиРасчетовПоСрокам(ЭтоРасчетыСКлиентами, ТаблицаДетальныхЗаписей, ПорядокОперации)
	
	Если ЭтоРасчетыСКлиентами Тогда
		НаборЗаписей = РегистрыНакопления.РасчетыСКлиентамиПоСрокам.СоздатьНаборЗаписей();
	Иначе
		НаборЗаписей = РегистрыНакопления.РасчетыСПоставщикамиПоСрокам.СоздатьНаборЗаписей();
	КонецЕсли;
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	
	Для Каждого СтрокаДвижений Из ТаблицаДетальныхЗаписей Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаДвижений.ПорядокОперации) Тогда
			Если ПорядокОперации.Получить(СтрокаДвижений.Период) = Неопределено Тогда
				ПорядокОперации.Вставить(СтрокаДвижений.Период, Порядок(СтрокаДвижений.Период, "",, Тип("ДокументСсылка.РасчетКурсовыхРазниц")));
			КонецЕсли;
			СтрокаДвижений.ПорядокОперации = ПорядокОперации[СтрокаДвижений.Период];
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаДетальныхЗаписей.Колонки.Добавить("Регистратор", Новый ОписаниеТипов("ДокументСсылка.РегистраторРасчетов"));
	ТаблицаДетальныхЗаписей.Индексы.Добавить("Регистратор");
	
	ТаблицаАналитик = ТаблицаДетальныхЗаписей.Скопировать();
	ТаблицаАналитик.Свернуть("АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта, Организация");
	Отбор = ТаблицаАналитик[0];
	
	СтруктураПараметровРегистраторов = Новый Структура;
	СтруктураПараметровРегистраторов.Вставить("ОбъектРасчетов",            Отбор.ОбъектРасчетов);
	СтруктураПараметровРегистраторов.Вставить("АналитикаУчетаПоПартнерам", Отбор.АналитикаУчетаПоПартнерам);
	СтруктураПараметровРегистраторов.Вставить("ВалютаРасчетов",            Отбор.Валюта);
	СтруктураПараметровРегистраторов.Вставить("Организация",               Отбор.Организация);
	СтруктураПараметровРегистраторов.Вставить("ЭтоРасчетыСКлиентами",      ЭтоРасчетыСКлиентами);
	
	ЗаписатьПорционно(СтруктураПараметровРегистраторов, ТаблицаДетальныхЗаписей, НаборЗаписей);

КонецПроцедуры

Функция ТекстЗапросаРасчетыСКлиентамиПоДокументам()
	
	Возврат "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВтРегистраторы
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК Расчеты
	|ГДЕ
	|	Расчеты.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
	|	И Расчеты.ЗаказКлиента = &ОбъектРасчетов
	|	И Расчеты.Валюта = &Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР КОГДА РасчетыСКлиентами.РасчетныйДокумент <> Неопределено 
	|		ТОГДА РасчетыСКлиентами.РасчетныйДокумент
	|		ИНАЧЕ РасчетыСКлиентами.Регистратор 
	|	КОНЕЦ                                      КАК Регистратор,
	|	МИНИМУМ(РасчетыСКлиентами.ПорядокОперации) КАК ПорядокОперации,
	|	МИНИМУМ(РасчетыСКлиентами.ПорядокЗачетаПоДатеПлатежа) КАК ПорядокЗачетаПоДатеПлатежа,
	|	МИНИМУМ(ВЫБОР КОГДА РасчетыСКлиентами.Регистратор ССЫЛКА Документ.ВводОстатков
	|					ИЛИ РасчетыСКлиентами.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов
	|						ТОГДА РасчетыСКлиентами.ДатаРегистратора
	|				ИНАЧЕ РасчетыСКлиентами.Период
	|			КОНЕЦ)                             КАК ДатаВозникновения,
	|	МИНИМУМ(РасчетыСКлиентами.ВалютаДокумента) КАК ВалютаДокумента,
	|	МАКСИМУМ(РасчетыСКлиентами.ДатаПлатежа)    КАК ДатаПлатежа
	|ПОМЕСТИТЬ ПорядокДокументов
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРегистраторы КАК Регистраторы
	|			ПО Регистраторы.Регистратор = РасчетыСКлиентами.Регистратор
	|ГДЕ
	|	РасчетыСКлиентами.Активность
	|	И НЕ РасчетыСКлиентами.ПорядокОперации = """"
	|	И РасчетыСКлиентами.Сумма <> 0
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР КОГДА РасчетыСКлиентами.РасчетныйДокумент <> Неопределено 
	|		ТОГДА РасчетыСКлиентами.РасчетныйДокумент
	|		ИНАЧЕ РасчетыСКлиентами.Регистратор 
	|	КОНЕЦ
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиПоДокументам.АналитикаУчетаПоПартнерам             КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентамиПоДокументам.ЗаказКлиента                          КАК ОбъектРасчетов,
	|	РасчетыСКлиентамиПоДокументам.ЗаказКлиента.ТипОбъектаРасчетов       КАК ТипОбъектаРасчетов,
	|	РасчетыСКлиентамиПоДокументам.Валюта                                КАК Валюта,
	|	РасчетыСКлиентамиПоДокументам.Регистратор                           КАК ДокументРегистратор,
	|	РасчетыСКлиентамиПоДокументам.Период                                КАК Период,
	|	РасчетыСКлиентамиПоДокументам.РасчетныйДокумент                     КАК РасчетныйДокумент,
	|	РасчетыСКлиентамиПоДокументам.ХозяйственнаяОперация                 КАК ХозяйственнаяОперация,
	|	РасчетыСКлиентамиПоДокументам.СтатьяДвиженияДенежныхСредств         КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И (РасчетыСКлиентамиПоДокументам.Долг > 0
	|			ИЛИ РасчетыСКлиентамиПоДокументам.ДолгРегл > 0 ИЛИ РасчетыСКлиентамиПоДокументам.ДолгУпр > 0
	|			ИЛИ РасчетыСКлиентамиПоДокументам.Предоплата < 0 ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл < 0
	|			ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаУпр < 0)
	|		ИЛИ ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И (РасчетыСКлиентамиПоДокументам.Предоплата > 0
	|			ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл > 0 ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаУпр > 0
	|			ИЛИ РасчетыСКлиентамиПоДокументам.Долг < 0 ИЛИ РасчетыСКлиентамиПоДокументам.ДолгРегл < 0 
	|			ИЛИ РасчетыСКлиентамиПоДокументам.ДолгУпр < 0) ТОГДА
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                                                               КАК ВидДвижения,
	|	ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.РасчетныйДокумент КАК Документ.КорректировкаРеализации).ДокументОснование КАК СвязанныйДокумент,
	|
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.Предоплата < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.Предоплата 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.Предоплата
	|	КОНЕЦ                                                               КАК Предоплата,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.ПредоплатаУпр < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.ПредоплатаУпр 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаУпр
	|	КОНЕЦ                                                               КАК ПредоплатаУпр,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.ПредоплатаРегл < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.ПредоплатаРегл 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаРегл
	|	КОНЕЦ                                                               КАК ПредоплатаРегл,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.Долг < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.Долг 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.Долг
	|	КОНЕЦ                                                               КАК Долг,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.ДолгУпр < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.ДолгУпр 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.ДолгУпр
	|	КОНЕЦ                                                               КАК ДолгУпр,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.ДолгРегл < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.ДолгРегл 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.ДолгРегл
	|	КОНЕЦ                                                               КАК ДолгРегл,
	|
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.Предоплата <> 0 ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА (ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И (РасчетыСКлиентамиПоДокументам.Долг > 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.ДолгРегл > 0 ИЛИ РасчетыСКлиентамиПоДокументам.ДолгУпр > 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.Предоплата < 0 ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл < 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаУпр < 0)
	|			ИЛИ ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И (РасчетыСКлиентамиПоДокументам.Предоплата > 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл > 0 ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаУпр > 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.Долг < 0 ИЛИ РасчетыСКлиентамиПоДокументам.ДолгРегл < 0 
	|				ИЛИ РасчетыСКлиентамиПоДокументам.ДолгУпр < 0))
	|			И НЕ ((РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатков ИЛИ
	|					РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов) И 
	|					РасчетыСКлиентамиПоДокументам.РасчетныйДокумент <> Неопределено)
	|			И НЕ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.РасчетКурсовыхРазниц ТОГДА
	|			ЕСТЬNULL(ДатыВозникновения.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1))
	|	ИНАЧЕ
	|		ЕСТЬNULL(ДатыВозникновения.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1))
	|	КОНЕЦ                                                               КАК ДатаПлановогоПогашения,
	|	ЕСТЬNULL(ДатыВозникновения.ДатаВозникновения,ДАТАВРЕМЯ(1,1,1))      КАК ДатаВозникновения,
	|	ЕСТЬNULL(ПорядокДокументов.ПорядокОперации,"""")                    КАК ПорядокОперации,
	|	ЕСТЬNULL(ДатыВозникновения.ПорядокЗачетаПоДатеПлатежа,"""")         КАК ПорядокЗачетаРегистратора,
	|	ЕСТЬNULL(ДатыВозникновения.ПорядокЗачетаПоДатеПлатежа,"""")         КАК ПорядокЗачета,
	|	ЕСТЬNULL(ДатыВозникновения.ВалютаДокумента,
	|		ЕСТЬNULL(ДатыВозникновения.ВалютаДокумента,
	|			ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)))                  КАК ВалютаДокумента
	|ПОМЕСТИТЬ ВтРасчеты
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокДокументов КАК ПорядокДокументов
	|		ПО РасчетыСКлиентамиПоДокументам.Регистратор = ПорядокДокументов.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокДокументов КАК ДатыВозникновения
	|		ПО РасчетыСКлиентамиПоДокументам.РасчетныйДокумент = ДатыВозникновения.Регистратор
	|ГДЕ
	|	(РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатков
	|		ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов)
	|	И РасчетыСКлиентамиПоДокументам.Регистратор <> РасчетыСКлиентамиПоДокументам.РасчетныйДокумент
	|	И (РасчетыСКлиентамиПоДокументам.Предоплата <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаУпр <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.Долг <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.ДолгРегл <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.ДолгУпр <> 0)
	|	И РасчетыСКлиентамиПоДокументам.Активность
	|	И РасчетыСКлиентамиПоДокументам.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
	|	И РасчетыСКлиентамиПоДокументам.ЗаказКлиента = &ОбъектРасчетов
	|	И РасчетыСКлиентамиПоДокументам.Валюта = &Валюта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиПоДокументам.АналитикаУчетаПоПартнерам             КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентамиПоДокументам.ЗаказКлиента                          КАК ОбъектРасчетов,
	|	РасчетыСКлиентамиПоДокументам.ЗаказКлиента.ТипОбъектаРасчетов       КАК ТипОбъектаРасчетов,
	|	РасчетыСКлиентамиПоДокументам.Валюта                                КАК Валюта,
	|	РасчетыСКлиентамиПоДокументам.Регистратор                           КАК ДокументРегистратор,
	|	РасчетыСКлиентамиПоДокументам.Период                                КАК Период,
	|	РасчетыСКлиентамиПоДокументам.РасчетныйДокумент                     КАК РасчетныйДокумент,
	|	РасчетыСКлиентамиПоДокументам.ХозяйственнаяОперация                 КАК ХозяйственнаяОперация,
	|	РасчетыСКлиентамиПоДокументам.СтатьяДвиженияДенежныхСредств         КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И (РасчетыСКлиентамиПоДокументам.Долг > 0
	|			ИЛИ РасчетыСКлиентамиПоДокументам.ДолгРегл > 0 ИЛИ РасчетыСКлиентамиПоДокументам.ДолгУпр > 0
	|			ИЛИ РасчетыСКлиентамиПоДокументам.Предоплата < 0 ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл < 0
	|			ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаУпр < 0)
	|		ИЛИ ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И (РасчетыСКлиентамиПоДокументам.Предоплата > 0
	|			ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл > 0 ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаУпр > 0
	|			ИЛИ РасчетыСКлиентамиПоДокументам.Долг < 0 ИЛИ РасчетыСКлиентамиПоДокументам.ДолгРегл < 0 
	|			ИЛИ РасчетыСКлиентамиПоДокументам.ДолгУпр < 0) ТОГДА
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                                                               КАК ВидДвижения,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.КорректировкаРеализации 
	|		ТОГДА ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.Регистратор КАК Документ.КорректировкаРеализации).ДокументОснование
	|		ИНАЧЕ ВЫРАЗИТЬ(РасчетыСКлиентамиПоДокументам.РасчетныйДокумент КАК Документ.КорректировкаРеализации).ДокументОснование
	|	КОНЕЦ КАК СвязанныйДокумент,
	|
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.Предоплата < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.Предоплата 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.Предоплата
	|	КОНЕЦ                                                               КАК Предоплата,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.ПредоплатаУпр < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.ПредоплатаУпр 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаУпр
	|	КОНЕЦ                                                               КАК ПредоплатаУпр,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.ПредоплатаРегл < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.ПредоплатаРегл 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаРегл
	|	КОНЕЦ                                                               КАК ПредоплатаРегл,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.Долг < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.Долг 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.Долг
	|	КОНЕЦ                                                               КАК Долг,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.ДолгУпр < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.ДолгУпр 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.ДолгУпр
	|	КОНЕЦ                                                               КАК ДолгУпр,
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.ДолгРегл < 0 ТОГДА
	|		-РасчетыСКлиентамиПоДокументам.ДолгРегл 
	|	ИНАЧЕ
	|		РасчетыСКлиентамиПоДокументам.ДолгРегл
	|	КОНЕЦ                                                               КАК ДолгРегл,
	|
	|	ВЫБОР КОГДА РасчетыСКлиентамиПоДокументам.Предоплата <> 0 ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА (ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И (РасчетыСКлиентамиПоДокументам.Долг > 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.ДолгРегл > 0 ИЛИ РасчетыСКлиентамиПоДокументам.ДолгУпр > 0)
	|			ИЛИ ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И (РасчетыСКлиентамиПоДокументам.Предоплата > 0
	|				ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл > 0 ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаУпр > 0))
	|			И НЕ ((РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатков ИЛИ
	|					РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов) И
	|					РасчетыСКлиентамиПоДокументам.РасчетныйДокумент <> Неопределено)
	|			И НЕ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.РасчетКурсовыхРазниц ТОГДА
	|			ВЫБОР
	|				КОГДА ЕСТЬNULL(ДатыВозникновения.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1)) = ДАТАВРЕМЯ(1,1,1)
	|					ТОГДА ЕСТЬNULL(ПорядокДокументов.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1))
	|				ИНАЧЕ ЕСТЬNULL(ДатыВозникновения.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1))
	|			КОНЕЦ
	|	ИНАЧЕ
	|		ЕСТЬNULL(ДатыВозникновения.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1))
	|	КОНЕЦ                                                               КАК ДатаПлановогоПогашения,
	|	ЕСТЬNULL(ДатыВозникновения.ДатаВозникновения,ДАТАВРЕМЯ(1,1,1))      КАК ДатаВозникновения,
	|	ЕСТЬNULL(ПорядокДокументов.ПорядокОперации,"""")                    КАК ПорядокОперации,
	|	ЕСТЬNULL(ПорядокДокументов.ПорядокЗачетаПоДатеПлатежа,"""")         КАК ПорядокЗачетаРегистратора,
	|	ЕСТЬNULL(ДатыВозникновения.ПорядокЗачетаПоДатеПлатежа,"""")         КАК ПорядокЗачета,
	|	ЕСТЬNULL(ДатыВозникновения.ВалютаДокумента,
	|		ЕСТЬNULL(ПорядокДокументов.ВалютаДокумента,
	|			ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)))                  КАК ВалютаДокумента
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокДокументов КАК ПорядокДокументов
	|			ПО РасчетыСКлиентамиПоДокументам.Регистратор = ПорядокДокументов.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокДокументов КАК ДатыВозникновения
	|			ПО РасчетыСКлиентамиПоДокументам.РасчетныйДокумент = ДатыВозникновения.Регистратор
	|ГДЕ
	|	(НЕ (РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатков
	|		ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов)
	|	ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор = РасчетыСКлиентамиПоДокументам.РасчетныйДокумент)
	|	И (РасчетыСКлиентамиПоДокументам.Предоплата <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.ПредоплатаУпр <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.Долг <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.ДолгРегл <> 0
	|		ИЛИ РасчетыСКлиентамиПоДокументам.ДолгУпр <> 0)
	|	И РасчетыСКлиентамиПоДокументам.Активность
	|	И РасчетыСКлиентамиПоДокументам.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
	|	И РасчетыСКлиентамиПоДокументам.ЗаказКлиента = &ОбъектРасчетов
	|	И РасчетыСКлиентамиПоДокументам.Валюта = &Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расчеты.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.ОбъектРасчетов                КАК ОбъектРасчетов,
	|	Расчеты.Валюта                        КАК Валюта,
	|	Расчеты.ДокументРегистратор           КАК ДокументРегистратор,
	|	Расчеты.РасчетныйДокумент             КАК РасчетныйДокумент,
	|	Расчеты.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
	|	Расчеты.Период                        КАК Период,
	|	Расчеты.ДатаПлановогоПогашения        КАК ДатаПлановогоПогашения,
	|	Расчеты.ДатаВозникновения             КАК ДатаВозникновения,
	|	Расчеты.ВидДвижения                   КАК ВидДвижения,
	|	СУММА(Расчеты.Предоплата)             КАК Предоплата,
	|	СУММА(Расчеты.ПредоплатаУпр)          КАК ПредоплатаУпр,
	|	СУММА(Расчеты.ПредоплатаРегл)         КАК ПредоплатаРегл,
	|	СУММА(Расчеты.Долг)                   КАК Долг,
	|	СУММА(Расчеты.ДолгУпр)                КАК ДолгУпр,
	|	СУММА(Расчеты.ДолгРегл)               КАК ДолгРегл,
	|	Расчеты.СвязанныйДокумент             КАК СвязанныйДокумент,
	|	Расчеты.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	Расчеты.ПорядокОперации               КАК ПорядокОперации,
	|	Расчеты.ПорядокЗачета                 КАК ПорядокЗачета,
	|	Расчеты.ВалютаДокумента               КАК ВалютаДокумента,
	|	Расчеты.Организация                   КАК Организация
	|ИЗ (
	|	ВЫБРАТЬ
	|		ЗачетыОплат.АналитикаУчетаПоПартнерам                            КАК АналитикаУчетаПоПартнерам,
	|		ЗачетыОплат.ОбъектРасчетов                                       КАК ОбъектРасчетов,
	|		ЗачетыОплат.Валюта                                               КАК Валюта,
	|		ЗачетыОплат.ДокументРегистратор                                  КАК ДокументРегистратор,
	|		ЗачетыОплат.ДокументРегистратор                                  КАК РасчетныйДокумент,
	|		ЗачетыОплат.ХозяйственнаяОперация                                КАК ХозяйственнаяОперация,
	|		ЗачетыОплат.Период                                               КАК Период,
	|		ДатыВозникновения.ДатаПлатежа                                    КАК ДатаПлановогоПогашения,
	|		ЗачетыОплат.Период                                               КАК ДатаВозникновения,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)                           КАК ВидДвижения,
	|		0                                                                КАК Предоплата,
	|		0                                                                КАК ПредоплатаУпр,
	|		0                                                                КАК ПредоплатаРегл,
	|		ЗачетыОплат.Предоплата                                           КАК Долг,
	|		ЗачетыОплат.ПредоплатаУпр                                        КАК ДолгУпр,
	|		ЗачетыОплат.ПредоплатаРегл                                       КАК ДолгРегл,
	|		Неопределено                                                     КАК СвязанныйДокумент,
	|		ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)  КАК СтатьяДвиженияДенежныхСредств,
	|		ЗачетыОплат.ПорядокОперации                                      КАК ПорядокОперации,
	|		ЗачетыОплат.ПорядокЗачетаРегистратора                            КАК ПорядокЗачета,
	|		ЗачетыОплат.ВалютаДокумента                                      КАК ВалютаДокумента,
	|		ЗачетыОплат.АналитикаУчетаПоПартнерам.Организация                КАК Организация
	|	ИЗ ВтРасчеты КАК ЗачетыОплат
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокДокументов КАК ДатыВозникновения
	|			ПО ЗачетыОплат.ДокументРегистратор = ДатыВозникновения.Регистратор
	|	ГДЕ	ЗачетыОплат.Предоплата > 0 
	|		И ЗачетыОплат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И ЗачетыОплат.ХозяйственнаяОперация НЕ В (&ХозяйственныеОперацииНеОтгрузка)
	|		И ЗачетыОплат.ТипОбъектаРасчетов <> ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.ПлатежВозврат)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗачетыОплат.АналитикаУчетаПоПартнерам                            КАК АналитикаУчетаПоПартнерам,
	|		ЗачетыОплат.ОбъектРасчетов                                       КАК ОбъектРасчетов,
	|		ЗачетыОплат.Валюта                                               КАК Валюта,
	|		ЗачетыОплат.ДокументРегистратор                                  КАК ДокументРегистратор,
	|		ЗачетыОплат.ДокументРегистратор                                  КАК РасчетныйДокумент,
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаКлиента)  КАК ХозяйственнаяОперация,
	|		ЗачетыОплат.Период                                               КАК Период,
	|		ДатыВозникновения.ДатаПлатежа                                    КАК ДатаПлановогоПогашения,
	|		ЗачетыОплат.Период                                               КАК ДатаВозникновения,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)                           КАК ВидДвижения,
	|		0                                                                КАК Предоплата,
	|		0                                                                КАК ПредоплатаУпр,
	|		0                                                                КАК ПредоплатаРегл,
	|		ЗачетыОплат.Предоплата                                           КАК Долг,
	|		ЗачетыОплат.ПредоплатаУпр                                        КАК ДолгУпр,
	|		ЗачетыОплат.ПредоплатаРегл                                       КАК ДолгРегл,
	|		Неопределено                                                     КАК СвязанныйДокумент,
	|		ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)  КАК СтатьяДвиженияДенежныхСредств,
	|		ЗачетыОплат.ПорядокОперации                                      КАК ПорядокОперации,
	|		ЗачетыОплат.ПорядокЗачетаРегистратора                            КАК ПорядокЗачета,
	|		ЗачетыОплат.ВалютаДокумента                                      КАК ВалютаДокумента,
	|		ЗачетыОплат.АналитикаУчетаПоПартнерам.Организация                КАК Организация
	|	ИЗ ВтРасчеты КАК ЗачетыОплат
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокДокументов КАК ДатыВозникновения
	|			ПО ЗачетыОплат.ДокументРегистратор = ДатыВозникновения.Регистратор
	|	ГДЕ
	|		ЗачетыОплат.Предоплата > 0 
	|		И ЗачетыОплат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И ЗачетыОплат.ХозяйственнаяОперация НЕ В (&ХозяйственныеОперацииНеОтгрузка)
	|		И ЗачетыОплат.ТипОбъектаРасчетов <> ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.ПлатежВозврат)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоДокументам.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
	|		РасчетыПоДокументам.ОбъектРасчетов                КАК ОбъектРасчетов,
	|		РасчетыПоДокументам.Валюта                        КАК Валюта,
	|		РасчетыПоДокументам.ДокументРегистратор           КАК ДокументРегистратор,
	|		РасчетыПоДокументам.РасчетныйДокумент             КАК РасчетныйДокумент,
	|		ВЫБОР КОГДА РасчетыПоДокументам.Предоплата <> 0 И РасчетыПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И РасчетыПоДокументам.ХозяйственнаяОперация НЕ В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности),
	|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности))
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаКлиента)
	|			КОГДА РасчетыПоДокументам.Долг <> 0 И РасчетыПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И РасчетыПоДокументам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПогашениеЗадолженностиКлиента)
	|			ИНАЧЕ РасчетыПоДокументам.ХозяйственнаяОперация 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		РасчетыПоДокументам.Период                        КАК Период,
	|		РасчетыПоДокументам.ДатаПлановогоПогашения        КАК ДатаПлановогоПогашения,
	|		РасчетыПоДокументам.ДатаВозникновения             КАК ДатаВозникновения,
	|		РасчетыПоДокументам.ВидДвижения                   КАК ВидДвижения,
	|		РасчетыПоДокументам.Предоплата                    КАК Предоплата,
	|		РасчетыПоДокументам.ПредоплатаУпр                 КАК ПредоплатаУпр,
	|		РасчетыПоДокументам.ПредоплатаРегл                КАК ПредоплатаРегл,
	|		РасчетыПоДокументам.Долг                          КАК Долг,
	|		РасчетыПоДокументам.ДолгУпр                       КАК ДолгУпр,
	|		РасчетыПоДокументам.ДолгРегл                      КАК ДолгРегл,
	|		ВЫБОР КОГДА (РасчетыПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И РасчетыПоДокументам.Предоплата > 0)
	|			ИЛИ (РасчетыПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И РасчетыПоДокументам.Долг > 0)
	|			ТОГДА РасчетыПоДокументам.СвязанныйДокумент
	|			ИНАЧЕ Неопределено
	|		КОНЕЦ                                             КАК СвязанныйДокумент,
	|		РасчетыПоДокументам.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|		РасчетыПоДокументам.ПорядокОперации               КАК ПорядокОперации,
	|		РасчетыПоДокументам.ПорядокЗачета                 КАК ПорядокЗачета,
	|		РасчетыПоДокументам.ВалютаДокумента               КАК ВалютаДокумента,
	|		РасчетыПоДокументам.АналитикаУчетаПоПартнерам.Организация КАК Организация
	|	ИЗ ВтРасчеты КАК РасчетыПоДокументам) КАК Расчеты
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.АналитикаУчетаПоПартнерам,
	|	Расчеты.ОбъектРасчетов,
	|	Расчеты.Валюта,
	|	Расчеты.ДокументРегистратор,
	|	Расчеты.РасчетныйДокумент,
	|	Расчеты.ХозяйственнаяОперация,
	|	Расчеты.Период,
	|	Расчеты.ДатаПлановогоПогашения,
	|	Расчеты.ДатаВозникновения,
	|	Расчеты.ВидДвижения,
	|	Расчеты.СвязанныйДокумент,
	|	Расчеты.СтатьяДвиженияДенежныхСредств,
	|	Расчеты.ПорядокОперации,
	|	Расчеты.ПорядокЗачета,
	|	Расчеты.ВалютаДокумента,
	|	Расчеты.Организация
	|";
	
КонецФункции

Функция ТекстЗапросаРасчетыСПоставщикамиПоДокументам()
	
	Возврат "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВтРегистраторы
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК Расчеты
	|ГДЕ
	|	Расчеты.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
	|	И Расчеты.ЗаказПоставщику = &ОбъектРасчетов
	|	И Расчеты.Валюта = &Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫБОР КОГДА РасчетыСПоставщиками.РасчетныйДокумент <> Неопределено 
	|		ТОГДА РасчетыСПоставщиками.РасчетныйДокумент
	|		ИНАЧЕ РасчетыСПоставщиками.Регистратор 
	|	КОНЕЦ                                         КАК Регистратор,
	|	МИНИМУМ(РасчетыСПоставщиками.ПорядокОперации) КАК ПорядокОперации,
	|	МИНИМУМ(РасчетыСПоставщиками.ПорядокЗачетаПоДатеПлатежа) КАК ПорядокЗачетаПоДатеПлатежа,
	|	МИНИМУМ(ВЫБОР КОГДА РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.ВводОстатков ИЛИ
	|					РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов
	|						ТОГДА РасчетыСПоставщиками.ДатаРегистратора
	|				ИНАЧЕ РасчетыСПоставщиками.Период
	|			КОНЕЦ)                                КАК ДатаВозникновения,
	|	МИНИМУМ(РасчетыСПоставщиками.ВалютаДокумента) КАК ВалютаДокумента,
	|	МАКСИМУМ(РасчетыСПоставщиками.ДатаПлатежа)    КАК ДатаПлатежа
	|ПОМЕСТИТЬ ПорядокДокументов
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтРегистраторы КАК Регистраторы
	|			ПО Регистраторы.Регистратор = РасчетыСПоставщиками.Регистратор
	|ГДЕ
	|	РасчетыСПоставщиками.Активность
	|	И НЕ РасчетыСПоставщиками.ПорядокОперации = """"
	|	И (РасчетыСПоставщиками.Сумма <> 0 ИЛИ РасчетыСПоставщиками.КОплате <> 0)
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР КОГДА РасчетыСПоставщиками.РасчетныйДокумент <> Неопределено 
	|		ТОГДА РасчетыСПоставщиками.РасчетныйДокумент
	|		ИНАЧЕ РасчетыСПоставщиками.Регистратор 
	|	КОНЕЦ
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыСПоставщикамиПоДокументам.АналитикаУчетаПоПартнерам      КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику                КАК ОбъектРасчетов,
	|	РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику.ТипОбъектаРасчетов КАК ТипОбъектаРасчетов,
	|	РасчетыСПоставщикамиПоДокументам.Валюта                         КАК Валюта,
	|	РасчетыСПоставщикамиПоДокументам.Регистратор                    КАК ДокументРегистратор,
	|	РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент              КАК РасчетныйДокумент,
	|	РасчетыСПоставщикамиПоДокументам.ХозяйственнаяОперация          КАК ХозяйственнаяОперация,
	|	РасчетыСПоставщикамиПоДокументам.СтатьяДвиженияДенежныхСредств  КАК СтатьяДвиженияДенежныхСредств,
	|	РасчетыСПоставщикамиПоДокументам.Период                         КАК Период,
	|	ВЫБОР КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И (РасчетыСПоставщикамиПоДокументам.Долг < 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгРегл < 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгУпр < 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.Предоплата > 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл > 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр > 0)
	|		ИЛИ ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И (РасчетыСПоставщикамиПоДокументам.Предоплата < 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл < 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр < 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.Долг > 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгРегл > 0 
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгУпр > 0) ТОГДА
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                                                           КАК ВидДвижения,
	|	ВЫРАЗИТЬ(РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент КАК Документ.КорректировкаПриобретения).ДокументОснование КАК СвязанныйДокумент,
	|
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.Предоплата < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.Предоплата 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.Предоплата
	|	КОНЕЦ                                                           КАК Предоплата,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр
	|	КОНЕЦ                                                           КАК ПредоплатаУпр,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл
	|	КОНЕЦ                                                           КАК ПредоплатаРегл,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.Долг < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.Долг 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.Долг
	|	КОНЕЦ                                                           КАК Долг,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.ДолгУпр < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.ДолгУпр 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.ДолгУпр
	|	КОНЕЦ                                                           КАК ДолгУпр,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.ДолгРегл < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.ДолгРегл 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.ДолгРегл
	|	КОНЕЦ                                                           КАК ДолгРегл,
	|
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.Предоплата <> 0 ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА (ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И (РасчетыСПоставщикамиПоДокументам.Долг < 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгРегл < 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгУпр < 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.Предоплата > 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл > 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр > 0)
	|		ИЛИ ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И (РасчетыСПоставщикамиПоДокументам.Предоплата < 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл < 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр < 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.Долг > 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгРегл > 0 
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгУпр > 0)) 
	|			И НЕ ((РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатков ИЛИ
	|					РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов) И 
	|					РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент <> Неопределено)
	|			И НЕ РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.РасчетКурсовыхРазниц ТОГДА
	|			ЕСТЬNULL(ДатыВозникновения.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1))
	|	ИНАЧЕ
	|		ЕСТЬNULL(ДатыВозникновения.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1))
	|	КОНЕЦ                                                           КАК ДатаПлановогоПогашения,
	|	ЕСТЬNULL(ДатыВозникновения.ДатаВозникновения, ДАТАВРЕМЯ(1,1,1)) КАК ДатаВозникновения,
	|	ЕСТЬNULL(ПорядокДокументов.ПорядокОперации,"""")                КАК ПорядокОперации,
	|	ЕСТЬNULL(ДатыВозникновения.ПорядокЗачетаПоДатеПлатежа,"""")     КАК ПорядокЗачетаРегистратора,
	|	ЕСТЬNULL(ДатыВозникновения.ПорядокЗачетаПоДатеПлатежа,"""")     КАК ПорядокЗачета,
	|	ЕСТЬNULL(ДатыВозникновения.ВалютаДокумента,
	|		ЕСТЬNULL(ДатыВозникновения.ВалютаДокумента,
	|			ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)))              КАК ВалютаДокумента
	|ПОМЕСТИТЬ ВтРасчеты
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщикамиПоДокументам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокДокументов КАК ПорядокДокументов
	|		ПО РасчетыСПоставщикамиПоДокументам.Регистратор = ПорядокДокументов.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокДокументов КАК ДатыВозникновения
	|		ПО РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент = ДатыВозникновения.Регистратор
	|ГДЕ
	|	(РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатков
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов)
	|	И РасчетыСПоставщикамиПоДокументам.Регистратор <> РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент
	|	И (РасчетыСПоставщикамиПоДокументам.Предоплата <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.Долг <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгРегл <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгУпр <> 0)
	|	И РасчетыСПоставщикамиПоДокументам.Активность
	|	И РасчетыСПоставщикамиПоДокументам.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
	|	И РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику = &ОбъектРасчетов
	|	И РасчетыСПоставщикамиПоДокументам.Валюта = &Валюта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыСПоставщикамиПоДокументам.АналитикаУчетаПоПартнерам      КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику                КАК ОбъектРасчетов,
	|	РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику.ТипОбъектаРасчетов КАК ТипОбъектаРасчетов,
	|	РасчетыСПоставщикамиПоДокументам.Валюта                         КАК Валюта,
	|	РасчетыСПоставщикамиПоДокументам.Регистратор                    КАК ДокументРегистратор,
	|	РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент              КАК РасчетныйДокумент,
	|	РасчетыСПоставщикамиПоДокументам.ХозяйственнаяОперация          КАК ХозяйственнаяОперация,
	|	РасчетыСПоставщикамиПоДокументам.СтатьяДвиженияДенежныхСредств  КАК СтатьяДвиженияДенежныхСредств,
	|	РасчетыСПоставщикамиПоДокументам.Период                         КАК Период,
	|	ВЫБОР КОГДА ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И (РасчетыСПоставщикамиПоДокументам.Долг < 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгРегл < 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгУпр < 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.Предоплата > 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл > 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр > 0)
	|		ИЛИ ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И (РасчетыСПоставщикамиПоДокументам.Предоплата < 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл < 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр < 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.Долг > 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгРегл > 0 
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгУпр > 0) ТОГДА
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	КОНЕЦ                                                           КАК ВидДвижения,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.КорректировкаПриобретения 
	|		ТОГДА ВЫРАЗИТЬ(РасчетыСПоставщикамиПоДокументам.Регистратор КАК Документ.КорректировкаПриобретения).ДокументОснование
	|		ИНАЧЕ ВЫРАЗИТЬ(РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент КАК Документ.КорректировкаПриобретения).ДокументОснование
	|	КОНЕЦ КАК СвязанныйДокумент,
	|
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.Предоплата < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.Предоплата 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.Предоплата
	|	КОНЕЦ                                                           КАК Предоплата,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр
	|	КОНЕЦ                                                           КАК ПредоплатаУпр,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл
	|	КОНЕЦ                                                           КАК ПредоплатаРегл,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.Долг < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.Долг 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.Долг
	|	КОНЕЦ                                                           КАК Долг,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.ДолгУпр < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.ДолгУпр 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.ДолгУпр
	|	КОНЕЦ                                                           КАК ДолгУпр,
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.ДолгРегл < 0  ТОГДА
	|		-РасчетыСПоставщикамиПоДокументам.ДолгРегл 
	|	ИНАЧЕ
	|		РасчетыСПоставщикамиПоДокументам.ДолгРегл
	|	КОНЕЦ                                                           КАК ДолгРегл,
	|
	|	ВЫБОР КОГДА РасчетыСПоставщикамиПоДокументам.Предоплата <> 0 ТОГДА ДАТАВРЕМЯ(1,1,1)
	|		КОГДА (ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И 
	|				(РасчетыСПоставщикамиПоДокументам.Предоплата > 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл > 0
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр > 0)
	|		ИЛИ ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И 
	|				(РасчетыСПоставщикамиПоДокументам.Долг > 0 ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгРегл > 0 
	|				ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгУпр > 0)) 
	|			И НЕ ((РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатков ИЛИ
	|					РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов) И 
	|					РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент <> Неопределено)
	|			И НЕ РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.РасчетКурсовыхРазниц ТОГДА
	|			ВЫБОР
	|				КОГДА ЕСТЬNULL(ДатыВозникновения.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1)) = ДАТАВРЕМЯ(1,1,1)
	|					ТОГДА ЕСТЬNULL(ПорядокДокументов.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1))
	|				ИНАЧЕ ЕСТЬNULL(ДатыВозникновения.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1))
	|			КОНЕЦ
	|	ИНАЧЕ
	|		ЕСТЬNULL(ДатыВозникновения.ДатаПлатежа, ДАТАВРЕМЯ(1,1,1))
	|	КОНЕЦ                                                           КАК ДатаПлановогоПогашения,
	|	ЕСТЬNULL(ДатыВозникновения.ДатаВозникновения, ДАТАВРЕМЯ(1,1,1)) КАК ДатаВозникновения,
	|	ЕСТЬNULL(ПорядокДокументов.ПорядокОперации,"""")                КАК ПорядокОперации,
	|	ЕСТЬNULL(ПорядокДокументов.ПорядокЗачетаПоДатеПлатежа,"""")     КАК ПорядокЗачетаРегистратора,
	|	ЕСТЬNULL(ДатыВозникновения.ПорядокЗачетаПоДатеПлатежа,"""")     КАК ПорядокЗачета,
	|	ЕСТЬNULL(ДатыВозникновения.ВалютаДокумента,
	|		ЕСТЬNULL(ПорядокДокументов.ВалютаДокумента,
	|			ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)))              КАК ВалютаДокумента
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщикамиПоДокументам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокДокументов КАК ПорядокДокументов
	|		ПО РасчетыСПоставщикамиПоДокументам.Регистратор = ПорядокДокументов.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокДокументов КАК ДатыВозникновения
	|		ПО РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент = ДатыВозникновения.Регистратор
	|ГДЕ
	|	(НЕ (РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатков 
	|			ИЛИ РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов)
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.Регистратор = РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент)
	|	И (РасчетыСПоставщикамиПоДокументам.Предоплата <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.ПредоплатаУпр <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.Долг <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгРегл <> 0
	|		ИЛИ РасчетыСПоставщикамиПоДокументам.ДолгУпр <> 0)
	|	И РасчетыСПоставщикамиПоДокументам.Активность
	|	И РасчетыСПоставщикамиПоДокументам.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
	|	И РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику = &ОбъектРасчетов
	|	И РасчетыСПоставщикамиПоДокументам.Валюта = &Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Расчеты.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
	|	Расчеты.ОбъектРасчетов                КАК ОбъектРасчетов,
	|	Расчеты.Валюта                        КАК Валюта,
	|	Расчеты.ДокументРегистратор           КАК ДокументРегистратор,
	|	Расчеты.РасчетныйДокумент             КАК РасчетныйДокумент,
	|	Расчеты.ХозяйственнаяОперация         КАК ХозяйственнаяОперация,
	|	Расчеты.Период                        КАК Период,
	|	Расчеты.ДатаПлановогоПогашения        КАК ДатаПлановогоПогашения,
	|	Расчеты.ДатаВозникновения             КАК ДатаВозникновения,
	|	Расчеты.ВидДвижения                   КАК ВидДвижения,
	|	СУММА(Расчеты.Предоплата)             КАК Предоплата,
	|	СУММА(Расчеты.ПредоплатаУпр)          КАК ПредоплатаУпр,
	|	СУММА(Расчеты.ПредоплатаРегл)         КАК ПредоплатаРегл,
	|	СУММА(Расчеты.Долг)                   КАК Долг,
	|	СУММА(Расчеты.ДолгУпр)                КАК ДолгУпр,
	|	СУММА(Расчеты.ДолгРегл)               КАК ДолгРегл,
	|	Расчеты.СвязанныйДокумент             КАК СвязанныйДокумент,
	|	Расчеты.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	Расчеты.ПорядокОперации               КАК ПорядокОперации,
	|	Расчеты.ПорядокЗачета                 КАК ПорядокЗачета,
	|	Расчеты.ВалютаДокумента               КАК ВалютаДокумента,
	|	Расчеты.Организация                   КАК Организация
	|ИЗ (
	|	ВЫБРАТЬ
	|		ЗачетыОплат.АналитикаУчетаПоПартнерам                            КАК АналитикаУчетаПоПартнерам,
	|		ЗачетыОплат.ОбъектРасчетов                                       КАК ОбъектРасчетов,
	|		ЗачетыОплат.Валюта                                               КАК Валюта,
	|		ЗачетыОплат.ДокументРегистратор                                  КАК ДокументРегистратор,
	|		ЗачетыОплат.ДокументРегистратор                                  КАК РасчетныйДокумент,
	|		ЗачетыОплат.ХозяйственнаяОперация                                КАК ХозяйственнаяОперация,
	|		ЗачетыОплат.Период                                               КАК Период,
	|		ДатыВозникновения.ДатаПлатежа                                    КАК ДатаПлановогоПогашения,
	|		ЗачетыОплат.Период                                               КАК ДатаВозникновения,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)                           КАК ВидДвижения,
	|		0                                                                КАК Предоплата,
	|		0                                                                КАК ПредоплатаУпр,
	|		0                                                                КАК ПредоплатаРегл,
	|		ЗачетыОплат.Предоплата                                           КАК Долг,
	|		ЗачетыОплат.ПредоплатаУпр                                        КАК ДолгУпр,
	|		ЗачетыОплат.ПредоплатаРегл                                       КАК ДолгРегл,
	|		Неопределено                                                     КАК СвязанныйДокумент,
	|		ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)  КАК СтатьяДвиженияДенежныхСредств,
	|		ЗачетыОплат.ПорядокОперации                                      КАК ПорядокОперации,
	|		ЗачетыОплат.ПорядокЗачетаРегистратора                            КАК ПорядокЗачета,
	|		ЗачетыОплат.ВалютаДокумента                                      КАК ВалютаДокумента,
	|		ЗачетыОплат.АналитикаУчетаПоПартнерам.Организация                КАК Организация
	|	ИЗ ВтРасчеты КАК ЗачетыОплат
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокДокументов КАК ДатыВозникновения
	|			ПО ЗачетыОплат.ДокументРегистратор = ДатыВозникновения.Регистратор
	|	ГДЕ
	|		ЗачетыОплат.Предоплата > 0 
	|		И ЗачетыОплат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И ЗачетыОплат.ХозяйственнаяОперация НЕ В (&ХозяйственныеОперацииНеОтгрузка)
	|		И ЗачетыОплат.ТипОбъектаРасчетов <> ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.ПлатежВозврат)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗачетыОплат.АналитикаУчетаПоПартнерам                              КАК АналитикаУчетаПоПартнерам,
	|		ЗачетыОплат.ОбъектРасчетов                                         КАК ОбъектРасчетов,
	|		ЗачетыОплат.Валюта                                                 КАК Валюта,
	|		ЗачетыОплат.ДокументРегистратор                                    КАК ДокументРегистратор,
	|		ЗачетыОплат.ДокументРегистратор                                    КАК РасчетныйДокумент,
	|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаПоставщику) КАК ХозяйственнаяОперация,
	|		ЗачетыОплат.Период                                                 КАК Период,
	|		ДатыВозникновения.ДатаПлатежа                                      КАК ДатаПлановогоПогашения,
	|		ЗачетыОплат.Период                                                 КАК ДатаВозникновения,
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)                             КАК ВидДвижения,
	|		0                                                                  КАК Предоплата,
	|		0                                                                  КАК ПредоплатаУпр,
	|		0                                                                  КАК ПредоплатаРегл,
	|		ЗачетыОплат.Предоплата                                             КАК Долг,
	|		ЗачетыОплат.ПредоплатаУпр                                          КАК ДолгУпр,
	|		ЗачетыОплат.ПредоплатаРегл                                         КАК ДолгРегл,
	|		Неопределено                                                       КАК СвязанныйДокумент,
	|		ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)    КАК СтатьяДвиженияДенежныхСредств,
	|		ЗачетыОплат.ПорядокОперации                                        КАК ПорядокОперации,
	|		ЗачетыОплат.ПорядокЗачетаРегистратора                            КАК ПорядокЗачета,
	|		ЗачетыОплат.ВалютаДокумента                                        КАК ВалютаДокумента,
	|		ЗачетыОплат.АналитикаУчетаПоПартнерам.Организация                  КАК Организация
	|	ИЗ ВтРасчеты КАК ЗачетыОплат
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПорядокДокументов КАК ДатыВозникновения
	|			ПО ЗачетыОплат.ДокументРегистратор = ДатыВозникновения.Регистратор
	|	ГДЕ
	|		ЗачетыОплат.Предоплата > 0 
	|		И ЗачетыОплат.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И ЗачетыОплат.ХозяйственнаяОперация НЕ В (&ХозяйственныеОперацииНеОтгрузка)
	|		И ЗачетыОплат.ТипОбъектаРасчетов <> ЗНАЧЕНИЕ(Перечисление.ТипыОбъектовРасчетов.ПлатежВозврат)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыПоДокументам.АналитикаУчетаПоПартнерам     КАК АналитикаУчетаПоПартнерам,
	|		РасчетыПоДокументам.ОбъектРасчетов                КАК ОбъектРасчетов,
	|		РасчетыПоДокументам.Валюта                        КАК Валюта,
	|		РасчетыПоДокументам.ДокументРегистратор           КАК ДокументРегистратор,
	|		РасчетыПоДокументам.РасчетныйДокумент             КАК РасчетныйДокумент,
	|		ВЫБОР КОГДА РасчетыПоДокументам.Предоплата <> 0 И РасчетыПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И РасчетыПоДокументам.ХозяйственнаяОперация НЕ В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности),
	|					ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности))
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаПоставщику)
	|			КОГДА РасчетыПоДокументам.Долг <> 0 И РасчетыПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И РасчетыПоДокументам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности)
	|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПогашениеЗадолженностиПоставщику)
	|			ИНАЧЕ РасчетыПоДокументам.ХозяйственнаяОперация 
	|		КОНЕЦ КАК ХозяйственнаяОперация,
	|		РасчетыПоДокументам.Период                        КАК Период,
	|		РасчетыПоДокументам.ДатаПлановогоПогашения        КАК ДатаПлановогоПогашения,
	|		РасчетыПоДокументам.ДатаВозникновения             КАК ДатаВозникновения,
	|		РасчетыПоДокументам.ВидДвижения                   КАК ВидДвижения,
	|		РасчетыПоДокументам.Предоплата                    КАК Предоплата,
	|		РасчетыПоДокументам.ПредоплатаУпр                 КАК ПредоплатаУпр,
	|		РасчетыПоДокументам.ПредоплатаРегл                КАК ПредоплатаРегл,
	|		РасчетыПоДокументам.Долг                          КАК Долг,
	|		РасчетыПоДокументам.ДолгУпр                       КАК ДолгУпр,
	|		РасчетыПоДокументам.ДолгРегл                      КАК ДолгРегл,
	|		ВЫБОР КОГДА (РасчетыПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И РасчетыПоДокументам.Предоплата > 0)
	|			ИЛИ (РасчетыПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И РасчетыПоДокументам.Долг > 0)
	|			ТОГДА РасчетыПоДокументам.СвязанныйДокумент
	|			ИНАЧЕ Неопределено
	|		КОНЕЦ                                             КАК СвязанныйДокумент,
	|		РасчетыПоДокументам.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|		РасчетыПоДокументам.ПорядокОперации               КАК ПорядокОперации,
	|		РасчетыПоДокументам.ПорядокЗачета                 КАК ПорядокЗачета,
	|		РасчетыПоДокументам.ВалютаДокумента               КАК ВалютаДокумента,
	|		РасчетыПоДокументам.АналитикаУчетаПоПартнерам.Организация КАК Организация
	|	ИЗ ВтРасчеты КАК РасчетыПоДокументам) КАК Расчеты
	|СГРУППИРОВАТЬ ПО
	|	Расчеты.АналитикаУчетаПоПартнерам,
	|	Расчеты.ОбъектРасчетов,
	|	Расчеты.Валюта,
	|	Расчеты.ДокументРегистратор,
	|	Расчеты.РасчетныйДокумент,
	|	Расчеты.ХозяйственнаяОперация,
	|	Расчеты.Период,
	|	Расчеты.ДатаПлановогоПогашения,
	|	Расчеты.ДатаВозникновения,
	|	Расчеты.ВидДвижения,
	|	Расчеты.СвязанныйДокумент,
	|	Расчеты.СтатьяДвиженияДенежныхСредств,
	|	Расчеты.ПорядокОперации,
	|	Расчеты.ПорядокЗачета,
	|	Расчеты.ВалютаДокумента,
	|	Расчеты.Организация
	|";
	
КонецФункции

Процедура ОтметитьКПереносу(НаборЗаписей) Экспорт
	
	ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
	КолонкаЗаказа = "ОбъектРасчетов";
	Если ТипЗнч(НаборЗаписей) = Тип("РегистрНакопленияНаборЗаписей.РасчетыСПоставщиками") Тогда
		ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком;
		КолонкаЗаказа = "ОбъектРасчетов";
	КонецЕсли;
	
	Расчеты = НаборЗаписей.Выгрузить();
	КолонкаОбъектРасчетов = Расчеты.Колонки.Найти(КолонкаЗаказа);
	КолонкаОбъектРасчетов.Имя = "ОбъектРасчетов";
	
	КолонкаДокумент = Расчеты.Колонки.Найти("Регистратор");
	КолонкаДокумент.Имя = "Документ";
	
	КолонкаДатаПересчета = Расчеты.Колонки.Найти("ДатаРегистратора");
	КолонкаДатаПересчета.Имя = "ДатаПересчета";
	
	Для Каждого Аналитика Из Расчеты Цикл
		Аналитика.ДатаПересчета = НачалоДня(Аналитика.ДатаПересчета);
	КонецЦикла;
	
	Расчеты.Свернуть("ОбъектРасчетов,АналитикаУчетаПоПартнерам,Валюта,ДатаПересчета,Документ");
	Расчеты.Колонки.Добавить("ТипРасчетов");
	Расчеты.ЗаполнитьЗначения(ТипРасчетов, "ТипРасчетов");
	
	Для Каждого Аналитика Из Расчеты Цикл
		
		Набор = РегистрыСведений.ЗаданияКРаспределениюРасчетов.СоздатьНаборЗаписей();
		Набор.Отбор.ТипРасчетов.Установить(Аналитика.ТипРасчетов);
		Набор.Отбор.АналитикаУчетаПоПартнерам.Установить(Аналитика.АналитикаУчетаПоПартнерам);
		Набор.Отбор.ОбъектРасчетов.Установить(Аналитика.ОбъектРасчетов);
		Набор.Отбор.Валюта.Установить(Аналитика.Валюта);
		ЗаполнитьЗначенияСвойств(Набор.Добавить(), Аналитика);
		Набор.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтметитьВыполнениеПереноса(Отбор, ВсеДатыПересчета = Ложь)
	
	Набор = РегистрыСведений.ЗаданияКРаспределениюРасчетов.СоздатьНаборЗаписей();
	Набор.Отбор.ТипРасчетов.Установить(Отбор.ТипРасчетов);
	Набор.Отбор.АналитикаУчетаПоПартнерам.Установить(Отбор.АналитикаУчетаПоПартнерам);
	Набор.Отбор.ОбъектРасчетов.Установить(Отбор.ОбъектРасчетов);
	Набор.Отбор.Валюта.Установить(Отбор.Валюта);
	Если НЕ ВсеДатыПересчета Тогда
		Набор.Отбор.ДатаПересчета.Установить(Дата('00010101'));
	КонецЕсли;
	
	Набор.Записать();
	
КонецПроцедуры

Процедура ОжидатьЗавершениеВсехПотоков(Потоки, КоличествоОбработанныхЗаписей = 0)
	
	Пока Потоки.Количество() > 0 Цикл
		Если НЕ ЗавершитьПотокиВыполнившиеФЗ(Потоки, КоличествоОбработанныхЗаписей) Тогда
			ОжидатьЗавершениеПотока(Потоки[0]);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ЗавершитьПотокиВыполнившиеФЗ(Потоки, КоличествоОбработанныхЗаписей = 0)
	
	ЕстьЗавершенныеПотоки = Ложь;
	
	Индекс = Потоки.Количество() - 1;
	Пока Индекс >= 0 Цикл
		Поток = Потоки[Индекс];
		ИдентификаторЗадания = Поток.ИдентификаторЗадания;
		
		Если ИдентификаторЗадания <> Неопределено Тогда
			ЗаданиеВыполнено = ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
		КонецЕсли;
		
		Если ИдентификаторЗадания = Неопределено ИЛИ ЗаданиеВыполнено Тогда
			Если ЗначениеЗаполнено(Поток.АдресРезультата) Тогда
				Результат = ПолучитьИзВременногоХранилища(Поток.АдресРезультата);
				Если Результат <> Неопределено Тогда
					КоличествоОбработанныхЗаписей = КоличествоОбработанныхЗаписей + Результат.КоличествоОбработанныхЗаписей;
				КонецЕсли;
				УдалитьИзВременногоХранилища(Поток.АдресРезультата);
			КонецЕсли;
			Потоки.Удалить(Индекс);
			ЕстьЗавершенныеПотоки = Истина;
		КонецЕсли;
		
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Возврат ЕстьЗавершенныеПотоки;
	
КонецФункции

Функция ОжидатьЗавершениеПотока(Поток, Длительность = 1)
	
	Если Поток <> Неопределено И Поток.ИдентификаторЗадания <> Неопределено Тогда
		Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Поток.ИдентификаторЗадания);
		
		Если Задание <> Неопределено Тогда
			Попытка
				Задание.ОжидатьЗавершенияВыполнения(Длительность);
				Возврат Истина;
			Исключение
				// Специальная обработка не требуется, возможно исключение вызвано истечением времени ожидания.
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ВыбратьДанныеДляПотока(ДанныеКОбработке, РазмерПорции, КоличествоПотоков)
	
	ДанныеПотока = ДанныеКОбработке.СкопироватьКолонки();
	Индекс = 0;
	Пока ДанныеПотока.Количество() < РазмерПорции И ДанныеКОбработке.Количество() > 0 Цикл
		Запись = ДанныеКОбработке[Индекс];
		ЗаполнитьЗначенияСвойств(ДанныеПотока.Добавить(), Запись);
		ДанныеКОбработке.Удалить(Запись);
		Индекс = Индекс + КоличествоПотоков;
		Если Индекс >= ДанныеКОбработке.Количество() Тогда
			Индекс = 0;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДанныеПотока;
	
КонецФункции

Функция ДанныеДляОбработки(ПоследняяЗапись = Неопределено, РазмерПорции = Неопределено, ВсеДатыПересчета = Ложь)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	РегистрПерехода.ТипРасчетов КАК ТипРасчетов,
	|	РегистрПерехода.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РегистрПерехода.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РегистрПерехода.Валюта КАК Валюта,
	|	МИНИМУМ(РегистрПерехода.ДатаПересчета) КАК ДатаПересчета,
	|	СУММА(РегистрПерехода.КоличествоДокументов) КАК КоличествоДокументов
	|ИЗ
	|	РегистрСведений.ЗаданияКРаспределениюРасчетов КАК РегистрПерехода
	|ГДЕ
	|	РегистрПерехода.Обработка = 0
	|	И (РегистрПерехода.ДатаПересчета = ДАТАВРЕМЯ(1,1,1) ИЛИ &ВсеДатыПересчета)
	|	И (РегистрПерехода.КоличествоДокументов <= &КоличествоДокументов ИЛИ &КоличествоДокументов = 0)
	|	И (РегистрПерехода.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
	|			И РегистрПерехода.ОбъектРасчетов > &ОбъектРасчетов
	|		ИЛИ РегистрПерехода.АналитикаУчетаПоПартнерам > &АналитикаУчетаПоПартнерам
	|		ИЛИ &БезАналитики)
	|
	|СГРУППИРОВАТЬ ПО
	|	РегистрПерехода.ТипРасчетов,
	|	РегистрПерехода.АналитикаУчетаПоПартнерам,
	|	РегистрПерехода.ОбъектРасчетов,
	|	РегистрПерехода.Валюта,
	|	РегистрПерехода.Приоритет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет ВОЗР,
	|	КоличествоДокументов УБЫВ,
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов";
	
	Если РазмерПорции = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, " ПЕРВЫЕ 1000", "");
	КонецЕсли;
	
	КоличествоКОбработке = Формат(РазмерПорции, "ЧН=0; ЧГ=0");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "1000", КоличествоКОбработке);
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ВсеДатыПересчета", ВсеДатыПересчета);
	Запрос.УстановитьПараметр("КоличествоДокументов", 0);
	Запрос.УстановитьПараметр("ТипыПлатежныхДокументов", ТипыПлатежныхДокументов());
	Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам", Неопределено);
	Запрос.УстановитьПараметр("ОбъектРасчетов", Неопределено);
	Запрос.УстановитьПараметр("БезАналитики", Истина);
	Если ПоследняяЗапись <> Неопределено Тогда
		Запрос.УстановитьПараметр("КоличествоДокументов", ПоследняяЗапись.КоличествоДокументов);
		Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам", ПоследняяЗапись.АналитикаУчетаПоПартнерам);
		Запрос.УстановитьПараметр("ОбъектРасчетов", ПоследняяЗапись.ОбъектРасчетов);
		Запрос.УстановитьПараметр("БезАналитики", НЕ ЗначениеЗаполнено(ПоследняяЗапись.АналитикаУчетаПоПартнерам));
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Возврат Выборка;
	
КонецФункции

Функция НовоеОписаниеПотока(ИмяМетода = "")
	
	Возврат Новый Структура("ИдентификаторЗадания,Процедура,АдресРезультата", Неопределено, ИмяМетода, Неопределено);
	
КонецФункции

Функция НовыйКурсор()
	
	ПоследняяЗапись = Новый Структура("КоличествоДокументов,АналитикаУчетаПоПартнерам,ОбъектРасчетов");
	ПоследняяЗапись.КоличествоДокументов = 0;
	
	Возврат ПоследняяЗапись;
	
КонецФункции

Функция РазмерПорцииПереносаВОдномПотоке()
	
	Возврат 1000;
	
КонецФункции

Функция КоличествоПотоковПереходаНаОнлайнВзаиморасчеты() Экспорт
	
	Количество = Константы.КоличествоПотоковПереходаНаОнлайнВзаиморасчеты.Получить();
	Если Количество = 0 Тогда
		Количество = 8;
	КонецЕсли;
	Возврат Количество;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ВспомогательныеФункции

//Возвращает таблицу объектов расчетов по которым есть движения по ресурсам "Сумма", "КОплате", "КОтгрузке"
//
// Параметры:
//	- Период - Дата - Необязательный, дата, после которой искать движения по регистрам.
//	
//	Возвращаемое значение:
//		ТаблицаЗначений - таблица объектов расчетов.
//
Функция ПолучитьВсеОбъекты(Период = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентами.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыСКлиентами.Валюта КАК ВалютаРасчетов,
	|	ИСТИНА КАК ЭтоРасчетыСКлиентами,
	|	МАКСИМУМ(ВЫБОР КОГДА РасчетыСКлиентами.КорОбъектРасчетов = ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ) КАК ПорядокОбработки
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|ГДЕ
	|	(РасчетыСКлиентами.Сумма <> 0 ИЛИ РасчетыСКлиентами.КОплате <> 0 ИЛИ РасчетыСКлиентами.КОтгрузке <> 0)
	|	И РасчетыСКлиентами.Период >= &Период
	|	И РасчетыСКлиентами.Активность
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентами.АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентами.ОбъектРасчетов,
	|	РасчетыСКлиентами.Валюта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщиками.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыСПоставщиками.Валюта КАК ВалютаРасчетов,
	|	ЛОЖЬ КАК ЭтоРасчетыСКлиентами,
	|	МАКСИМУМ(ВЫБОР КОГДА РасчетыСПоставщиками.КорОбъектРасчетов = ЗНАЧЕНИЕ(Справочник.ОбъектыРасчетов.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ)
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|ГДЕ
	|	(РасчетыСПоставщиками.Сумма <> 0 ИЛИ РасчетыСПоставщиками.КОплате <> 0 ИЛИ РасчетыСПоставщиками.КПоступлению <> 0)
	|	И РасчетыСПоставщиками.Период >= &Период
	|	И РасчетыСПоставщиками.Активность
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщиками.ОбъектРасчетов,
	|	РасчетыСПоставщиками.Валюта
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПорядокОбработки
	|";
	Запрос.УстановитьПараметр("Период", ?(Период = Неопределено,Дата(1,1,1),Период));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

//Для целей сортировки документов в пределах 1 секунды.
Функция ВидТипДокумента(ТипДокумента, ВидДвижения=Неопределено) Экспорт
	
	//	При добавлении документа - добавить в конец с новым номером, не меняя типы других документов.
	
	Вид = "";
	
	Если ТипДокумента = Тип("ДокументСсылка.РасчетКурсовыхРазниц") ИЛИ ТипДокумента = Тип("ДокументСсылка.РегистраторРасчетов")Тогда
		Вид="9"; Тип="99";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
		Вид="2"; Тип="01";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Вид="1"; Тип="14";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Вид="1"; Тип="16";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Вид="2"; Тип="39";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		Вид="2"; Тип="35";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
		Вид="2"; Тип="02";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") Тогда
		Вид="4"; Тип="41";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОперацияПоПлатежнойКарте") Тогда
		Вид="4"; Тип="22";
	//++ Локализация
	//-- Локализация
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Тогда
		Вид="4"; Тип="33";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВводОстатков")
		Или ТипДокумента = Тип("ДокументСсылка.ВводОстатковВзаиморасчетов") Тогда
		Вид="2"; Тип="03";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВзаимозачетЗадолженности") Тогда
		Вид="4"; Тип="04";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровМеждуОрганизациями") Тогда
		//По клиентам всегда расход.
		Если ВидДвижения = ВидДвиженияНакопления.Приход Тогда
			Вид="5"; Тип="07";
		Иначе
			Вид="6"; Тип="07";
		КонецЕсли;
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") Тогда
		Вид="4"; Тип="06";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		Если ВидДвижения = ВидДвиженияНакопления.Приход Тогда
			Вид="5"; Тип="07";
		Иначе
			Вид="6"; Тип="07";
		КонецЕсли;
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВыкупВозвратнойТарыКлиентом") Тогда
		Вид="2"; Тип="09";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВыкупВозвратнойТарыУПоставщика") Тогда
		Вид="2"; Тип="10";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ГрафикИсполненияДоговора") Тогда
		Вид="1"; Тип="12";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента") Тогда
		Вид="1"; Тип="17";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		Вид="1"; Тип="18";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КорректировкаПриобретения") Тогда
		Вид="3"; Тип="19";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		Вид="3"; Тип="20";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КорректировкаРегистров") Тогда
		Вид="1"; Тип="21";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
		Вид="2"; Тип="25";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомиссионераОСписании") Тогда
		Вид="2"; Тип="26";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
		Вид="2"; Тип="27";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомитентуОСписании") Тогда
		Вид="2"; Тип="28";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетПоКомиссииМеждуОрганизациями") Тогда
		Вид="2"; Тип="30";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетПоКомиссииМеждуОрганизациямиОСписании") Тогда
		Вид="2"; Тип="31";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") Тогда
		Вид="2"; Тип="32";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов") Тогда
		Вид="2"; Тип="36";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		Вид="4"; Тип="37";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		Вид="4"; Тип="38";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияУслугПрочихАктивов") Тогда
		Вид="2"; Тип="40";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СписаниеЗадолженности") Тогда
		Вид="4"; Тип="42";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ТаможеннаяДекларацияИмпорт") Тогда
		Вид="2"; Тип="43";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВыкупПринятыхНаХранениеТоваров") Тогда
		Вид="2"; Тип="11";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ВыкупТоваровХранителем") Тогда
		Вид="2"; Тип="45";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СписаниеПринятыхНаХранениеТоваров") Тогда
		Вид="2"; Тип="46";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомитентуОЗакупках") Тогда
		Вид="2"; Тип="47";
	КонецЕсли;
	
	Если Вид = "" Тогда
		
		ПодробноеПредставлениеОшибки = СтрЗаменить(
			НСтр("ru='Не определен порядок типа документа %1 в ""ОперативныеВзаиморасчетыСервер.ВидТипДокумента"".';uk='Не визначено порядок типу документа %1 в ""ОперативныеВзаиморасчетыСервер.ВидТипДокумента"".'"),
			"%1",
			ТипДокумента);
			
		ЗаписьЖурналаРегистрации(НСтр("ru='Оперативные взаиморасчеты с контрагентами';uk='Оперативні взаєморозрахунки з контрагентами'",ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки);
			
		ВызватьИсключение ПодробноеПредставлениеОшибки;
		
	Иначе
		Возврат Новый Структура("Вид,Тип",Вид,Тип);
	КонецЕсли;
	
КонецФункции

//Возвращает структуру данных реализации для передачи между служебными процедурами.
//
// Возвращаемое значение:
//	Структура - структура данных реализации.
//		* СуммаОстаток для корректировок - при первом упоминании формируется запись с первоначальной суммой, далее из нее вычитаются оплаты и корректировки.
//		* Остальные суммы для расчета среднего курса и, наверное, формирования движений по Суммам документов в валюте регл.
//		* ИндексРасходПланОплаты - Индекс последней записи с расходом по плану оплаты.
//			Так как реализация может двигаться несколькими строками возможна ситуация,
//			когда одна строка реализации закроет часть плановой оплаты, а потом другая строка закроет еще часть той же строки плановой оплаты
//			образуются неуникальные строки в наборе записей.
Функция СтруктураСумм(СуммаДокумента = 0, СуммаДокументаРегл = 0, СуммаДокументаУпр = 0)
	СтруктураСумм = Новый Структура;
	СтруктураСумм.Вставить("СуммаДокумента", СуммаДокумента);
	СтруктураСумм.Вставить("СуммаДокументаРегл", СуммаДокументаРегл);
	СтруктураСумм.Вставить("СуммаДокументаУпр", СуммаДокументаУпр);
	СтруктураСумм.Вставить("ИндексРасходПланОплаты", -1);
	Возврат СтруктураСумм;
КонецФункции

//Типы регистраторов, которые двигают план оплат, отгрузок и поставок в приход.
Функция СписокТиповРегистраторовПланов() Экспорт
	СписокТиповРегистраторовПланов = Новый СписокЗначений;
	СписокТиповРегистраторовПланов.Добавить(Тип("ДокументСсылка.ЗаказКлиента"));
	СписокТиповРегистраторовПланов.Добавить(Тип("ДокументСсылка.ЗаказПоставщику"));
	СписокТиповРегистраторовПланов.Добавить(Тип("ДокументСсылка.ЗаявкаНаВозвратТоваровОтКлиента"));
	СписокТиповРегистраторовПланов.Добавить(Тип("ДокументСсылка.ГрафикИсполненияДоговора"));
	Возврат СписокТиповРегистраторовПланов;
КонецФункции

//Очищает переданный регистр расчетов с флагом ОбменДанными.Загрузка.
Процедура ОчиститьРегистр(Регистр) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления."+Регистр+" КАК Расчеты
	|ГДЕ
	|	НЕ Расчеты.Регистратор ССЫЛКА Документ.КорректировкаРегистров";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыНакопления[Регистр].СоздатьНаборЗаписей(); // РегистрНакопленияНаборЗаписей
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.ОбменДанными.Загрузка = ИСТИНА;
		НаборЗаписей.Записать();
	КонецЦикла;
	
КонецПроцедуры

//Типы платежных документов, для отбора при первичном заполнении регистров расчетов.
Функция ТипыПлатежныхДокументов() Экспорт
	Массив = Новый Массив;
	Массив.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));
	Массив.Добавить(Тип("ДокументСсылка.ВозвратТоваровМеждуОрганизациями"));
	Массив.Добавить(Тип("ДокументСсылка.ВозвратТоваровОтКлиента"));
	Массив.Добавить(Тип("ДокументСсылка.ВозвратТоваровПоставщику"));
	Массив.Добавить(Тип("ДокументСсылка.ОперацияПоПлатежнойКарте"));
	//++ Локализация
	//-- Локализация
	Массив.Добавить(Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств"));
	Массив.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
	Массив.Добавить(Тип("ДокументСсылка.РасходныйКассовыйОрдер"));
	Массив.Добавить(Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств"));
	Возврат Массив;
КонецФункции

//Типы первичных документов ввода остатков, для отбора при первичном заполнении регистров расчетов.
Функция ТипыПервичногоДокументаПлатежки() Экспорт
	Массив = Новый Массив;
	Массив.Добавить(Перечисления.ТипыПервичныхДокументов.ОплатаОтКлиента);
	Массив.Добавить(Перечисления.ТипыПервичныхДокументов.ОплатаПоставщику);
	Возврат Массив;
КонецФункции

//Для данных хоз операций не будет сформирована двойная запись в регистрах расчетов по срокам.
Функция ХозяйственныеОперацииНеОтгрузка() Экспорт
	Массив = Новый Массив;
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВзаимозачетЗадолженности);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровПоставщику);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВозвратТоваровМеждуОрганизациями);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.РезервированиеАвансаКлиента);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ПереносАванса);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиентуНаПлатежнуюКарту);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОплатыНаПлатежнуюКарту);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию);
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтДругойОрганизации);
	Возврат Массив;
КонецФункции

//По данным хоз. операциям суммы в валюте регламентированного и управленческого учета не будут пересчитаны с учетом авансов.
Функция НепересчитываемыеХозяйственныеОперации() Экспорт
	Массив = Новый Массив;
	Массив.Добавить(Перечисления.ХозяйственныеОперации.ВзаимозачетЗадолженности);
	Возврат Массив;
КонецФункции

//Очищает все новые регистры расчетов.
Процедура ОчиститьРегистрыВзаиморасчетов() Экспорт
	
	ОчиститьРегистр("РасчетыСКлиентамиПоСрокам");
	ОчиститьРегистр("РасчетыСКлиентамиПланОплат");
	ОчиститьРегистр("РасчетыСКлиентамиПланОтгрузок");
	ОчиститьРегистр("РасчетыСПоставщикамиПоСрокам");
	ОчиститьРегистр("РасчетыСПоставщикамиПланОплат");
	ОчиститьРегистр("РасчетыСПоставщикамиПланПоставок");
	
	Выборка = Документы.РегистраторРасчетов.Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ОбменДанными.Загрузка = ИСТИНА;
		ДокументОбъект.Удалить();
	КонецЦикла;
	
КонецПроцедуры

//Возвращает движения документов Реализация товаров и услуг с хоз. операцией Товары в пути к движениям,
//пригодным для офлайн взаиморасчетов.
//
Процедура ВернутьДвиженияПоРасчетамСКлиентами()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	РасчетыСКлиентами.Регистратор                  КАК Регистратор,
	|	МАКСИМУМ(РасчетыСКлиентами.Период)             КАК МаксимальныйПериод
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами КАК РасчетыСКлиентами
	|ГДЕ
	|	РасчетыСКлиентами.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РезервированиеАвансаКлиента),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияОСсОтложеннымПереходомПрав),
	|												ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности))
	|	И ТИПЗНАЧЕНИЯ(РасчетыСКлиентами.Регистратор) В (ТИП(Документ.РеализацияТоваровУслуг),
	|													ТИП(Документ.РеализацияУслугПрочихАктивов))
	|	И РасчетыСКлиентами.Сумма <> 0
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентами.Регистратор
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РасчетыСКлиентами.Период) > 1");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыНакопления.РасчетыСКлиентами.СоздатьНаборЗаписей();
		НаборЗаписей.ОбменДанными.Загрузка = ИСТИНА;
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			Если Запись.Сумма <> 0 Тогда
				Запись.Период = Выборка.МаксимальныйПериод;
			КонецЕсли;
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла;
КонецПроцедуры

//Количество одновременно записываемых записей регистров под одним служебным документом регистратором.
Функция РазмерПорцииЗаписи()
	Возврат 1000;
КонецФункции

Процедура ЗаписатьПорционно(СтруктураПараметровРегистраторов, ТаблицаЗаписей, НаборЗаписей) 
	
	РазмерПорцииЗаписи = РазмерПорцииЗаписи();
	
	МассивСвободныхРегистраторов = СвободныеРегистраторыРасчетов(СтруктураПараметровРегистраторов, НаборЗаписей.Метаданные().Имя, ТаблицаЗаписей.Количество());
	МассивЗадействованныхРегистраторов = Новый Массив;
	
	Если МассивСвободныхРегистраторов.Количество() > 0 Тогда
		
		счСтрок = 1;
		счРегистраторов = 0;
		
		МассивСвободныхРегистраторов[счРегистраторов].ТребуетсяОчистка = Ложь;
		МассивЗадействованныхРегистраторов.Добавить(МассивСвободныхРегистраторов[счРегистраторов].Ссылка);
		
		Для Каждого Строка Из ТаблицаЗаписей Цикл
			Если ТипЗнч(Строка.ДокументРегистратор) = Тип("ДокументСсылка.КорректировкаРегистров") Тогда
				Продолжить;
			КонецЕсли;
			Если счСтрок > РазмерПорцииЗаписи Тогда
				счСтрок = 1;
				счРегистраторов = счРегистраторов + 1;
				МассивСвободныхРегистраторов[счРегистраторов].ТребуетсяОчистка = Ложь;
				МассивЗадействованныхРегистраторов.Добавить(МассивСвободныхРегистраторов[счРегистраторов].Ссылка);
			КонецЕсли;
			Строка.Регистратор = МассивСвободныхРегистраторов[счРегистраторов].Ссылка;
			счСтрок = счСтрок + 1;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого РегистраторРасчетов Из МассивЗадействованныхРегистраторов Цикл
		
		НаборЗаписей.Отбор.Регистратор.Установить(РегистраторРасчетов);
		НаборЗаписей.Загрузить(ТаблицаЗаписей.Скопировать(Новый Структура("Регистратор", РегистраторРасчетов)));
		
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	Для Каждого СтрокаСвободныхРегистраторов Из МассивСвободныхРегистраторов Цикл
		
		Если СтрокаСвободныхРегистраторов.ТребуетсяОчистка Тогда
			НаборЗаписей.Отбор.Регистратор.Установить(СтрокаСвободныхРегистраторов.Ссылка);
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьНеиспользуемыеРегистраторыРасчетов(Запрос, ИмяРегистраРасчетов, ИмяРегистраПланаОплат, ИмяРегистраПланаОтгрузкиПоставки)
	
	Запрос.Текст = "
	|
	|ВЫБРАТЬ
	|	РегистраторРасчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РегистраторРасчетов КАК РегистраторРасчетов
	|ГДЕ            
	|	РегистраторРасчетов.ОбъектРасчетов              = &ОбъектРасчетов
	|	И РегистраторРасчетов.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
	|	И РегистраторРасчетов.Валюта                    = &ВалютаРасчетов
	|	И РегистраторРасчетов.ТипРасчетов               = &ТипРасчетов
	|	И НЕ ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			РегистрНакопления.%ИмяРегистраПланаОплат% КАК РасчетыПланОплат
	|		ГДЕ
	|			РасчетыПланОплат.Регистратор = РегистраторРасчетов.Ссылка
	|	)
	|	И НЕ ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			РегистрНакопления.%ИмяРегистраПланаОтгрузкиПоставки% КАК РасчетыПланОтгрузокПоставок
	|		ГДЕ
	|			РасчетыПланОтгрузокПоставок.Регистратор = РегистраторРасчетов.Ссылка
	|	)
	|	И НЕ ИСТИНА В (
	|		ВЫБРАТЬ ПЕРВЫЕ 1
	|			ИСТИНА
	|		ИЗ
	|			РегистрНакопления.%ИмяРегистраРасчетов% КАК РасчетыПоСрокам
	|		ГДЕ
	|			РасчетыПоСрокам.Регистратор = РегистраторРасчетов.Ссылка
	|	)
	|	
	|";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИмяРегистраРасчетов%", ИмяРегистраРасчетов);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИмяРегистраПланаОтгрузкиПоставки%", ИмяРегистраПланаОтгрузкиПоставки);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"%ИмяРегистраПланаОплат%", ИмяРегистраПланаОплат);
	
	ВыборкаДокументов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДокументов.Следующий() Цикл
		ДокументОбъект = ВыборкаДокументов.Ссылка.ПолучитьОбъект();
		ДокументОбъект.Удалить();
	КонецЦикла;
	
КонецПроцедуры

Процедура РассчитатьВсе(ПараметрыВыполнения, АдресХранилища) Экспорт
	
	РаспределениеВзаиморасчетовВызовСервера.РаспределитьВсеРасчетыСКлиентами(ПараметрыВыполнения.ОкончаниеПериодаРасчета, Неопределено);
	РаспределениеВзаиморасчетовВызовСервера.РаспределитьВсеРасчетыСПоставщиками(ПараметрыВыполнения.ОкончаниеПериодаРасчета, Неопределено);
	
КонецПроцедуры

Функция КорректировкаРегистров(ПериодКорректировки, Организация, Операция) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КорректировкаРегистров.Ссылка КАК Ссылка,
	|	КорректировкаРегистров.Дата КАК Дата
	|ИЗ
	|	Документ.КорректировкаРегистров КАК КорректировкаРегистров
	|ГДЕ
	|	КорректировкаРегистров.Дата >= &Дата
	|	И КорректировкаРегистров.Операция = &Операция
	|	И КорректировкаРегистров.Организация = &Организация
	|УПОРЯДОЧИТЬ ПО
	|	КорректировкаРегистров.Дата ВОЗР";
	Запрос.УстановитьПараметр("Дата", КонецМесяца(ПериодКорректировки));
	Запрос.УстановитьПараметр("Операция", Операция);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	КорректировкаОбъект = Неопределено;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект(); // ДокументОбъект.КорректировкаРегистров
		Для Каждого Регистр Из ДокументОбъект.ТаблицаРегистров Цикл
			Движения = ДокументОбъект.Движения[Регистр.Имя]; // РегистрНакопленияНаборЗаписей
			Движения.Записать();
		КонецЦикла;
		
		Если Выборка.Дата = КонецМесяца(ПериодКорректировки) Тогда
			КорректировкаОбъект = ДокументОбъект;
			КорректировкаОбъект.УстановитьПометкуУдаления(Ложь);
		Иначе
			ДокументОбъект.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
	Если КорректировкаОбъект = Неопределено Тогда
		КорректировкаОбъект = Документы.КорректировкаРегистров.СоздатьДокумент();
		КорректировкаОбъект.Дата        = ПериодКорректировки;
		КорректировкаОбъект.Операция    = Операция;
		КорректировкаОбъект.Организация = Организация;
		КорректировкаОбъект.УстановитьСсылкуНового(Документы.КорректировкаРегистров.ПолучитьСсылку());
		
		НовСтр = КорректировкаОбъект.ТаблицаРегистров.Добавить();
		НовСтр.Имя = "РасчетыСКлиентамиПоСрокам";
		НовСтр = КорректировкаОбъект.ТаблицаРегистров.Добавить();
		НовСтр.Имя = "РасчетыСПоставщикамиПоСрокам";
		
		КорректировкаОбъект.Записать();
	КонецЕсли;
	
	Возврат КорректировкаОбъект;
	
КонецФункции

Процедура УдалитьСистемныеКорректировкиРегистров(ДатаПересчета, Организация = Неопределено, Операция = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КорректировкаРегистров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КорректировкаРегистров КАК КорректировкаРегистров
	|ГДЕ
	|	КорректировкаРегистров.Дата >= &Дата
	|	И (КорректировкаРегистров.Организация = &Организация ИЛИ &ПоВсемОрганизациям)
	|	И КорректировкаРегистров.Операция В (&Операции)";
	Запрос.УстановитьПараметр("Дата", НачалоДня(ДатаПересчета));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПоВсемОрганизациям", Организация = Неопределено);
	Операции = Новый Массив;
	Если ЗначениеЗаполнено(Операция) Тогда
		Операции.Добавить(Операция);
	Иначе
		Операции.Добавить(Перечисления.ОперацииКорректировкиРегистров.ИсправлениеРазрывовОстатковВзаиморасчетов);
		Операции.Добавить(Перечисления.ОперацииКорректировкиРегистров.ИсправлениеРазвернутогоСальдоВзаиморасчетов);
	КонецЕсли;
	Запрос.УстановитьПараметр("Операции", Операции);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект(); // ДокументОбъект.КорректировкаРегистров
		
		Для Каждого Регистр Из ДокументОбъект.ТаблицаРегистров Цикл
			Движения = ДокументОбъект.Движения[Регистр.Имя]; // РегистрНакопленияНаборЗаписей
			Движения.Записать();
		КонецЦикла;
		
		ДокументОбъект.Удалить();
	КонецЦикла;
	
КонецПроцедуры

Функция ТаблицаИзмененийДляПересчета(МенеджерВременныхТаблиц, ЭтоРасчетыСКлиентами, Регистратор) 
	
	ТипыПлатежныхДокументов = ТипыПлатежныхДокументов();
	ТипыПлатежныхДокументов.Добавить(Тип("ДокументСсылка.ВводОстатков"));
	ТипыПлатежныхДокументов.Добавить(Тип("ДокументСсылка.ПервичныйДокумент"));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	МИНИМУМ(РасчетыСКлиентамиИзменения.ПорядокОперации)            КАК ПорядокОперации,
	|	МИНИМУМ(РасчетыСКлиентамиИзменения.ПорядокЗачетаПоДатеПлатежа) КАК ПорядокЗачетаПоДатеПлатежа,
	|	РасчетыСКлиентамиИзменения.АналитикаУчетаПоПартнерам           КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентамиИзменения.ОбъектРасчетов                      КАК ОбъектРасчетов,
	|	РасчетыСКлиентамиИзменения.ВалютаРасчетов                      КАК ВалютаРасчетов,
	|	РасчетыСКлиентамиИзменения.Документ                            КАК Документ,
	|	РасчетыСКлиентамиИзменения.КорОбъектРасчетов                   КАК КорОбъектРасчетов,
	|	РасчетыСКлиентамиИзменения.Заказ                               КАК Заказ
	|ПОМЕСТИТЬ МинимальныеПорядки
	|ИЗ РасчетыСКлиентамиИзменения КАК РасчетыСКлиентамиИзменения
	|ГДЕ
	|	РасчетыСКлиентамиИзменения.ПорядокОперации <> """"
	|	И РасчетыСКлиентамиИзменения.ПорядокЗачетаПоДатеПлатежа <> """"
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСКлиентамиИзменения.АналитикаУчетаПоПартнерам,
	|	РасчетыСКлиентамиИзменения.ОбъектРасчетов,
	|	РасчетыСКлиентамиИзменения.ВалютаРасчетов,
	|	РасчетыСКлиентамиИзменения.Документ,
	|	РасчетыСКлиентамиИзменения.КорОбъектРасчетов,
	|	РасчетыСКлиентамиИзменения.Заказ
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.ДокументПлан КАК ДокументПлан,
	|	МинимальныеПорядки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	МинимальныеПорядки.ОбъектРасчетов КАК ОбъектРасчетов,
	|	МинимальныеПорядки.ВалютаРасчетов КАК ВалютаРасчетов
	|ПОМЕСТИТЬ ВтДокументыПланаПослеИзменения
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПланОплат КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ МинимальныеПорядки КАК МинимальныеПорядки
	|			ПО Расчеты.ОбъектРасчетов = МинимальныеПорядки.ОбъектРасчетов
	|				И Расчеты.АналитикаУчетаПоПартнерам = МинимальныеПорядки.АналитикаУчетаПоПартнерам
	|				И Расчеты.Валюта = МинимальныеПорядки.ВалютаРасчетов
	|				И Расчеты.ПорядокОперации > МинимальныеПорядки.ПорядокОперации
	|				И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|;
	|ВЫБРАТЬ
	|	МИНИМУМ(ВложенныйЗапрос.ПорядокФакт)      КАК ПорядокФакт,
	|	МИНИМУМ(ВложенныйЗапрос.ПорядокПлан)      КАК ПорядокПлан,
	|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ВложенныйЗапрос.ОбъектРасчетов            КАК ОбъектРасчетов,
	|	ВложенныйЗапрос.ВалютаРасчетов            КАК ВалютаРасчетов,
	|	МАКСИМУМ(ВложенныйЗапрос.КорОбъектРасчетов) КАК КорОбъектРасчетов
	|ИЗ (
	|	//Порядок зачета может быть меньше порядка оплаты только в вводе остатков.
	|	//Порядок операции для не суммовых строк не учитываем.
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоСрокам.ПорядокОперации КАК ПорядокФакт,
	|		""9""                                     КАК ПорядокПлан,
	|		Изменения.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Изменения.ОбъектРасчетов            КАК ОбъектРасчетов,
	|		Изменения.КорОбъектРасчетов         КАК КорОбъектРасчетов,
	|		Изменения.ВалютаРасчетов            КАК ВалютаРасчетов
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ МинимальныеПорядки КАК Изменения
	|				ПО РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам = Изменения.АналитикаУчетаПоПартнерам
	|					И РасчетыСКлиентамиПоСрокам.ОбъектРасчетов = Изменения.ОбъектРасчетов
	|					И РасчетыСКлиентамиПоСрокам.Валюта = Изменения.ВалютаРасчетов
	|					И РасчетыСКлиентамиПоСрокам.РасчетныйДокумент = Изменения.Документ
	|					И РасчетыСКлиентамиПоСрокам.Активность
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		""9""                                      КАК ПорядокФакт,
	|		РасчетыСКлиентамиПланОплат.ПорядокОперации КАК ПорядокПлан,
	|		Изменения.АналитикаУчетаПоПартнерам        КАК АналитикаУчетаПоПартнерам,
	|		Изменения.ОбъектРасчетов                   КАК ОбъектРасчетов,
	|		Изменения.КорОбъектРасчетов                КАК КорОбъектРасчетов,
	|		Изменения.ВалютаРасчетов                   КАК ВалютаРасчетов 
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПланОплат КАК РасчетыСКлиентамиПланОплат
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ МинимальныеПорядки КАК Изменения
	|				ПО РасчетыСКлиентамиПланОплат.АналитикаУчетаПоПартнерам = Изменения.АналитикаУчетаПоПартнерам
	|					И РасчетыСКлиентамиПланОплат.ОбъектРасчетов = Изменения.ОбъектРасчетов
	|					И РасчетыСКлиентамиПланОплат.Валюта = Изменения.ВалютаРасчетов
	|					И РасчетыСКлиентамиПланОплат.ДокументПлан = Изменения.Документ
	|					И РасчетыСКлиентамиПланОплат.Активность
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		""9""                                         КАК ПорядокФакт,
	|		РасчетыСКлиентамиПланОтгрузок.ПорядокОперации КАК ПорядокПлан,
	|		Изменения.АналитикаУчетаПоПартнерам           КАК АналитикаУчетаПоПартнерам,
	|		Изменения.ОбъектРасчетов                      КАК ОбъектРасчетов,
	|		Изменения.КорОбъектРасчетов                   КАК КорОбъектРасчетов,
	|		Изменения.ВалютаРасчетов                      КАК ВалютаРасчетов 
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПланОтгрузок КАК РасчетыСКлиентамиПланОтгрузок
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ МинимальныеПорядки КАК Изменения
	|				ПО РасчетыСКлиентамиПланОтгрузок.АналитикаУчетаПоПартнерам = Изменения.АналитикаУчетаПоПартнерам
	|					И РасчетыСКлиентамиПланОтгрузок.ОбъектРасчетов = Изменения.ОбъектРасчетов
	|					И РасчетыСКлиентамиПланОтгрузок.Валюта = Изменения.ВалютаРасчетов
	|					И РасчетыСКлиентамиПланОтгрузок.ДокументПлан = Изменения.Документ
	|					И РасчетыСКлиентамиПланОтгрузок.Активность
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	//Порядок операции самого документа регистратора, порядок зачета не берется, т.к. может уходить в закрытые периоды (оплата долга).
	|	ВЫБРАТЬ
	|		ВЫБОР КОГДА РасчетыСКлиентамиПоСрокам.ДокументРегистратор ССЫЛКА Документ.ВводОстатков
	|				ИЛИ РасчетыСКлиентамиПоСрокам.ДокументРегистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов
	|			ТОГДА """"
	|			ИНАЧЕ РасчетыСКлиентамиПоСрокам.ПорядокОперации
	|		КОНЕЦ                                     КАК ПорядокФакт,
	|		""9""                                     КАК ПорядокПлан,
	|		Изменения.АналитикаУчетаПоПартнерам       КАК АналитикаУчетаПоПартнерам,
	|		Изменения.ОбъектРасчетов                  КАК ОбъектРасчетов,
	|		Изменения.КорОбъектРасчетов               КАК КорОбъектРасчетов,
	|		Изменения.ВалютаРасчетов                  КАК ВалютаРасчетов
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ МинимальныеПорядки КАК Изменения
	|				ПО РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам = Изменения.АналитикаУчетаПоПартнерам
	|					И РасчетыСКлиентамиПоСрокам.ОбъектРасчетов = Изменения.ОбъектРасчетов
	|					И РасчетыСКлиентамиПоСрокам.Валюта = Изменения.ВалютаРасчетов
	|					И РасчетыСКлиентамиПоСрокам.ДокументРегистратор = Изменения.Документ
	|					И РасчетыСКлиентамиПоСрокам.Активность
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	//Минимальные непустые порядки изменений
	|	ВЫБРАТЬ
	|		Изменения.ПорядокОперации           КАК ПорядокФакт,
	|		Изменения.ПорядокОперации           КАК ПорядокПлан,
	|		Изменения.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Изменения.ОбъектРасчетов            КАК ОбъектРасчетов,
	|		Изменения.КорОбъектРасчетов         КАК КорОбъектРасчетов,
	|		Изменения.ВалютаРасчетов            КАК ВалютаРасчетов
	|	ИЗ
	|		МинимальныеПорядки КАК Изменения
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	//Ищем объекты расчетов для пересчета при изменении КорОбъектаРасчетов.
	|	ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА Изменения.ПорядокОперации <  Изменения.ПорядокЗачетаПоДатеПлатежа
	|				ТОГДА Изменения.ПорядокОперации
	|			ИНАЧЕ Изменения.ПорядокЗачетаПоДатеПлатежа
	|		КОНЕЦ                                    КАК ПорядокФакт,
	|		""9""                                    КАК Порядокплан,
	|		Изменения.АналитикаУчетаПоПартнерам      КАК АналитикаУчетаПоПартнерам,
	|		РасчетыСКлиентамиПоСрокам.ОбъектРасчетов КАК ОбъектРасчетов,
	|		Изменения.КорОбъектРасчетов              КАК КорОбъектРасчетов,
	|		Изменения.ВалютаРасчетов                 КАК ВалютаРасчетов
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ МинимальныеПорядки КАК Изменения
	|				ПО РасчетыСКлиентамиПоСрокам.КорАналитикаУчетаПоПартнерам = Изменения.АналитикаУчетаПоПартнерам
	|					И РасчетыСКлиентамиПоСрокам.КорОбъектРасчетов = Изменения.ОбъектРасчетов
	|					И РасчетыСКлиентамиПоСрокам.Валюта = Изменения.ВалютаРасчетов
	|					И РасчетыСКлиентамиПоСрокам.РасчетныйДокумент = Изменения.Документ
	|					И НЕ РасчетыСКлиентамиПоСрокам.КорОбъектРасчетов = НЕОПРЕДЕЛЕНО
	|					И РасчетыСКлиентамиПоСрокам.Активность
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	//При порядке зачета по плановой дате платежа пересчет необходимо производить с минимальной даты операции
	|	//документов, у которых плановая дата платежа больше изменяемого.
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоСрокам.ПорядокОперации   КАК ПорядокФакт,
	|		""9""                                       КАК ПорядокПлан,
	|		Изменения.АналитикаУчетаПоПартнерам         КАК АналитикаУчетаПоПартнерам,
	|		Изменения.ОбъектРасчетов                    КАК ОбъектРасчетов,
	|		Изменения.КорОбъектРасчетов                 КАК КорОбъектРасчетов,
	|		Изменения.ВалютаРасчетов                    КАК ВалютаРасчетов
	|	ИЗ
	|		МинимальныеПорядки КАК Изменения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ 	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|				ПО РасчетыСКлиентамиПоСрокам.АналитикаУчетаПоПартнерам = Изменения.АналитикаУчетаПоПартнерам
	|					И РасчетыСКлиентамиПоСрокам.ОбъектРасчетов = Изменения.ОбъектРасчетов
	|					И РасчетыСКлиентамиПоСрокам.Валюта = Изменения.ВалютаРасчетов
	|					И РасчетыСКлиентамиПоСрокам.ПорядокЗачета > Изменения.ПорядокЗачетаПоДатеПлатежа
	|					И РасчетыСКлиентамиПоСрокам.Активность
	|	ГДЕ
	|		НЕ &ПорядокЗачетаДокументовПоДатеОперации
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	//При расчетах по договорам и использовании заказов план надо пересчитывать с минимальной даты оплаты заказа.
	|	ВЫБРАТЬ
	|		""9""                                        КАК ПорядокФакт,
	|		ПлановыеОплатыРегистратора.ПорядокОперации   КАК ПорядокПлан,
	|		Изменения.АналитикаУчетаПоПартнерам          КАК АналитикаУчетаПоПартнерам,
	|		Изменения.ОбъектРасчетов                     КАК ОбъектРасчетов,
	|		Изменения.КорОбъектРасчетов                  КАК КорОбъектРасчетов,
	|		Изменения.ВалютаРасчетов                     КАК ВалютаРасчетов
	|	ИЗ
	|		МинимальныеПорядки КАК Изменения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПланОплат КАК ПлановыеОплатыРегистратора
	|				ПО ПлановыеОплатыРегистратора.АналитикаУчетаПоПартнерам = Изменения.АналитикаУчетаПоПартнерам
	|					И ПлановыеОплатыРегистратора.ОбъектРасчетов = Изменения.ОбъектРасчетов
	|					И ПлановыеОплатыРегистратора.Валюта = Изменения.ВалютаРасчетов
	|					И ПлановыеОплатыРегистратора.Активность
	|					И ПлановыеОплатыРегистратора.ДокументРегистратор = Изменения.Заказ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		""9""                                        КАК ПорядокФакт,
	|		Порядки.ПорядокОперации                      КАК ПорядокПлан,
	|		ДокументыПлан.АналитикаУчетаПоПартнерам      КАК АналитикаУчетаПоПартнерам,
	|		ДокументыПлан.ОбъектРасчетов                 КАК ОбъектРасчетов,
	|		Неопределено                                 КАК КорОбъектРасчетов,
	|		ДокументыПлан.ВалютаРасчетов                 КАК ВалютаРасчетов
	|	ИЗ
	|		ВтДокументыПланаПослеИзменения КАК ДокументыПлан
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСКлиентамиПланОплат КАК Порядки
	|				ПО ДокументыПлан.АналитикаУчетаПоПартнерам = Порядки.АналитикаУчетаПоПартнерам
	|					И ДокументыПлан.ОбъектРасчетов = Порядки.ОбъектРасчетов
	|					И ДокументыПлан.ВалютаРасчетов = Порядки.Валюта
	|					И ДокументыПлан.ДокументПлан = Порядки.ДокументПлан
	|	ГДЕ
	|		Порядки.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|) ВложенныйЗапрос
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам,
	|	ВложенныйЗапрос.ОбъектРасчетов,
	|	ВложенныйЗапрос.ВалютаРасчетов
	|УПОРЯДОЧИТЬ ПО
	|	МАКСИМУМ(ВложенныйЗапрос.КорОбъектРасчетов)
	|;
	|УНИЧТОЖИТЬ МинимальныеПорядки
	|;
	|УНИЧТОЖИТЬ ВтДокументыПланаПослеИзменения";
	
	Запрос.УстановитьПараметр("ПорядокЗачетаДокументовПоДатеОперации", Константы.ПорядокЗачетаДокументовПоДатеОперации.Получить() = 0);
	Запрос.УстановитьПараметр("ТипыПлатежныхДокументов", ТипыПлатежныхДокументов);
	Если НЕ ЭтоРасчетыСКлиентами Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РасчетыСКлиентамиИзменения", "РасчетыСПоставщикамиИзменения");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РасчетыСКлиентамиПланОтгрузок", "РасчетыСПоставщикамиПланПоставок");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РасчетыСКлиентамиПланОплат", "РасчетыСПоставщикамиПланОплат");
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"РасчетыСКлиентами", "РасчетыСПоставщиками");
	КонецЕсли;
	
	ТаблицаИзменений = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаИзменений;
	
КонецФункции

#КонецОбласти
