#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
		
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, НСтр("ru='Утверждена';uk='Затверджена'"),  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   НСтр("ru='Действует с';uk='Діє з'"), 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   НСтр("ru='         по';uk='         по'"), 5);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2022МесУФ";
	НоваяФорма.ОписаниеОтчета     = НСтр("ru='Утверждена Приказом Минфина от 26.04.2022 №124 (месячная форма) ';uk= 'Затверджена Наказом Мінфина від 26.04.2022 №124 (місячна форма)'"); 
	НоваяФорма.ДатаНачалоДействия = '2022-04-01';
	НоваяФорма.ДатаКонецДействия  = Неопределено;
	
	Возврат ТаблицаФормОтчета;
	
КонецФункции

Функция ДеревоФормИФорматов() Экспорт
	
	ФормыИФорматы = Новый ДеревоЗначений;
	ФормыИФорматы.Колонки.Добавить("Код");
	ФормыИФорматы.Колонки.Добавить("ДатаПриказа");
	ФормыИФорматы.Колонки.Добавить("НомерПриказа");
	ФормыИФорматы.Колонки.Добавить("ДатаНачалаДействия");
	ФормыИФорматы.Колонки.Добавить("ДатаОкончанияДействия");
	ФормыИФорматы.Колонки.Добавить("ИмяОбъекта");
	ФормыИФорматы.Колонки.Добавить("Описание");          
	//                                                                       //дата приказа    //номер приказа     //имя формы
	//Форма20050401 = ОпределитьФормуВДеревеФормИФорматов(ФормыИФорматы, "", '2003-02-28'		,"98"				,"ФормаОтчета2005Кв2");
	//Форма20120101 = ОпределитьФормуВДеревеФормИФорматов(ФормыИФорматы, "", '2011-12-21'		,"1688"				,"ФормаОтчета2012");
	//Форма20130101 = ОпределитьФормуВДеревеФормИФорматов(ФормыИФорматы, "", '2012-11-07'		,"1159"				,"ФормаОтчета2013");
	
	Возврат ФормыИФорматы;
	
КонецФункции

//Функция ОпределитьФормуВДеревеФормИФорматов(ДеревоФормИФорматов, Код, ДатаПриказа = '00010101', НомерПриказа = "", ИмяОбъекта = "",
//			ДатаНачалаДействия = '00010101', ДатаОкончанияДействия = '00010101', Описание = "")
//	
//	НовСтр = ДеревоФормИФорматов.Строки.Добавить();
//	НовСтр.Код = СокрЛП(Код);
//	НовСтр.ДатаПриказа = ДатаПриказа;
//	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
//	НовСтр.ДатаНачалаДействия = ДатаНачалаДействия;
//	НовСтр.ДатаОкончанияДействия = ДатаОкончанияДействия;
//	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
//	НовСтр.Описание = СокрЛП(Описание);
//	Возврат НовСтр;
//	
//КонецФункции

#КонецЕсли