
&НаКлиенте
Процедура Выбрать(Команда)
	
	Если Элементы.ТаблицаЗначений.ТекущиеДанные = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Код",               Элементы.ТаблицаЗначений.ТекущиеДанные.Код);
	ВозвращаемоеЗначение.Вставить("Название",          Элементы.ТаблицаЗначений.ТекущиеДанные.Название);
	ВозвращаемоеЗначение.Вставить("БазоваяДоходность", Элементы.ТаблицаЗначений.ТекущиеДанные.БазоваяДоходность);
	ВозвращаемоеЗначение.Вставить("Кратко",            Элементы.ТаблицаЗначений.ТекущиеДанные.Кратко);
	
	Закрыть(ВозвращаемоеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Код",               Элементы.ТаблицаЗначений.ТекущиеДанные.Код);
	ВозвращаемоеЗначение.Вставить("Название",          Элементы.ТаблицаЗначений.ТекущиеДанные.Название);
	ВозвращаемоеЗначение.Вставить("БазоваяДоходность", Элементы.ТаблицаЗначений.ТекущиеДанные.БазоваяДоходность);
	ВозвращаемоеЗначение.Вставить("Кратко",            Элементы.ТаблицаЗначений.ТекущиеДанные.Кратко);
	
	Закрыть(ВозвращаемоеЗначение);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = Параметры.Заголовок;
	
	КопироватьДанныеФормы(Параметры.ТаблицаЗначений, ТаблицаЗначений);
	
	ИсходнаяСтрока = ТаблицаЗначений.НайтиСтроки(Параметры.СтруктураДляПоиска);
	
	Если ИсходнаяСтрока.Количество() > 0 Тогда
		Элементы.ТаблицаЗначений.ТекущаяСтрока = ИсходнаяСтрока[0].ПолучитьИдентификатор();
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.НаимКолонкиКод) Тогда
		
		Элементы.ТаблицаЗначенийКод.Заголовок = Параметры.НаимКолонкиКод;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.НаимКолонкиНазвание) Тогда
		
		Элементы.ТаблицаЗначенийНазвание.Заголовок = Параметры.НаимКолонкиНазвание;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.НаимКолонкиКратко) Тогда
		
		Элементы.ТаблицаЗначенийКратко.Заголовок = Параметры.НаимКолонкиКратко;
		
	КонецЕсли;
	
	Элементы.ТаблицаЗначенийКод.Видимость      = НЕ Параметры.ОтключитьВидимостьКолонкиКод;
	Элементы.ТаблицаЗначенийНазвание.Видимость = НЕ Параметры.ОтключитьВидимостьКолонкиНазвание;
	Элементы.ТаблицаЗначенийКратко.Видимость   = Параметры.ВключитьВидимостьКолонкиКратко;
		
КонецПроцедуры