////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен данными"
// ОбщийМодуль.ОбменДаннымиСобытияКлиентСерверУТУП.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Переопределяет форму создаваемого объекта на помощник создания обмена.
Процедура ПриСозданииПланаОбменаОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	ОбменДаннымиВызовСервераУТУП.ПриСозданииПланаОбменаОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти
