
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Макет = ПланыОбмена.ОбменУправлениеТорговлей31Бухгалтерия20.ПолучитьМакет("ПодробнаяИнформация");
	ПолеHTMLДокумента = Макет.ПолучитьТекст();
	
//	Заголовок = НСтр("ru='Информация о синхронизации данных конфигураций Управление торговлей для Украины ред. 3.1 и Бухгалтерия для Украины ред. 2.0';uk='Інформація про синхронізацію даних конфігурацій Управління торгівлею для України ред. 3.1 і Бухгалтерія для України ред. 2.0'");
	Заголовок = НСтр("ru='Информация о синхронизации данных конфигураций BAS Управление торговлей и бухгалтерской программы';uk='Інформація про синхронізації даних конфігурацій BAS Управління торгівлею і бухгалтерської програми'");

КонецПроцедуры
