
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Макет = ПланыОбмена.ОбменУправлениеТорговлейРозница.ПолучитьМакет("ПодробнаяИнформация");
	ПолеHTMLДокумента = Макет.ПолучитьТекст();
	
	Заголовок = НСтр("ru='Информация о синхронизации данных конфигураций BAS Розничная торговля, ред. 2.2 и BAS Управление торговлей, ред. 3.2';uk='Інформація про синхронізацію даних конфігурацій BAS Роздрібна торгівля, ред. 2.2 і BAS Управління торгівлею, ред. 3.2'");

КонецПроцедуры
