
#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый документ.
//  Отказ - Булево - Признак проведения документа.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то проведение документа выполнено не будет.
//  РежимПроведения - РежимПроведенияДокумента - В данный параметр передается текущий режим проведения.
//
Процедура ОбработкаПроведения(Объект, Отказ, РежимПроведения) Экспорт
	
	Движения = Объект.Движения;
	ДополнительныеСвойства = Объект.ДополнительныеСвойства;
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то будет выполнен отказ от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Объект, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект.
//  ДанныеЗаполнения - Произвольный - Значение, которое используется как основание для заполнения.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
Процедура ОбработкаЗаполнения(Объект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//
Процедура ОбработкаУдаленияПроведения(Объект, Отказ) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина,
//                   то запись выполнена не будет и будет вызвано исключение.
//  РежимЗаписи - РежимЗаписиДокумента - В параметр передается текущий режим записи документа. Позволяет определить в теле процедуры режим записи.
//  РежимПроведения - РежимПроведенияДокумента - В данный параметр передается текущий режим проведения.
//
Процедура ПередЗаписью(Объект, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  Отказ - Булево - Признак отказа от записи.
//                   Если в теле процедуры-обработчика установить данному параметру значение Истина, то запись выполнена не будет и будет вызвано исключение.
//
Процедура ПриЗаписи(Объект, Отказ) Экспорт
	
	
КонецПроцедуры

// Вызывается из соответствующего обработчика документа
//
// Параметры:
//  Объект - ДокументОбъект - Обрабатываемый объект
//  ОбъектКопирования - ДокументОбъект.<Имя документа> - Исходный документ, который является источником копирования.
//
Процедура ПриКопировании(Объект, ОбъектКопирования) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// Определяет список команд создания на основании.
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//  Параметры - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.Параметры
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	
КонецПроцедуры

// Добавляет команду создания документа "Авансовый отчет".
//
// Параметры:
//  КомандыСозданияНаОсновании - см. СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании.КомандыСозданияНаОсновании
//
Процедура ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт


КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	
КонецПроцедуры

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	//++ Локализация

	// М-7
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Обработка.ПечатьАктыОРасхождениях";
	КомандаПечати.Идентификатор = "М7_Страница1,М7_Страница2,М7_Страница3,М7_Страница4";
	КомандаПечати.Представление = НСтр("ru='М-7';uk='М-7'");
	КомандаПечати.ДополнительныеПараметры.Вставить("ПечатьВНоменклатуреПоставщика", Ложь);

	Если ПолучитьФункциональнуюОпцию("ИспользоватьНоменклатуруПоставщиков") Тогда
		// М-7 (в номенклатуре поставщика)
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.МенеджерПечати = "Обработка.ПечатьАктыОРасхождениях";
		КомандаПечати.Идентификатор = "М7_Страница1,М7_Страница2,М7_Страница3,М7_Страница4";
		КомандаПечати.Представление = НСтр("ru='М-7 (в номенклатуре поставщика)';uk='М-7 (у номенклатурі постачальника)'");
		КомандаПечати.ДополнительныеПараметры.Вставить("ПечатьВНоменклатуреПоставщика", Истина);
	КонецЕсли;
 

//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область Печать

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
КонецПроцедуры

//++ Локализация
//-- Локализация

#КонецОбласти


#Область ГосИС

//++ Локализация
//-- Локализация

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

// Процедура дополняет тексты запросов проведения документа.
//
// Параметры:
//  Запрос - Запрос - Общий запрос проведения документа.
//  ТекстыЗапроса - СписокЗначений - Список текстов запроса проведения.
//  Регистры - Строка, Структура - Список регистров проведения документа через запятую или в ключах структуры.
//
Процедура ДополнитьТекстыЗапросовПроведения(Запрос, ТекстыЗапроса, Регистры) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ГосИС

//++ Локализация
//-- Локализация

Функция ПолучитьДанныеДляПечатнойФормыМ7(ПараметрыПечати, МассивОбъектов) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст ="
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА АктОРасхожденияхПослеПриемкиТовары.Количество - АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу <> 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ)                                КАК ЕстьРасхождения,
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка КАК АктОРасхождениях
	|ПОМЕСТИТЬ ЕстьРасхожденияПоДокументам
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК АктОРасхожденияхПослеПриемкиТовары
	|ГДЕ
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка В (&МассивОбъектов)
	|
	|СГРУППИРОВАТЬ ПО
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////2
	|ВЫБРАТЬ
	|	АктОРасхожденияхПослеПриемки.Ссылка                                                            КАК Ссылка,
	|	АктОРасхожденияхПослеПриемки.Номер                                                             КАК НомерДокумента,
	|	АктОРасхожденияхПослеПриемки.Дата                                                              КАК ДатаДокумента,
	|	АктОРасхожденияхПослеПриемки.Организация                                                       КАК Организация,
	|	АктОРасхожденияхПослеПриемки.Организация.Префикс                                               КАК Префикс,
	|	АктОРасхожденияхПослеПриемки.Руководитель                                                      КАК Руководитель,
	|	АктОРасхожденияхПослеПриемки.ГлавныйБухгалтер                                                  КАК ГлавныйБухгалтер,
	|	АктОРасхожденияхПослеПриемки.Валюта                                                            КАК Валюта,
	|	АктОРасхожденияхПослеПриемки.ДатаОтправленияТоваров                                            КАК ДатаОтправленияТоваров,
	|	АктОРасхожденияхПослеПриемки.НомерДокументаОВызовеПредставителяПартнера                        КАК НомерДокументаОВызовеПредставителяПартнера,
	|	АктОРасхожденияхПослеПриемки.ДатаДокументаОВызовеПредставителяПартнера                         КАК ДатаДокументаОВызовеПредставителяПартнера,
	|	АктОРасхожденияхПослеПриемки.Грузоотправитель                                                  КАК Грузоотправитель,
	|	АктОРасхожденияхПослеПриемки.Контрагент                                                        КАК Поставщик,
	|	АктОРасхожденияхПослеПриемки.НомерДоговораПоставки                                             КАК НомерДоговораПоставки,
	|	АктОРасхожденияхПослеПриемки.ДатаДоговораПоставки                                              КАК ДатаДоговораПоставки,
	|	АктОРасхожденияхПослеПриемки.НомерКоммерческогоАкта                                            КАК НомерКоммерческогоАкта,
	|	АктОРасхожденияхПослеПриемки.ДатаКоммерческогоАкта                                             КАК ДатаКоммерческогоАкта,
	|	АктОРасхожденияхПослеПриемки.НомерУдостоверенияОКачестве                                       КАК НомерУдостоверенияОКачестве,
	|	АктОРасхожденияхПослеПриемки.ДатаОтправленияТоваров                                            КАК ДатаОтправленияТовара,
	|	АктОРасхожденияхПослеПриемки.СведенияОСостоянииТранспортаПоФакту                               КАК СостояниеТранспортаПоФакту,
	|	АктОРасхожденияхПослеПриемки.УсловияХраненияТовараДоВскрытияНаСкладеПолучателя                 КАК УсловияХраненияТовараДоВскрытия,
	|	АктОРасхожденияхПослеПриемки.СостояниеТарыИУпаковки                                            КАК СостояниеТарыИУпаковки,
	|	АктОРасхожденияхПослеПриемки.ПрочиеДанные                                                      КАК ПрочиеДанные,
	|	АктОРасхожденияхПослеПриемки.ЗаключениеКомиссии                                                КАК ЗаключениеКомиссии,
	|	АктОРасхожденияхПослеПриемки.Приложение                                                        КАК Приложение,
	|	АктОРасхожденияхПослеПриемки.НомерСчетаВходящий                                                КАК НомерСчетаВходящий,
	|	АктОРасхожденияхПослеПриемки.ДатаСчетаВходящий                                                 КАК ДатаСчетаВходящий,
	|	АктОРасхожденияхПослеПриемки.ДатаСопроводительногоТранспортногоДокумента                       КАК ДатаСопроводительногоТранспортногоДокумента,
	|	АктОРасхожденияхПослеПриемки.УсловияХраненияТовараДоВскрытияНаСкладеПолучателя                 КАК УсловияХраненияТовараДоВскрытияНаСкладеПолучателя,
	|	АктОРасхожденияхПослеПриемки.СпособОпределенияИКоличествоТоваровКоторыхНедостаточно            КАК СпособОпределенияИКоличествоТоваровКоторыхНедостаточно,
	|	АктОРасхожденияхПослеПриемки.ДатаПриемкиТоваров КАК ДатаПриемкиТоваров,
	|	АктОРасхожденияхПослеПриемки.МестоСоставленияДокумента КАК МестоСоставленияДокумента,
	|	АктОРасхожденияхПослеПриемки.ВремяНачалоПриемки КАК ВремяНачалоПриемки,
	|	АктОРасхожденияхПослеПриемки.ВремяОкончанияПриемки КАК ВремяОкончанияПриемки,
	|	АктОРасхожденияхПослеПриемки.СтанцияПристаньУдостоверенияОКачестве КАК СтанцияПристаньУдостоверенияОКачестве,
	|	АктОРасхожденияхПослеПриемки.НомерСопроводительногоТранспортногоДокумента КАК НомерСопроводительногоТранспортногоДокумента,
	|	АктОРасхожденияхПослеПриемки.НомераВагоновСопроводительногоТранспортногоДокумента КАК НомераВагоновСопроводительногоТранспортногоДокумента,
	|	АктОРасхожденияхПослеПриемки.ДокументУдостоверяющийПолномочияЧленаКомиссии1 КАК ДокументУдостоверяющийПолномочияЧленаКомиссии1,
	|	АктОРасхожденияхПослеПриемки.ДокументУдостоверяющийПолномочияЧленаКомиссии2 КАК ДокументУдостоверяющийПолномочияЧленаКомиссии2,
	|	АктОРасхожденияхПослеПриемки.ДокументУдостоверяющийПолномочияЧленаКомиссии3 КАК ДокументУдостоверяющийПолномочияЧленаКомиссии3,
	|	АктОРасхожденияхПослеПриемки.КладовщикПринявшийТовар                                           КАК КладовщикПринявшийТовар,
	|	АктОРасхожденияхПослеПриемки.ЧленКомиссии1                                                     КАК ЧленКомиссии1,
	|	АктОРасхожденияхПослеПриемки.ДолжностьЧленаКомиссии1                                           КАК ДолжностьЧленаКомиссии1,
	|	АктОРасхожденияхПослеПриемки.ЧленКомиссии2                                                     КАК ЧленКомиссии2,
	|	АктОРасхожденияхПослеПриемки.ДолжностьЧленаКомиссии2                                           КАК ДолжностьЧленаКомиссии2,
	|	АктОРасхожденияхПослеПриемки.ЧленКомиссии3                                                     КАК ЧленКомиссии3,
	|	АктОРасхожденияхПослеПриемки.ДолжностьЧленаКомиссии3                                           КАК ДолжностьЧленаКомиссии3,
	|	АктОРасхожденияхПослеПриемки.ПриемкаТоваров.(
	|		НомерСтроки КАК НомерСтроки,
	|		ДатаПрибытияВПунктНазначения КАК ДатаПрибытияВПунктНазначения,
	|		ДатаВскрытия КАК ДатаВскрытия,
	|		ДатаВыдачиОрганизациейТранспорта КАК ДатаВыдачи,
	|		ДатаДоставкиНаСкладПолучателя КАК ДатаДоставкиНаСклад
	|	)                                                                                              КАК ТаблицаПриемкиТоваров,
	|	ЛОЖЬ                                                                                           КАК ОшибкаНетРасхождений,
	|	АктОРасхожденияхПослеПриемки.ЦенаВключаетНДС                                                   КАК ЦенаВключаетНДС,
	|	ЕстьРасхожденияПоДокументам.ЕстьРасхождения
	|ИЗ
	|	ЕстьРасхожденияПоДокументам КАК ЕстьРасхожденияПоДокументам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктОРасхожденияхПослеПриемки КАК АктОРасхожденияхПослеПриемки
	|		ПО ЕстьРасхожденияПоДокументам.АктОРасхождениях = АктОРасхожденияхПослеПриемки.Ссылка
	|ГДЕ
	|	АктОРасхожденияхПослеПриемки.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////4
	|ВЫБРАТЬ
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка                            КАК Ссылка,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура                      КАК Номенклатура,
	|	АктОРасхожденияхПослеПриемкиТовары.НоменклатураПоставщика            КАК НоменклатураПоставщика,
	|	АктОРасхожденияхПослеПриемкиТовары.Характеристика                    КАК Характеристика,
	|	АктОРасхожденияхПослеПриемкиТовары.Упаковка                          КАК Упаковка,
	|	АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу             КАК КоличествоПоДокументам,
	|	АктОРасхожденияхПослеПриемкиТовары.Цена                              КАК ЦенаПоДокументам,
	|	АктОРасхожденияхПослеПриемкиТовары.СуммаПоДокументу                  КАК СуммаПоДокументам,
	|	АктОРасхожденияхПослеПриемкиТовары.СтавкаНДС                         КАК СтавкаНДСПоДокументам,
	|	АктОРасхожденияхПослеПриемкиТовары.СуммаНДСПоДокументу               КАК СуммаНДСПоДокументам,
	|	АктОРасхожденияхПослеПриемкиТовары.Количество                        КАК КоличествоПоФакту,
	|	АктОРасхожденияхПослеПриемкиТовары.Цена                              КАК ЦенаПоФакту,
	|	АктОРасхожденияхПослеПриемкиТовары.Сумма                             КАК СуммаПоФакту,
	|	АктОРасхожденияхПослеПриемкиТовары.СтавкаНДС                         КАК СтавкаНДСПоФакту,
	|	АктОРасхожденияхПослеПриемкиТовары.СуммаНДС                          КАК СуммаНДСПоФакту,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.Код                  КАК Код,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.Артикул              КАК Артикул,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.ЕдиницаИзмерения     КАК ЕдиницаИзмерения,
 	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
	|	ВЫБОР
	|		КОГДА АктОРасхожденияхПослеПриемкиТовары.Количество - АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу > 0
	|			ТОГДА АктОРасхожденияхПослеПриемкиТовары.Количество - АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу
	|		ИНАЧЕ 0
	|	КОНЕЦ                                                                КАК КоличествоИзлишек,
	|	ВЫБОР
	|		КОГДА АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу - АктОРасхожденияхПослеПриемкиТовары.Количество > 0
	|			ТОГДА АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу - АктОРасхожденияхПослеПриемкиТовары.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ                                                                КАК КоличествоНедостача,
	|	ВЫБОР
	|		КОГДА АктОРасхожденияхПослеПриемкиТовары.Сумма - АктОРасхожденияхПослеПриемкиТовары.СуммаПоДокументу > 0
	|			ТОГДА АктОРасхожденияхПослеПриемкиТовары.Сумма - АктОРасхожденияхПослеПриемкиТовары.СуммаПоДокументу
	|		ИНАЧЕ 0
	|	КОНЕЦ                                                                КАК СуммаИзлишек,
	|	ВЫБОР
	|		КОГДА АктОРасхожденияхПослеПриемкиТовары.СуммаПоДокументу - АктОРасхожденияхПослеПриемкиТовары.Сумма > 0
	|			ТОГДА АктОРасхожденияхПослеПриемкиТовары.СуммаПоДокументу - АктОРасхожденияхПослеПриемкиТовары.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ                                                                КАК СуммаНедостача,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.НаименованиеПолное   КАК НоменклатураНаименование,
	|	АктОРасхожденияхПослеПриемкиТовары.Характеристика.НаименованиеПолное КАК ХарактеристикаНаименование,
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка.ЦенаВключаетНДС            КАК ЦенаВключаетНДСПоФакту,
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка.ЦенаВключаетНДС            КАК ЦенаВключаетНДСПоДокументам,
	|	АктОРасхожденияхПослеПриемкиТовары.НомерСтроки                       КАК НомерСтроки,
	|	АктОРасхожденияхПослеПриемкиТовары.НомерПаспорта                     КАК НомерПаспорта
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК АктОРасхожденияхПослеПриемкиТовары
	|ГДЕ
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка В(&МассивОбъектов)
	|	И АктОРасхожденияхПослеПриемкиТовары.КоличествоУпаковок <> АктОРасхожденияхПослеПриемкиТовары.КоличествоУпаковокПоДокументу
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////5
	|ВЫБРАТЬ
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка                              КАК Ссылка,
	|	АктОРасхожденияхПослеПриемкиТовары.Упаковка                            КАК Упаковка,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.ЕдиницаИзмерения       КАК ЕдиницаИзмерения,
	|	АктОРасхожденияхПослеПриемкиТовары.Номенклатура.Наименование           КАК НоменклатураНаименование,
	|	АктОРасхожденияхПослеПриемкиТовары.Характеристика.Наименование         КАК ХарактеристикаНаименование,
	|	АктОРасхожденияхПослеПриемкиТовары.НоменклатураПоставщика.Наименование КАК НоменклатураПоставщикаНаименование,
	|	АктОРасхожденияхПослеПриемкиТовары.НомерСтроки                         КАК НомерСтроки
	|ИЗ
	|	Документ.АктОРасхожденияхПослеПриемки.Товары КАК АктОРасхожденияхПослеПриемкиТовары
	|ГДЕ
	|	АктОРасхожденияхПослеПриемкиТовары.Ссылка В(&МассивОбъектов)
	|	И АктОРасхожденияхПослеПриемкиТовары.КоличествоПоДокументу > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////6
	|ВЫБРАТЬ
	|	ПериодыКурсовВалютДокументов.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПериодыКурсовВалютДокументов.Ссылка.Валюта = КурсыВалют.Валюта
	|				ТОГДА ЕСТЬNULL(КурсыВалют.Курс, 1)
	|		КОНЕЦ) КАК КурсВалютыДокумента,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПериодыКурсовВалютДокументов.Ссылка.Валюта = КурсыВалют.Валюта
	|				ТОГДА ЕСТЬNULL(КурсыВалют.Кратность, 1)
	|		КОНЕЦ) КАК КратностьВалютыДокумента,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА &ВалютаРегламентированногоУчета = КурсыВалют.Валюта
	|				ТОГДА ЕСТЬNULL(КурсыВалют.Курс, 1)
	|		КОНЕЦ) КАК КурсВалютыРегламентированногоУчета,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА &ВалютаРегламентированногоУчета = КурсыВалют.Валюта
	|				ТОГДА ЕСТЬNULL(КурсыВалют.Кратность, 1)
	|		КОНЕЦ) КАК КратностьВалютыРегламентированногоУчета,
	|	ВЫБОР
	|		КОГДА &ВалютаРегламентированногоУчета = ПериодыКурсовВалютДокументов.Ссылка.Валюта
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПересчетНеТребуется
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеДокумента.Ссылка КАК Ссылка,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА ДанныеДокумента.Валюта = КурсыВалют.Валюта
	|					ТОГДА КурсыВалют.Период
	|			КОНЕЦ) КАК ПериодВалютаДокумента,
	|		МАКСИМУМ(ВЫБОР
	|				КОГДА &ВалютаРегламентированногоУчета = КурсыВалют.Валюта
	|					ТОГДА КурсыВалют.Период
	|			КОНЕЦ) КАК ПериодВалютаРегламентированногоУчета
	|	ИЗ
	|		Документ.АктОРасхожденияхПослеПриемки КАК ДанныеДокумента
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|			ПО ДанныеДокумента.Дата >= КурсыВалют.Период
	|				И (ДанныеДокумента.Валюта = КурсыВалют.Валюта
	|					ИЛИ &ВалютаРегламентированногоУчета = КурсыВалют.Валюта)
	|	ГДЕ
	|		ДанныеДокумента.Ссылка В(&МассивОбъектов)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ДанныеДокумента.Ссылка) КАК ПериодыКурсовВалютДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО (ПериодыКурсовВалютДокументов.Ссылка.Валюта = КурсыВалют.Валюта
	|					И ПериодыКурсовВалютДокументов.ПериодВалютаДокумента = КурсыВалют.Период
	|				ИЛИ &ВалютаРегламентированногоУчета = КурсыВалют.Валюта
	|					И ПериодыКурсовВалютДокументов.ПериодВалютаРегламентированногоУчета = КурсыВалют.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПериодыКурсовВалютДокументов.Ссылка,
	|	ВЫБОР
	|		КОГДА &ВалютаРегламентированногоУчета = ПериодыКурсовВалютДокументов.Ссылка.Валюта
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДанныхПечати = Новый Структура;
	СтруктураДанныхПечати.Вставить("ДанныеПечати",              ПакетРезультатов[1]);
	СтруктураДанныхПечати.Вставить("ДанныеТоваров",             ПакетРезультатов[2]);
	СтруктураДанныхПечати.Вставить("ДанныеТоваровПоДокументам", ПакетРезультатов[3]);
	СтруктураДанныхПечати.Вставить("ДанныеКурсовВалют",         ПакетРезультатов[4]);

	Возврат СтруктураДанныхПечати;
	
КонецФункции

 

#КонецОбласти

#КонецОбласти
