#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПользовательскиеНастройкиМодифицированы = Ложь;
	
	УстановитьОбязательныеНастройки(ПользовательскиеНастройкиМодифицированы);
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	КомпоновкаДанныхСервер.СкрытьВспомогательныеПараметрыОтчета(СхемаКомпоновкиДанных, КомпоновщикНастроек, ДокументРезультат, ВспомогательныеПараметрыОтчета());
	
	// Сообщим форме отчета, что настройки модифицированы
	Если ПользовательскиеНастройкиМодифицированы Тогда
		КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПользовательскиеНастройкиМодифицированы", Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура УстановитьОбязательныеНастройки(ПользовательскиеНастройкиМодифицированы)
	
	// Строковые литералы
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СтрокаКасса",                           НСтр("ru='Касса';uk='Каса'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СтрокаБанк",                            НСтр("ru='Банк';uk='Банк'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СтрокаБанкКасса",                       НСтр("ru='Банк или касса';uk='Банк або каса'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СтрокаПлатежнаяКарта",                  НСтр("ru='Платежная карта';uk='Платіжна карта'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СтрокаПодотчетник",                     НСтр("ru='Подотчетник';uk='Підзвітна особа'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СтрокаСклад",                           НСтр("ru='Склад';uk='Склад'"));
	
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СтрокаНаличные",                        НСтр("ru='Наличные';uk='Готівка'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СтрокаБезналичные",                     НСтр("ru='Безналичные';uk='Безготівкові'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СтрокаНаличныеУПодотчетныхЛиц",         НСтр("ru='Наличные у подотчетных лиц';uk='Готівка у підзвітних осіб'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СтрокаВыданныеАвансы",                  НСтр("ru='Выданные авансы';uk='Видані аванси'"));
	
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииКонвертацияНаличная",      НСтр("ru='Конвертация наличной валюты';uk='Конвертація готівкової валюти'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииКонвертацияБезналичная",   НСтр("ru='Поступление сконвертированной безналичной валюты на счет';uk='Надходження сконвертованої безготівкової валюти на рахунок'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииЭквайрингПоступление",     НСтр("ru='Поступление от банка по эквайрингу';uk='Надходження від банку за еквайрингом'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииЭквайрингОплата",          НСтр("ru='Оплата от клиента платежной картой';uk='Оплата від клієнта платіжною картою'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииЭквайрингВозврат",         НСтр("ru='Возврат оплаты по платежной карте';uk='Повернення оплати платіжною картою'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииВыдачаПодотчет",           НСтр("ru='Выдача аванса';uk='Видача авансу'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииЗачислениеНаДругойСчет",   НСтр("ru='Зачисление при перечислении на другой счет';uk='Зарахування при перерахуванні на інший рахунок'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииПеремещениеМеждуКассами",  НСтр("ru='Перемещение ДС между кассами организации';uk='Переміщення ГК між касами організації'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииПеремещениеИзКассыВБанк",  НСтр("ru='Передача наличных из кассы в банк';uk='Передача готівки з каси в банк'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииПеремещениеИзБанкаВКассу", НСтр("ru='Получение наличных из банка в кассу';uk='Отримання готівки з банку в касу'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииПеремещениеИзКассыККМ",    НСтр("ru='Выемка ДС из кассы ККМ';uk='Виймання ГК з каси ККМ'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииПеремещениеВКассуККМ",     НСтр("ru='Внесение ДС в кассу ККМ';uk='Внесення ГК в касу ККМ'"));
	
КонецПроцедуры

Функция ВспомогательныеПараметрыОтчета()
	
	ВспомогательныеПараметры = Новый Массив;
	
	ВспомогательныеПараметры.Добавить("ДетальноеОтображениеОтправителейПолучателей");
	ВспомогательныеПараметры.Добавить("ДатаИВремяОперации");
	
	КомпоновкаДанныхСервер.ДобавитьВспомогательныеПараметрыОтчетаПоФункциональнымОпциям(ВспомогательныеПараметры);
	
	Возврат ВспомогательныеПараметры;

КонецФункции

#КонецОбласти

#КонецЕсли