
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПолучитьПравоАдминистрированияВМоделиСервиса() Экспорт 
	
	Если НЕ КаталогРасширенийВызовСервера.ЭтоРазделенныйСеанс() Тогда
		ОтключитьОбработчикОжидания("ПолучитьПравоАдминистрированияВМоделиСервиса");
		Возврат;
	КонецЕсли;
	
	ПравоЕсть = ПолучитьИзВременногоХранилища(КаталогРасширенийКлиент.АдресОбменаДанными());
	
	Если ПравоЕсть = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("ПолучитьПравоАдминистрированияВМоделиСервиса");
	
	КаталогРасширенийКлиент.ПроверитьНаличиеНовыхОповещений(ПравоЕсть);
	
КонецПроцедуры

Процедура ЗапуститьПроверкуНовыхОповещений() Экспорт 
	
	Если НЕ КаталогРасширенийВызовСервера.ЭтоРазделенныйСеанс() Тогда
		ОтключитьОбработчикОжидания("ЗапуститьПроверкуНовыхОповещений");
		Возврат;
	КонецЕсли;
	
	КаталогРасширенийКлиент.ПроверитьНаличиеНовыхОповещений();
	
КонецПроцедуры

#КонецОбласти