////////////////////////////////////////////////////////////////////////////////
// Модуль "НаправленияДеятельностиКлиентСервер" содержит процедуры,
// связанные с интерактивной работой пользователя в формах документов.
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область Заполнение

// Заполняет реквизит "НаправлениеДеятельности" в строке по данным назначение или переданного параметра
//
// Параметры:
//  ТекущаяСтрока		 - Структура - данные обрабатываемой строки.
//  СтруктураДействий	 - Структура - описывает действия, где Ключ - наименование действия,
//  														   Значение - Структура - параметры действия.
//  КэшированныеЗначения - Структура - сохраненные значения параметров, используемых при обработке.
//  ПараметрыДействия    - Структура, Неопределено - параметры для выполнения данного действия
//
Процедура ЗаполнитьНаправлениеДеятельности(
			ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения, ПараметрыДействия = Неопределено) Экспорт

	Перем НаправлениеДеятельности;

	Если ЗначениеЗаполнено(ТекущаяСтрока.Назначение) Тогда

		СвойстваНазначение = КэшированныеЗначения.СвойстваНазначений.Получить(ТекущаяСтрока.Назначение);

		Если СвойстваНазначение = Неопределено Тогда

			ТекстИсключения = 
				НСтр("ru='Попытка заполнение реквизита по данным указанного назначение на клиенте.';uk='Спроба заповнення реквізиту за даними зазначеного призначення на клієнті.'");

			ВызватьИсключение ТекстИсключения;

		Иначе

			НаправлениеДеятельности = СвойстваНазначение.НаправлениеДеятельности;

		КонецЕсли;

	ИначеЕсли ПараметрыДействия <> Неопределено Тогда

		НаправлениеДеятельности = ПараметрыДействия.НаправлениеДеятельности;

	КонецЕсли;

	ТекущаяСтрока.НаправлениеДеятельности = НаправлениеДеятельности;

КонецПроцедуры

#КонецОбласти

#КонецОбласти