
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Заголовок = НСтр("ru='Информация о синхронизации данных с 1С:Документооборот';uk='Інформація про синхронізації даних з 1С:Документообіг'");
	
	Макет = ПланыОбмена.ОбменУправлениеТорговлейДокументооборот21.ПолучитьМакет("ПодробнаяИнформация");
	ПолеHTMLДокумента = Макет.ПолучитьТекст();

КонецПроцедуры
