
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоУказанным(Команда)
	ТекстВопроса = НСтр("ru='По данным первичных движений будут перезаполнены регистры:
|	РасчетыСКлиентамиПоСрокам
|	РасчетыСКлиентамиПлановыеОплаты
|	РасчетыСКлиентамиПлановыеОтгрузки
|	РасчетыСПоставщикамиПоСрокам
|	РасчетыСПоставщикамиПлановыеОплаты
|	РасчетыСПоставщикамиПлановыеПоставки
|Задания к переотражению в БУ, МФУ, НДС и к закрытию месяца созданы не будут. Продолжить?'
|;uk='За даними первинних рухів будуть перезаповнені регістри: 
|	РасчетыСКлиентамиПоСрокам
|	РасчетыСКлиентамиПлановыеОплаты
|	РасчетыСКлиентамиПлановыеОтгрузки
|	РасчетыСПоставщикамиПоСрокам
|	РасчетыСПоставщикамиПлановыеОплаты
|	РасчетыСПоставщикамиПлановыеПоставки
|Завдання до перевідображення в БО, МФО, ПДВ і до закриття місяця створені не будуть. Продовжити?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоУказаннымЗавершение", ЭтотОбъект), ТекстВопроса,РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУказаннымЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоУказаннымНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсё(Команда)
	ТекстВопроса = НСтр("ru='По данным первичных движений будут перезаполнены регистры:
|	РасчетыСКлиентамиПоСрокам
|	РасчетыСКлиентамиПлановыеОплаты
|	РасчетыСКлиентамиПлановыеОтгрузки
|	РасчетыСПоставщикамиПоСрокам
|	РасчетыСПоставщикамиПлановыеОплаты
|	РасчетыСПоставщикамиПлановыеПоставки
|Задания к переотражению в БУ, МФУ, НДС и к закрытию месяца созданы не будут. Продолжить?'
|;uk='За даними первинних рухів будуть перезаповнені регістри: 
|	РасчетыСКлиентамиПоСрокам
|	РасчетыСКлиентамиПлановыеОплаты
|	РасчетыСКлиентамиПлановыеОтгрузки
|	РасчетыСПоставщикамиПоСрокам
|	РасчетыСПоставщикамиПлановыеОплаты
|	РасчетыСПоставщикамиПлановыеПоставки
|Завдання до перевідображення в БО, МФО, ПДВ і до закриття місяця створені не будуть. Продовжити?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьВсёЗавершение", ЭтотОбъект), ТекстВопроса,РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсёЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьВсёСервер();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлановые(Команда)
	ТекстВопроса = НСтр("ru='По данным первичных движений будут перезаполнены регистры:
|	РасчетыСКлиентамиПлановыеОплаты
|	РасчетыСКлиентамиПлановыеОтгрузки
|	РасчетыСПоставщикамиПлановыеОплаты
|	РасчетыСПоставщикамиПлановыеПоставки
|Продолжить?'
|;uk='За даними первинних рухів будуть перезаповнені регістри: 
|	РасчетыСКлиентамиПлановыеОплаты
|	РасчетыСКлиентамиПлановыеОтгрузки
|	РасчетыСПоставщикамиПлановыеОплаты
|	РасчетыСПоставщикамиПлановыеПоставки
|Продовжити?'");
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПлановыеЗавершение", ЭтотОбъект), ТекстВопроса,РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлановыеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПлановыеНаСервере();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если  не ЗначениеЗаполнено(ОбъектРасчетов) Тогда
		ОбъектРасчетов = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоУказаннымНаСервере(Порядок = "")
	
	Если Не ЗначениеЗаполнено(ОбъектРасчетов) ИЛИ Не ЗначениеЗаполнено(КлючАналитикиУчетаПоПартнерам) Тогда
		ТекстИсключения = НСтр("ru='Для частичного заполнения укажите Объект расчетов и Аналитику учета по партнерам.';uk='Для часткового заповнення вкажіть Об''єкт розрахунків і Аналітику обліку по партнерах.'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	ОсновныеПараметры = ОперативныеВзаиморасчетыСервер.СтруктураПараметровЗаполненияВзаиморасчетов();
	ОсновныеПараметры.ОбъектРасчетов = ОбъектРасчетов;
	ОсновныеПараметры.АналитикаУчетаПоПартнерам = КлючАналитикиУчетаПоПартнерам;
	Если ЗначениеЗаполнено(ДатаНачалаПересчета) Тогда
		ОсновныеПараметры.ПорядокФакт = ОперативныеВзаиморасчетыСервер.Порядок(ДатаНачалаПересчета,"",,Тип("ДокументСсылка.РегистраторРасчетов"));
		ОсновныеПараметры.ПорядокПлан = ОперативныеВзаиморасчетыСервер.Порядок(ДатаНачалаПересчета,"",,Тип("ДокументСсылка.РегистраторРасчетов"));
	КонецЕсли;
	
	РеквизитыОбъектРасчетов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектРасчетов, "ВалютаВзаиморасчетов, ТипРасчетов");
	
	ОсновныеПараметры.ВалютаРасчетов = РеквизитыОбъектРасчетов.ВалютаВзаиморасчетов;
	ОсновныеПараметры.ЭтоРасчетыСКлиентами = ?(РеквизитыОбъектРасчетов.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом,
													Истина,
													Ложь);
	ОперативныеВзаиморасчетыСервер.ЗаполнитьОперативныеВзаиморасчеты(ОсновныеПараметры);
		
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере()
	ОперативныеВзаиморасчетыСервер.ОчиститьРегистрыВзаиморасчетов();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВсёСервер()
	ОперативныеВзаиморасчетыСервер.ЗаполнитьПоВсемРасчетам();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлановыеНаСервере()
	
	ОперативныеВзаиморасчетыСервер.ОчиститьРегистр("РасчетыСКлиентамиПланОплат");
	ОперативныеВзаиморасчетыСервер.ОчиститьРегистр("РасчетыСКлиентамиПланОтгрузок");
	ОперативныеВзаиморасчетыСервер.ОчиститьРегистр("РасчетыСПоставщикамиПланОплат");
	ОперативныеВзаиморасчетыСервер.ОчиститьРегистр("РасчетыСПоставщикамиПланПоставок");
	
	ТаблицаОбъектов = ОперативныеВзаиморасчетыСервер.ПолучитьВсеОбъекты();
	Для Каждого Стр из ТаблицаОбъектов Цикл
		ОсновныеПараметры = ОперативныеВзаиморасчетыСервер.СтруктураПараметровЗаполненияВзаиморасчетов();
		ЗаполнитьЗначенияСвойств(ОсновныеПараметры,Стр);
		ОсновныеПараметры.НачальноеЗаполнение = Истина;
		ОперативныеВзаиморасчетыСервер.ЗаполнитьОперативныеВзаиморасчеты(ОсновныеПараметры);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

