
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Элементы.ОткрытьПомощникПереходаСУправлениеТорговлей23.Видимость = ПолучитьФункциональнуюОпцию("УправлениеТорговлей");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьПомощникПереходаСУправлениеТорговлей23(Команда)

	ПараметрыОткрытия = Новый Структура("КонфигурацияИсточник", "УТ");
	ОткрытьФорму("Обработка.ПомощникПереходаСУправлениеТорговлей23.Форма.Форма", ПараметрыОткрытия);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
