////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции, используемые в обработке ЖурналДокументовЗакупки
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриПолученииПараметровДляПечатиОбразцаЭтикеткиАкцизныеМарки(ДляЧего, ТипКода, УникальныйИдентификатор, ПараметрыПечати) Экспорт

	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

Процедура ПриПолученииПараметровДляПечатиОбразцаЭтикеткиШтрихкодыУпаковок(ДляЧего, ТипКода, УникальныйИдентификатор, ПараметрыПечати) Экспорт
	
	//++ Локализация
	//-- Локализация
	Возврат;
	
КонецПроцедуры

Процедура ПриПолученииПараметровДляПечатиОбразцаЭтикеткиИСМП(ДляЧего, ТипКода, УникальныйИдентификатор, ПараметрыПечати) Экспорт
	
	//++ Локализация
	//-- Локализация
	Возврат;
	
КонецПроцедуры

Процедура ПриОпределенииИсточниковКОформлению(МассивМенеджеровРасчетаСмТакжеВРаботе) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

Процедура ПриЗаполненииСхемыКомпоновкиДанных(СхемаКомпоновкиДанных, Назначение) Экспорт
	
	//++ Локализация
	//-- Локализация
	Возврат;
	
КонецПроцедуры

Процедура ПриЗаполненииДоступныхПолейКомпоновкиДанных(ИменаПолей, Назначение) Экспорт
	
	//++ Локализация
	//-- Локализация
	Возврат;
	
КонецПроцедуры

Процедура ПриИзмененииНазначенияПомощникНового(Форма, СтрокаПоискаТипа, ПризнакМакетаДляТоваров, МассивТипов) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриСозданииНаСервереФормыВыбораШаблона(Форма, Параметры, ПризнакПредопределенногоМакета) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

Процедура УстановитьШаблонПоУмолчанию(Форма, Объект, ИмяШаблона) Экспорт
	
	Если Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляАкцизныхМарок Тогда
			
		Форма.ТипШтрихкода = Перечисления.ТипыШтрихкодов.PDF417;
		Форма.ОтображатьТекст = Ложь;
			
	ИначеЕсли Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляШтрихкодовУпаковок Тогда
		
		Форма.ТипШтрихкода = Перечисления.ТипыШтрихкодов.GS1_DataBarExpandedStacked;
		Форма.ОтображатьТекст = Ложь;
		
	ИначеЕсли Объект.Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаКодМаркировкиИСМП Тогда
		
		Форма.ТипШтрихкода       = Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
		Форма.ОтображатьТекст    = Ложь;
		Форма.Масштабировать     = Ложь;
		Форма.СохранятьПропорции = Истина;
		Если СтрНайти(ИмяШаблона, "Упаковка") > 0 Тогда
			Форма.ТипШтрихкода = Перечисления.ТипыШтрихкодов.GS1_128;
		КонецЕсли;
			
	КонецЕсли;

КонецПроцедуры

Процедура ПодготовитьСтруктуруМакетаШаблона(Назначение, Масштабировать, ТипКода, ТипШтрихкодаШаблона) Экспорт
	Если Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаДляАкцизныхМарок Тогда
		ТипКода = 6;  // PDF417
		ТипШтрихкодаШаблона = Перечисления.ТипыШтрихкодов.PDF417;
	ИначеЕсли Назначение = Перечисления.НазначенияШаблоновЭтикетокИЦенников.ЭтикеткаКодМаркировкиИСМП Тогда
		ТипКода = 24;  // DataMatrix
		ТипШтрихкодаШаблона = Перечисления.ТипыШтрихкодов.GS1_DataMatrix;
		Масштабировать = Ложь;
	КонецЕсли;
КонецПроцедуры

//++ Локализация
//-- Локализация

Процедура ПриИзмененииНазначенияШаблонаВСправочникеШаблонов(Форма, ОчищатьНазначение, МассивТипов) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти