#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область КомандыПодменюОтчеты

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//
// Возвращаемое значение:
//   СтрокаТаблицыЗначений - новая команда отчета.
Функция ДобавитьКомандуОтчета(КомандыОтчетов) Экспорт

	Если ПравоДоступа("Просмотр", Метаданные.Отчеты.АнализЦенПоставщиков)
		И ЕстьПравоЧтенияТаблицДокументов() Тогда
		
		КомандаОтчет = КомандыОтчетов.Добавить();
		
		КомандаОтчет.Менеджер = Метаданные.Отчеты.АнализЦенПоставщиков.ПолноеИмя();
		КомандаОтчет.Представление = НСтр("ru='Анализ цен';uk='Аналіз цін'");
		КомандаОтчет.МножественныйВыбор = Истина;
		КомандаОтчет.Важность = "Обычное";
		КомандаОтчет.КлючВарианта = "АнализЦенПоставщиков";
		
		Возврат КомандаОтчет;
		
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция МассивИменДокументовФормирующихДанные()
	
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить("ЗаказКлиента");
	МассивДокументов.Добавить("РеализацияТоваровУслуг");
	МассивДокументов.Добавить("ПередачаТоваровХранителю");
	МассивДокументов.Добавить("КоммерческоеПредложениеКлиенту");

	Возврат МассивДокументов;
	
КонецФункции

Функция ЕстьПравоЧтенияТаблицДокументов() 
	
	МассивИменДокументов = МассивИменДокументовФормирующихДанные();
	
	Для Каждого ИмяДокумента Из МассивИменДокументов Цикл
		
		МетаданныеДокумента = Метаданные.Документы.Найти(ИмяДокумента);
		
		Если МетаданныеДокумента = Неопределено 
			Или Не ПравоДоступа("Чтение", МетаданныеДокумента) Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецЕсли