
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Обновление информационной базы
Процедура ОбновитьПреопределенныеПараметры() Экспорт
	
	Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.ЗаполнитьОбъект("РегистрСведений", "ПараметрыНалоговогоУчета");
		
КонецПроцедуры

Функция ПолучитьСтавкуПФ(ДатаДокумента) Экспорт
	
 	Если ДатаДокумента > Дата("20150101") Тогда
		СтавкаНалогов = 0;
	ИначеЕсли ДатаДокумента > Дата("20140401") Тогда
		СтавкаНалогов = 0.5 / 100;
	Иначе
		СтавкаНалогов = 0;
	КонецЕсли;
	
	Возврат СтавкаНалогов;
	
КонецФункции
