#Область ПрограммныйИнтерфейс

#Область ПолучениеНастроекИПараметровУчетаНДС

// Возвращает список типов налогообложения операций продажи и/или закупки, доступных в конфигурации.
//
// Возвращаемое значение:
// 	СписокЗначений - Список доступных типов налогообложения.
//
Функция ПрименяемыеТипыНалогообложенияНДС(Продажи = Истина, Закупки = Истина) Экспорт
	
	Возврат УчетНДСУПВызовСервера.ПрименяемыеТипыНалогообложенияНДС(Продажи, Закупки);
	
КонецФункции

// Возвращает список типов налогообложения НДС, для которых в документах скрываются реквизиты ставки и суммы НДС
//
// Возвращаемое значение:
// 	Массив - Типы налогообложений НДС
//
Функция ТипыНалогообложенияСкрывающиеРеквизитыНДС() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС"));
	УчетНДСКлиентСерверЛокализация.ДополнитьТипыНалогообложенияСкрывающиеРеквизитыНДС(Результат);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СтавкиНДС

// Функция возвращает процент ставки НДС.
//
// Параметры:
//  СтавкаНДС - СправочникСсылка.СтавкиНДС - Ставка НДС.
//
// Возвращаемое значение:
//	Число - Процент ставки НДС.
//
Функция ЗначениеСтавкиНДС(СтавкаНДС) Экспорт
	
	Возврат УчетНДСУПСлужебныйКлиентСерверПовтИсп.ЗначениеСтавкиНДС(СтавкаНДС);
	
КонецФункции

// Рассчитывает сумму НДС исходя из суммы и флагов налогообложения.
//
// Параметры:
//  Сумма            - Число - сумма от которой надо рассчитывать налоги;
//  СтавкаНДС        - Число, СправочникСсылка.СтавкиНДС - Значение или ссылка на ставку НДС.
//  СуммаВключаетНДС - Булево - признак включения НДС в сумму ("внутри" или "сверху");
//
// Возвращаемое значение:
//  Число - полученная сумма НДС.
//
Функция РассчитатьСуммуНДС(Сумма, СтавкаНДС, СуммаВключаетНДС = Истина) Экспорт
	
	
	Если ТипЗнч(СтавкаНДС) = Тип("СправочникСсылка.СтавкиНДС") Тогда
		ЗначениеСтавкиНДС = ЗначениеСтавкиНДС(СтавкаНДС);
	Иначе
		ЗначениеСтавкиНДС = СтавкаНДС; 
	КонецЕсли;
	
	Если СуммаВключаетНДС Тогда
		СуммаНДС = Сумма - 100 * Сумма / (100 + ЗначениеСтавкиНДС);
	Иначе
		СуммаНДС = Сумма * ЗначениеСтавкиНДС / 100;
	КонецЕсли;
	
	Возврат СуммаНДС;

КонецФункции

#КонецОбласти

#Область УчетВходящегоНДС

#Область ЗаполнениеНалогообложенияНДСЗакупки

// Возвращает структуру параметров заполнения налогообложения НДС закупки товаров или возврата товаров поставщику.
//
// Возвращаемое значение 
// 	Структура - Параметры заполнения
//		* Контрагент - СправочникСсылка.Контрагенты, СправочникСсылка.Организации - Контрагент или организация-поставщик.
//		* Договор - СправочникСсылка.ДоговорыКонтрагентов, 
//					СправочникСсылка.ДоговорыМеждуОрганизаций - Договор, в рамках которого осуществляется закупка или возврат. 
// 		[Параметры операции]	
// 		* ПриобретениеТоваров - Булево - Документ отражает приобретение товаров или сопутствующие приобретению операции:
//		                                 поступление товаров, прием товаров на хранение для последующего выкупа, акт о расхождении при приемке.
// 		* ПриобретениеРабот - Булево - Документ отражает приобретение работ.
// 		* ПриобретениеНаСтатьи - Булево - Документ отражает приобретение ценностей, которые относятся на статьях прочих расходов или прочих активов.
// 		* ВыкупВозвратнойТарыУПоставщика - Булево - Документ отражает выкуп принятой у поставщика возвратной тары.
//		* ПриемНаКомиссию - Булево - Признак того, что товар принимается на комиссию.
//		* ИмпортТоваров - Булево - Признак того, что приобретаемый товар ввозится из другой страны, с прохождением таможенной процедуры.
//		* ЗакупкаЧерезПодотчетноеЛицо - Булево - Признак того, что документ отражает операции приобретения через подотчетное лицо.
//		* ВозвратТоваровПоставщику - Булево - Признак того, что документ отражает операцию возврата товаров поставщику.
//		* ВозвратТоваровКомитенту - Булево - Признак того, что документ отражает операцию возврата товаров комитенту.
//		* ПоступлениеИзТоваровВПути - Булево - Признак того, что документ отражает поступление на склад товаров, по которым ранее было отражено приобретение.
//		
//	    * ЭтоОперацияМеждуОрганизациями - Булево - Истина, если отражается операция между собственными организациями (интеркампани).
//	                           Параметр указывается для уточнение к параметрам операции (например, совместно с параметром ВозвратТоваровПоставщику).
//
Функция ПараметрыЗаполненияНалогообложенияНДСЗакупки() Экспорт
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Контрагент");
	ПараметрыЗаполнения.Вставить("Договор");
    ПараметрыЗаполнения.Вставить("Соглашение");
    ПараметрыЗаполнения.Вставить("Дата");
	
	// Параметры отражаемой операции
	ПараметрыЗаполнения.Вставить("ПриобретениеТоваров", Ложь);
	ПараметрыЗаполнения.Вставить("ПриобретениеРабот", Ложь);
	ПараметрыЗаполнения.Вставить("ПриобретениеНаСтатьи", Ложь);
	ПараметрыЗаполнения.Вставить("ВыкупВозвратнойТарыУПоставщика", Ложь);
	ПараметрыЗаполнения.Вставить("ПриемНаКомиссию", Ложь);
	ПараметрыЗаполнения.Вставить("ИмпортТоваров", Ложь);
	ПараметрыЗаполнения.Вставить("ЗакупкаЧерезПодотчетноеЛицо", Ложь);
	ПараметрыЗаполнения.Вставить("ВозвратТоваровПоставщику",  Ложь);
	ПараметрыЗаполнения.Вставить("ВозвратТоваровКомитенту",   Ложь);
	ПараметрыЗаполнения.Вставить("ПоступлениеИзТоваровВПути", Ложь);
	
	ПараметрыЗаполнения.Вставить("ЭтоОперацияМеждуОрганизациями", Ложь);
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

// Определяет, необходимо ли отображение НДС в итогах документа закупки 
// 
// Параметры:
// 	НалогообложениеНДС - ПеречислениеСсылка.ТипыНалогообложенияНДС - налогообложение документа закупки
// 
// Возвращаемое значение:
// 	Булево - Истина, если облагается НДС
//
Функция ОтображатьНДСВИтогахДокументаЗакупки(НалогообложениеНДС) Экспорт
	
	ТипыНалогообложенияСкрывающиеРеквизитыНДС = ТипыНалогообложенияСкрывающиеРеквизитыНДС();
	Возврат (ТипыНалогообложенияСкрывающиеРеквизитыНДС.Найти(НалогообложениеНДС) = Неопределено);
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеВидаДеятельностиНДС

// Возвращает структуру параметров заполнения вида деятельности раздельного учета НДС.
//
// Возвращаемое значение:
// 	Структура - Структура параметров с ключами  
// 		* Организация - СправочникСсылка.Организации - Организация документа.
// 		* Дата - Дата - Дата документа
// 		* Склад - СправочникСсылка.Склады - Склад-получатель товаров (необязательный). Если получателей несколько, но не заполняется.
// 		* Договор - СправочникСсылка.ДоговорыКонтрагентов, 
// 		            СправочникСсылка.ДоговорыМеждуОрганизациями - Договор с поставщиком (необязательный). 
// 		                                                          Указывается в случае отражения операций закупки ценностей.
// 		* НаправлениеДеятельности - СправочникСсылка.НаправленияДеятельности - Направление деятельности - получатель ценностей (необязательный).
// 		[Операции документа]
// 		* ПриобретениеТоваров - Булево - Документ отражает приобретение товаров или сопутствующие приобретению операции:
//		                                 поступление товаров, акт о расхождении, корректировку приобретения товаров.
// 		* ПриобретениеРабот - Булево - Документ отражает приобретение работ.
// 		* ПриобретениеНаСтатьи - Булево - Документ отражает приобретение ценностей, которые в момент приобретения относятся на статьях прочих расходов или прочих активов.
// 		* ДвижениеТоваровНаСкладах - Булево - Документ отражает движение (перемещение) товаров в рамках складского контура, в том числе цеховых кладовых.
// 		* ДвижениеТоваровИРаботВПроизводстве - Булево - Документ отражает передачу товаров в производство, движение товаров и работ внутри контура производства. 
// 		* СписаниеТоваровИРаботНаСтатьи - Булево - Документ отражает списание товаров и работ на статьи расходов или прочих активов.
// 		* ПередачаВЭксплуатацию - Булево - Документ отражает передачу материалов в эксплуатацию.
// 		* СборкаРазборкаТоваров - Булево - Документ отражает сборку или разборку товаров.
// 		* ВыпускПродукцииИРабот - Булево - Документ отражает выпуск продукции (полуфабрикатов) или работ (создание ценности своими силами).
// 		* ПрочееВыбытиеТоваров - Булево - Документ отражает порчу, списание недостач или пересортицу товаров.
// 		* ЛизинговоеИмуществоНаБалансе - Булево - Документ отражает поступление услуг лизинга по имуществу на балансе лизингополучателя.
// 		* КорректировкаВидаДеятельностиНДС - Булево - Документ отражает изменение вида деятельности НДС без реального движения товаров.
// 		* АвансовыйОтчет - Булево - Несмотря на то, что авансовый отчет отражает приобретение, для него используется отдельный параметр,
// 		                             т.к. документ не входит в контур автоматизированного раздельного учета НДС.
Функция ПараметрыЗаполненияВидаДеятельностиНДС() Экспорт
	
	ПараметрыЗаполнения = Новый Структура();
	
	// Реквизиты документа
	ПараметрыЗаполнения.Вставить("Организация",             Неопределено);
	ПараметрыЗаполнения.Вставить("Дата",                    '00010101');
	ПараметрыЗаполнения.Вставить("Склад",                   Неопределено);
	ПараметрыЗаполнения.Вставить("Договор",                 Неопределено);
	ПараметрыЗаполнения.Вставить("НаправлениеДеятельности", Неопределено);
	
	// Параметры операции
	ПараметрыЗаполнения.Вставить("ПриобретениеТоваров",                Ложь);
	ПараметрыЗаполнения.Вставить("ПриобретениеРабот",                  Ложь);
	ПараметрыЗаполнения.Вставить("ПриобретениеНаСтатьи",               Ложь);
	ПараметрыЗаполнения.Вставить("ДвижениеТоваровНаСкладах",           Ложь);
	ПараметрыЗаполнения.Вставить("ДвижениеМеждуФилиалами",             Ложь);
	ПараметрыЗаполнения.Вставить("ДвижениеТоваровИРаботВПроизводстве", Ложь);
	ПараметрыЗаполнения.Вставить("СписаниеТоваровИРаботНаСтатьи",      Ложь);
	ПараметрыЗаполнения.Вставить("ПередачаВЭксплуатацию",              Ложь);
	ПараметрыЗаполнения.Вставить("СборкаРазборкаТоваров",              Ложь);
	ПараметрыЗаполнения.Вставить("ВыпускПродукцииИРабот",              Ложь);
	ПараметрыЗаполнения.Вставить("ПрочееВыбытиеТоваров",               Ложь);
	ПараметрыЗаполнения.Вставить("ЛизинговоеИмуществоНаБалансе",       Ложь);
	ПараметрыЗаполнения.Вставить("КорректировкаВидаДеятельностиНДС",   Ложь);
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

#КонецОбласти


#Область ЗаполнениеНалоговогоНазначения

// Возвращает структуру параметров заполнения налогового назначения 
//
// Возвращаемое значение 
// 	Структура - Параметры заполнения
// 		* Организация - СправочникСсылка.Организации - Организация документа.
// 		* Дата - Дата - Дата документа
// 		* НаправлениеДеятельности - СправочникСсылка.НаправленияДеятельности - Направление деятельности - получатель ценностей (необязательный).
// 		[Параметры операции]	
//		* ИмпортТоваров - Булево - Признак того, что приобретаемый товар ввозится из другой страны, с прохождением таможенной процедуры.
//		* ЕстьСтавкаНДС - Булево - Признак того, что в табличной части документа есть реквизит СтавкаНДС
//
Функция ПараметрыЗаполненияНалоговогоНазначения() Экспорт
	
	ПараметрыЗаполнения = Новый Структура();
	
	// Реквизиты документа
	ПараметрыЗаполнения.Вставить("Организация",             Неопределено);
	ПараметрыЗаполнения.Вставить("Дата",                    '00010101');
	ПараметрыЗаполнения.Вставить("НаправлениеДеятельности", Неопределено);
	ПараметрыЗаполнения.Вставить("ВыпускПоРаспоряжениям",  	Ложь);
	
	// Параметры операции
    ПараметрыЗаполнения.Вставить("ИмпортТоваров",                      Ложь);
    ПараметрыЗаполнения.Вставить("ЕстьСтавкаНДС",                      Ложь);
    ПараметрыЗаполнения.Вставить("КорректировкаНалоговогоНазначения",  Ложь);
	ПараметрыЗаполнения.Вставить("ПриобретениеТоваров",                Ложь);
	ПараметрыЗаполнения.Вставить("ПриобретениеРабот",                  Ложь);
	ПараметрыЗаполнения.Вставить("ПриобретениеНаСтатьи",               Ложь);
	ПараметрыЗаполнения.Вставить("ДвижениеТоваровНаСкладах",           Ложь);
	ПараметрыЗаполнения.Вставить("ДвижениеМеждуФилиалами",             Ложь);
	ПараметрыЗаполнения.Вставить("ДвижениеТоваровИРаботВПроизводстве", Ложь);
	ПараметрыЗаполнения.Вставить("СписаниеТоваровИРаботНаСтатьи",      Ложь);
	ПараметрыЗаполнения.Вставить("ПередачаВЭксплуатацию",              Ложь);
	ПараметрыЗаполнения.Вставить("СборкаРазборкаТоваров",              Ложь);
	ПараметрыЗаполнения.Вставить("ВыпускПродукцииИРабот",              Ложь);
	ПараметрыЗаполнения.Вставить("ПрочееВыбытиеТоваров",               Ложь);
    ПараметрыЗаполнения.Вставить("КорректировкаНалоговогоНазначения",  Ложь);
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

#КонецОбласти


#КонецОбласти

#Область УчетИсходящегоНДС

#Область ЗаполнениеНалогообложенияНДСПродажи

// Возвращает структуру параметров для заполнения налогообложения НДС продажи или возврата товаров от покупателя.
//
// Возвращаемое значение
// 	Структура - Параметры заполнения
// 	     * Организация - СправочникСсылка.Организации - Организация документа.
// 	     * Дата - Дата - Дата документа.
// 	     * Договор - СправочникСсылка.ДоговорыКонтрагентов,
// 	                 СправочникСсылка.ДоговорыМеждуОрганизациями - Договор с покупателем.
// 	     * НаправлениеДеятельности - СправочникСсылка.НаправленияДеятельности - Направление деятельности, в рамках которого осуществляется продажа.
// 	                                                                            В случае возврата товаров поставщику не заполняется.
// 	     [Параметры операции]
// 	     * РеализацияТоваров - Булево- Признак того, что документом отражается реализация или возврат товаров, работ или услуг напрямую клиенту или собственной организации.
// 	     * РеализацияРаботУслуг - Булево - Признак того, что документом отражается реализация товаров, работ или услуг напрямую клиенту или собственной организации.
// 	     * РеализацияПрочихАктивов - Булево - Признак того, что документом отражается реализация прочих услуг (без номенклатуры) или прочих активов.
// 	     * ВыкупВозвратнойТарыКлиентом - Булево - Документ отражает выкуп клиентом ранее переданной возвратной тары.
// 	     * ВыкупТоваровХранителем - Булево - Документ отражает выкуп товаров, которые были ранее переданы на хранение с правом продажи.
// 	     * ПередачаНаКомиссию - Булево - Признак того, что документом отражается передача товаров на комиссию.
// 	     * ОтчетДавальцу - Булево -Признак того, что документом отражается реализация услуг по переработке давальческих материалов.
// 	     * ОтчетКомиссионера - Булево -Признак того, что документом отражается факт реализация товаров комиссионером.
// 	     * РозничнаяПродажа - Булево - Признак того, что документом отражается розничная продажа или возврат товаров проданных в розницу.
// 	     * ВозвратТоваровОтКлиента - Булево - Признак того, что отражается возврат товаров от клиента.
// 	     * ВозвратТоваровОтКомиссионера - Булево - Признак того, что отражается выполняется возврат комиссионера.
// 	     * ОтчетКомитентуОЗакупках - Булево - Признак того, что документом отражает отчет комитенту о закупке.
// 	     
// 	     * ЭтоЗаказ - Булево - Истина, если заполняется налогообложение в Заказе клиента или Заказе давальца.
// 	                           Параметр указывается для уточнение к параметрам операции. 
// 	                           Например, совместно с параметрами РеализацияРаботУслуг и РеализацияТоваров.
// 	     * ЭтоОперацияМеждуОрганизациями - Булево - Истина, если отражается операция между собственными организациями (интеркампани).
// 	                           Параметр указывается для уточнение к параметрам операции. 
// 	                           Например, совместно с параметрами РеализацияРаботУслуг и РеализацияТоваров.                       
//
Функция ПараметрыЗаполненияНалогообложенияНДСПродажи() Экспорт
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Организация");
	ПараметрыЗаполнения.Вставить("Дата");
    ПараметрыЗаполнения.Вставить("Соглашение");
	ПараметрыЗаполнения.Вставить("Договор");
	ПараметрыЗаполнения.Вставить("НаправлениеДеятельности");
	
	ПараметрыЗаполнения.Вставить("РеализацияТоваров", Ложь);
	ПараметрыЗаполнения.Вставить("РеализацияРаботУслуг", Ложь);
	ПараметрыЗаполнения.Вставить("РеализацияПрочихАктивов", Ложь);
	ПараметрыЗаполнения.Вставить("ВыкупВозвратнойТарыКлиентом", Ложь);
	ПараметрыЗаполнения.Вставить("ВыкупТоваровХранителем", Ложь);
	ПараметрыЗаполнения.Вставить("ПередачаНаКомиссию", Ложь);
	ПараметрыЗаполнения.Вставить("ОтчетДавальцу", Ложь);
	ПараметрыЗаполнения.Вставить("ОтчетКомиссионера", Ложь);
	ПараметрыЗаполнения.Вставить("ВозвратТоваровОтКлиента", Ложь);
	ПараметрыЗаполнения.Вставить("ВозвратТоваровОтКомиссионера", Ложь);
	ПараметрыЗаполнения.Вставить("ОтчетКомитентуОЗакупках", Ложь);
	
	ПараметрыЗаполнения.Вставить("РозничнаяПродажа", Ложь);
	
	ПараметрыЗаполнения.Вставить("ЭтоЗаказ", Ложь);
	ПараметрыЗаполнения.Вставить("ЭтоОперацияМеждуОрганизациями", Ложь);
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

// Определяет, необходимо ли отображение НДС в итогах документа продажи 
// 
// Параметры:
// 	НалогообложениеНДС - ПеречислениеСсылка.ТипыНалогообложенияНДС - налогообложение документа продажи
// Возвращаемое значение:
// 	Булево - Истина, если облагается НДС
//
Функция ОтображатьНДСВИтогахДокументаПродажи(НалогообложениеНДС) Экспорт
	
	ТипыНалогообложенияСкрывающиеРеквизитыНДС = ТипыНалогообложенияСкрывающиеРеквизитыНДС();
	Возврат (ТипыНалогообложенияСкрывающиеРеквизитыНДС.Найти(НалогообложениеНДС) = Неопределено);
	
КонецФункции

#КонецОбласти


#КонецОбласти


#КонецОбласти
