///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.НеразделенныйПользователь.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru='Просмотр сведений о пользователе %1 не доступен, т.к. это 
                   |служебная учетная запись, предусмотренная для администраторов сервиса.'
                   |;uk='Перегляд відомостей про користувача %1 не доступний, оскільки це 
                   |службовий обліковий запис, передбачений для адміністраторів сервісу.'"),
		Параметры.Ключ.Наименование);
	
КонецПроцедуры

#КонецОбласти