#Область ПрограммныйИнтерфейс

// Возвращает систему налогообложения организации
// 
// Параметры:
// 	Организация - СправочникСсылка.Организации - ссылка на организацию.
// 	ДатаДействия - Дата - дата получения системы налогообложения.
// 	ПоУмолчанию - Булево - если истина, то возвращается система налогообложения по умолчанию,
// 	               иначе возвращается только из записи регистра.
// Возвращаемое значение:
// 	ПеречислениеСсылка.СистемыНалогообложения, Неопределено - система налогообложения организации.
Функция СистемаНалогообложенияОрганизации(Организация, ДатаДействия = Неопределено, ПоУмолчанию = Истина) Экспорт
	СистемаНалогообложения = НастройкиНалоговУчетныхПолитикЛокализация.СистемаНалогообложенияОрганизации(Организация,
		ДатаДействия,
		ПоУмолчанию);
	Возврат СистемаНалогообложения;
КонецФункции

// См. НастройкиНалоговУчетныхПолитик.ДействующиеПараметрыНалоговУчетныхПолитик()
//
Функция ДействующиеПараметрыНалоговУчетныхПолитик(ИмяРегистра, Организация, ДатаДействия = Неопределено, ВозвращатьПоУмолчанию = Истина, ВыдаватьИсключение = Ложь) Экспорт
	
	НастройкиУчетнойПолитики = НастройкиНалоговУчетныхПолитик.ДействующиеПараметрыНалоговУчетныхПолитик(ИмяРегистра,
		Организация,
		ДатаДействия,
		ВозвращатьПоУмолчанию,
		ВыдаватьИсключение);
		
	Возврат НастройкиУчетнойПолитики;
	
КонецФункции

// Возвращает признак использования раздельного учета товаров по налогообложению НДС. 
//
// Параметры:
// 	Организация - СправочникСсылка.Организации - Организация, для которой необходимо получить признак учетной политики
// 	Период 		- Дата, Неопределено - Дата действия учетной политики, если Неопределено, то на текущую дату
//
// Возвращаемое значение:
// 	Результат - Булево - Значение признака
// 
Функция РаздельныйУчетТоваровПоНалогообложениюНДС(Организация, Период = Неопределено) Экспорт
	
	Возврат НастройкиНалоговУчетныхПолитикЛокализация.РаздельныйУчетТоваровПоНалогообложениюНДС(Организация, Период);
	
КонецФункции

#КонецОбласти
