#Область ПрограммныйИнтерфейс

// Вызывается из переопределяемого модуля.
// см. ОбщийМодуль.ДатыЗапретаИзмененияПереопределяемый.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения()
//
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт

	//++ Локализация
   //++ НЕ БЗК
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ТМЦВЭксплуатации",            "Период", "СписанияОприходованияТоваров", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВводОстатковТМЦВЭксплуатации",                            "Дата", "РегламентныеОперации", "Организация");	
	//-- НЕ БЗК
	
	//-- Локализация

КонецПроцедуры

// Позволяет изменить работу интерфейса при встраивании.
//
// см. ОбщийМодуль.ДатыЗапретаИзмененияПереопределяемый.НастройкаИнтерфейса()
//
Процедура НастройкаИнтерфейса(НастройкиРаботыИнтерфейса) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

// Заполняет разделы дат запрета изменения, используемые при настройке дат запрета.
// Если не указать ни одного раздела, тогда будет доступна только настройка общей даты запрета.
//
// см. ОбщийМодуль.ПриЗаполненииРазделовДатЗапретаИзменения.НастройкаИнтерфейса()
//
Процедура ПриЗаполненииРазделовДатЗапретаИзменения(Разделы) Экспорт
	
	//++ Локализация
	
	//++ НЕ БЗК
	Раздел = Разделы.Добавить();
	Раздел.Имя  = "БухгалтерскийУчет";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("2bdf6479-8eaf-4ec0-93a1-412e8659a178");
	Раздел.Представление = НСтр("ru='Бухгалтерский учет';uk='Бухгалтерський облік'",МультиязычностьУкр.КодЯзыкаИнформационнойБазы());
	Раздел.ТипыОбъектов.Добавить(Тип("СправочникСсылка.Организации"));
	//-- НЕ БЗК
	//-- Локализация
	
КонецПроцедуры


// Позволяет переопределить выполнение проверки запрета изменения произвольным образом.
//
// см. ОбщийМодуль.ДатыЗапретаИзмененияПереопределяемый.ПередПроверкойЗапретаИзменения()
//
Процедура ПередПроверкойЗапретаИзменения(Объект,
                                         ПроверкаЗапретаИзменения,
                                         УзелПроверкиЗапретаЗагрузки,
                                         ВерсияОбъекта) Экспорт
	
	//++ Локализация
	Если ОбщегоНазначения.ЭтоРегистр(Объект.Метаданные())
	 И Объект.Отбор.Найти("Регистратор") <> Неопределено Тогда
		ТипРегистратора = ТипЗнч(Объект.Отбор.Регистратор.Значение); // это набор записей документа-регистратора
	Иначе
		ТипРегистратора = Неопределено;
	КонецЕсли;
	
	ТипОбъекта = ТипЗнч(Объект);
		
	
	//++ НЕ БЗК
	//-- НЕ БЗК
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти