
#Область ПрограммныйИнтерфейс

// Получение элемента справочника СтавкиНДС по перечислению СтавкиНДС
//
// Параметры:
//	ПеречислениеСтавкаНДС - ПеречислениеСсылка.СтавкиНДС - Значение ставки НДС.
//	ТипНалогообложенияНДС - ПеречислениеСсылка.ТипыНалогообложенияНДС - Налогообложение НДС, в рамках которого нужно найти ставку. 
//	                                                       Если Неопределено, то ставка получается по налогообложению ПродажаОблагаетсяНДС
// Возвращаемое значение:
//	СправочникСсылка.СтавкиНДС - Соответствующая перечислению ставка НДС.
//
Функция СтавкаНДСПоЗначениюПеречисления(ПеречислениеСтавкаНДС, ТипНалогообложенияНДС = Неопределено) Экспорт
	
    Возврат НДСВызовСервера.СтавкаНДСПоЗначениюПеречисления(ПеречислениеСтавкаНДС, ТипНалогообложенияНДС);
	
КонецФункции

// Возвращает значение расчетной ставки НДС, соответствующей базовой ставке.
// Например, для ставки 20 будет возвращена ставка 20/120
// Если передана расчетная ставка, то будет возвращена она же.
// 
// Параметры:
// 	СтавкаНДС - СправочникСсылка.СтавкиНДС - Базовая ставка НДС
//
// Возвращаемое значение:
// 	СправочникСсылка.СтавкиНДС - Расчетная ставка НДС
//
Функция СоответствующаяРасчетнаяСтавкаНДС(СтавкаНДС) Экспорт
	
	РеквизитыСтавки = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(
							СтавкаНДС, "РасчетнаяСтавка, СоответствующаяРасчетнаяСтавка");
	
	РасчетнаяСтавка =
		?(НЕ РеквизитыСтавки.РасчетнаяСтавка И ЗначениеЗаполнено(РеквизитыСтавки.СоответствующаяРасчетнаяСтавка),
			РеквизитыСтавки.СоответствующаяРасчетнаяСтавка,
			СтавкаНДС);
			
	Возврат РасчетнаяСтавка;
	
КонецФункции

// Возвращает значение базовой ставки НДС, соответствующей расчетной ставке.
// Например, для ставки 20/120 будет возвращена ставка 20
// Если передана базовая ставка, то будет возвращена она же.
// 
// Параметры:
// 	СтавкаНДС - СправочникСсылка.СтавкиНДС - Расчетная ставка НДС
//
// Возвращаемое значение:
// 	СправочникСсылка.СтавкиНДС - Базовая ставка НДС
//
Функция СоответствующаяБазоваяСтавкаНДС(СтавкаНДС) Экспорт
	
	РеквизитыСтавки = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(
							СтавкаНДС, "РасчетнаяСтавка, СоответствующаяБазоваяСтавка");
	
	БазоваяСтавка = 
		?(РеквизитыСтавки.РасчетнаяСтавка И ЗначениеЗаполнено(РеквизитыСтавки.СоответствующаяБазоваяСтавка),
			РеквизитыСтавки.СоответствующаяБазоваяСтавка,
			СтавкаНДС);
			
	Возврат БазоваяСтавка;
	
КонецФункции

// Получение перечисления СтавкиНДС по элементу справочника СтавкиНДС 
//
// Параметры:
//  СтавкаНДС - СправочникСсылка.СтавкиНДС - ставка НДС.
// 
// Возвращаемое значение:
//	ПеречислениеСсылка.СтавкиНДС - реквизит ПеречислениеСтавкаНДС справочника.
//
Функция ПеречислениеСтавкаНДСПоСтавкеНДС(СтавкаНДС) Экспорт
	ПеречислениеСтавкаНДС = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(СтавкаНДС, "ПеречислениеСтавкаНДС");
    Возврат ПеречислениеСтавкаНДС;
КонецФункции

#КонецОбласти