#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если РасчетСебестоимостиПрикладныеАлгоритмы.ДвиженияЗаписываютсяРасчетомПартийИСебестоимости(ЭтотОбъект) Тогда
		
		Если ДополнительныеСвойства.Свойство("ДополнитьДвижениямиИзИБЗаПериод") Тогда
			
			Если НЕ РасчетСебестоимостиПрикладныеАлгоритмы.ФормироватьДвиженияРегистровУчетаСебестоимости(ЭтотОбъект) Тогда
				Возврат;
			КонецЕсли;
			
			ДополнительныеСвойства.Вставить("ТочноНужноСохранитьДвижения");
			
			// Сохраним неизмененные первичные движения.
			СохранитьНеИзмененныеПервичныеДвижения();
			
			// Сохраним расчетные движения за периоды, в которых есть первичные движения.
			РасчетСебестоимостиПрикладныеАлгоритмы.СохранитьДвиженияСформированныеРасчетомПартийИСебестоимости(ЭтотОбъект, Замещение);
			
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если НЕ РасчетСебестоимостиПрикладныеАлгоритмы.ФормироватьДвиженияРегистровУчетаСебестоимости(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Сохраним неизмененные первичные движения.
	СохранитьНеИзмененныеПервичныеДвижения();
	
	// Сохраним расчетные движения за периоды, в которых есть первичные движения.
	РасчетСебестоимостиПрикладныеАлгоритмы.СохранитьДвиженияСформированныеРасчетомПартийИСебестоимости(ЭтотОбъект, Замещение);
	
	Если Не ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства)
		Или ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	*
	|ПОМЕСТИТЬ СебестоимостьТоваровПередЗаписью
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|ГДЕ
	|	Себестоимость.Регистратор = &Регистратор";
	
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Или Не ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства)
		Или ПланыОбмена.ГлавныйУзел() <> Неопределено
		Или РасчетСебестоимостиПрикладныеАлгоритмы.ДвиженияЗаписываютсяРасчетомПартийИСебестоимости(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ РасчетСебестоимостиПрикладныеАлгоритмы.ФормироватьДвиженияРегистровУчетаСебестоимости(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Таблица.Период КАК Период,
	|	Таблица.Регистратор КАК Регистратор,
	|	Таблица.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|	Таблица.РазделУчета КАК РазделУчета,
	|	Таблица.ВидЗапасов КАК ВидЗапасов,
	|	Таблица.Организация КАК Организация,
	|	Таблица.Партия КАК Партия,
	|	Таблица.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|	Таблица.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
    |	Таблица.НалоговоеНазначение КАК НалоговоеНазначение,
    |	Таблица.НалоговоеНазначение21 КАК НалоговоеНазначение21,
	|	Таблица.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Таблица.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|	Таблица.КорРазделУчета КАК КорРазделУчета,
	|	Таблица.КорВидЗапасов КАК КорВидЗапасов,
	|	Таблица.КорОрганизация КАК КорОрганизация,
	|	Таблица.КорСтоимость КАК КорСтоимость,
	|	Таблица.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Таблица.ЗаказКлиента КАК ЗаказКлиента,
	|	Таблица.Подразделение КАК Подразделение,
	|	Таблица.АналитикаРасходов КАК АналитикаРасходов,
	|	Таблица.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|	Таблица.СтатьяДоходов КАК СтатьяДоходов,
	|	Таблица.АналитикаДоходов КАК АналитикаДоходов,
	|	Таблица.ПериодПродажи КАК ПериодПродажи,
	|	Таблица.СтатьяАктивовПассивов КАК СтатьяАктивовПассивов,
	|	Таблица.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	Таблица.ДокументДвижения КАК ДокументДвижения,
	|	Таблица.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	Таблица.ГруппаПродукции КАК ГруппаПродукции,
	|	Таблица.КорПартия КАК КорПартия,
	|	Таблица.КорАналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
	|	Таблица.КорАналитикаФинансовогоУчета КАК КорАналитикаФинансовогоУчета,
    |	Таблица.КорНалоговоеНазначение КАК КорНалоговоеНазначение,
	|	Таблица.НДСУпр КАК НДСУпр,
	|	Таблица.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	Таблица.ТипЗаписи КАК ТипЗаписи,
	|	Таблица.ДокументИсточник КАК ДокументИсточник,
	|	Таблица.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	СУММА(Таблица.Количество) КАК КоличествоИзменение,
	|	СУММА(Таблица.Стоимость) КАК СтоимостьИзменение,
	|	СУММА(Таблица.СтоимостьБезНДС) КАК СтоимостьБезНДСИзменение,
	|	СУММА(Таблица.ДопРасходы) КАК ДопРасходыИзменение,
	|	СУММА(Таблица.ДопРасходыБезНДС) КАК ДопРасходыБезНДСИзменение,
	|	СУММА(Таблица.СтоимостьРегл) КАК СтоимостьРеглИзменение,
	|	СУММА(Таблица.СтоимостьРеглБезНДС) КАК СтоимостьРеглБезНДСИзменение,
	|	СУММА(Таблица.НДСРегл) КАК НДСРеглИзменение,
	|	СУММА(Таблица.ПостояннаяРазница) КАК ПостояннаяРазницаИзменение,
	|	СУММА(Таблица.ВременнаяРазница) КАК ВременнаяРазницаИзменение,
	|	СУММА(Таблица.СтоимостьЗабалансовая) КАК СтоимостьЗабалансоваяИзменение,
	|	СУММА(Таблица.Трудозатраты) КАК ТрудозатратыИзменение,
	|	СУММА(Таблица.ПостатейныеПостоянныеСНДС) КАК ПостатейныеПостоянныеСНДСИзменение,
	|	СУММА(Таблица.ПостатейныеПеременныеСНДС) КАК ПостатейныеПеременныеСНДСИзменение,
	|	СУММА(Таблица.ПостатейныеПостоянныеБезНДС) КАК ПостатейныеПостоянныеБезНДСИзменение,
	|	СУММА(Таблица.ПостатейныеПеременныеБезНДС) КАК ПостатейныеПеременныеБезНДСИзменение,
	|	СУММА(Таблица.СтоимостьЗабалансоваяРегл) КАК СтоимостьЗабалансоваяРеглИзменение,
    |	СУММА(Таблица.ДопРасходыРегл) КАК ДопРасходыРеглИзменение,
    |	СУММА(Таблица.ТрудозатратыРегл) КАК ТрудозатратыРеглИзменение,
    |	СУММА(Таблица.ПостатейныеПостоянныеРегл) КАК ПостатейныеПостоянныеРеглИзменение,
    |	СУММА(Таблица.ПостатейныеПеременныеРегл) КАК ПостатейныеПеременныеРеглИзменение,
    |	СУММА(Таблица.ДопРасходыРеглБезНДС) КАК ДопРасходыРеглБезНДСИзменение,
    |	СУММА(Таблица.ПостатейныеПостоянныеРеглБезНДС) КАК ПостатейныеПостоянныеРеглБезНДСИзменение,
    |	СУММА(Таблица.ПостатейныеПеременныеРеглБезНДС) КАК ПостатейныеПеременныеРеглБезНДСИзменение,
    |	СУММА(Таблица.СтоимостьУпр) КАК СтоимостьУпрИзменение,
    |	СУММА(Таблица.ДопРасходыУпр) КАК ДопРасходыУпрИзменение,
    |	СУММА(Таблица.ТрудозатратыУпр) КАК ТрудозатратыУпрИзменение,
    |	СУММА(Таблица.ПостатейныеПостоянныеУпр) КАК ПостатейныеПостоянныеУпрИзменение,
    |	СУММА(Таблица.ПостатейныеПеременныеУпр) КАК ПостатейныеПеременныеУпрИзменение
    |	, СУММА(Таблица.СтоимостьУпрБезНДС) КАК СтоимостьУпрБезНДСИзменение,
    |	СУММА(Таблица.ДопРасходыУпрБезНДС) КАК ДопРасходыУпрБезНДСИзменение,
    |	СУММА(Таблица.ПостатейныеПостоянныеУпрБезНДС) КАК ПостатейныеПостоянныеУпрБезНДСИзменение,
    |	СУММА(Таблица.ПостатейныеПеременныеУпрБезНДС) КАК ПостатейныеПеременныеУпрБезНДСИзменение
	|ПОМЕСТИТЬ ТаблицаИзмененийСебестоимостьТоваров
	|ИЗ
	|	(ВЫБРАТЬ
	|		Себестоимость.Период КАК Период,
	|		Себестоимость.Регистратор КАК Регистратор,
	|		Себестоимость.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Себестоимость.РазделУчета КАК РазделУчета,
	|		Себестоимость.ВидЗапасов КАК ВидЗапасов,
	|		Себестоимость.Организация КАК Организация,
	|		Себестоимость.Партия КАК Партия,
	|		Себестоимость.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|		Себестоимость.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
    |		Себестоимость.НалоговоеНазначение КАК НалоговоеНазначение,
    |		Себестоимость.НалоговоеНазначение21 КАК НалоговоеНазначение21,
	|		Себестоимость.Количество КАК Количество,
	|		Себестоимость.Стоимость КАК Стоимость,
	|		Себестоимость.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|		Себестоимость.ДопРасходы КАК ДопРасходы,
	|		Себестоимость.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|		Себестоимость.СтоимостьРегл КАК СтоимостьРегл,
    |		Себестоимость.СтоимостьРеглБезНДС КАК СтоимостьРеглБезНДС,
    |		Себестоимость.НДСРегл КАК НДСРегл,
	|		Себестоимость.ПостояннаяРазница КАК ПостояннаяРазница,
	|		Себестоимость.ВременнаяРазница КАК ВременнаяРазница,
	|		Себестоимость.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|		Себестоимость.Трудозатраты КАК Трудозатраты,
	|		Себестоимость.ПостатейныеПостоянныеСНДС КАК ПостатейныеПостоянныеСНДС,
	|		Себестоимость.ПостатейныеПеременныеСНДС КАК ПостатейныеПеременныеСНДС,
	|		Себестоимость.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
	|		Себестоимость.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
	|		Себестоимость.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
    |		Себестоимость.ДопРасходыРегл КАК ДопРасходыРегл,
    |		Себестоимость.ТрудозатратыРегл КАК ТрудозатратыРегл,
    |		Себестоимость.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
    |		Себестоимость.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,
    |		Себестоимость.ДопРасходыРеглБезНДС КАК ДопРасходыРеглБезНДС,
    |		Себестоимость.ПостатейныеПостоянныеРеглБезНДС КАК ПостатейныеПостоянныеРеглБезНДС,
    |		Себестоимость.ПостатейныеПеременныеРеглБезНДС КАК ПостатейныеПеременныеРеглБезНДС,
    |		Себестоимость.СтоимостьУпр КАК СтоимостьУпр,
    |		Себестоимость.ДопРасходыУпр КАК ДопРасходыУпр,
    |		Себестоимость.ТрудозатратыУпр КАК ТрудозатратыУпр,
    |		Себестоимость.ПостатейныеПостоянныеУпр КАК ПостатейныеПостоянныеУпр,
    |		Себестоимость.ПостатейныеПеременныеУпр КАК ПостатейныеПеременныеУпр,
    |		Себестоимость.СтоимостьУпрБезНДС КАК СтоимостьУпрБезНДС,
    |		Себестоимость.ДопРасходыУпрБезНДС КАК ДопРасходыУпрБезНДС,
    |		Себестоимость.ПостатейныеПостоянныеУпрБезНДС КАК ПостатейныеПостоянныеУпрБезНДС,
    |		Себестоимость.ПостатейныеПеременныеУпрБезНДС КАК ПостатейныеПеременныеУпрБезНДС,
	|		Себестоимость.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Себестоимость.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|		Себестоимость.КорРазделУчета КАК КорРазделУчета,
	|		Себестоимость.КорВидЗапасов КАК КорВидЗапасов,
	|		Себестоимость.КорОрганизация КАК КорОрганизация,
	|		Себестоимость.КорСтоимость КАК КорСтоимость,
	|		Себестоимость.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Себестоимость.ЗаказКлиента КАК ЗаказКлиента,
	|		Себестоимость.Подразделение КАК Подразделение,
	|		Себестоимость.АналитикаРасходов КАК АналитикаРасходов,
	|		Себестоимость.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|		Себестоимость.СтатьяДоходов КАК СтатьяДоходов,
	|		Себестоимость.АналитикаДоходов КАК АналитикаДоходов,
	|		Себестоимость.ПериодПродажи КАК ПериодПродажи,
	|		Себестоимость.СтатьяАктивовПассивов КАК СтатьяАктивовПассивов,
	|		Себестоимость.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	    Себестоимость.ДокументДвижения КАК ДокументДвижения,
	|		Себестоимость.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|		Себестоимость.ГруппаПродукции КАК ГруппаПродукции,
	|		Себестоимость.КорПартия КАК КорПартия,
	|		Себестоимость.КорАналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
	|		Себестоимость.КорАналитикаФинансовогоУчета КАК КорАналитикаФинансовогоУчета,
    |		Себестоимость.КорНалоговоеНазначение КАК КорНалоговоеНазначение,
	|		Себестоимость.НДСУпр КАК НДСУпр,
	|		Себестоимость.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|		Себестоимость.ТипЗаписи КАК ТипЗаписи,
	|		Себестоимость.ДокументИсточник КАК ДокументИсточник,
	|		Себестоимость.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности
	|	ИЗ
	|		СебестоимостьТоваровПередЗаписью КАК Себестоимость
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Себестоимость.Период КАК Период,
	|		Себестоимость.Регистратор КАК Регистратор,
	|		Себестоимость.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		Себестоимость.РазделУчета КАК РазделУчета,
	|		Себестоимость.ВидЗапасов КАК ВидЗапасов,
	|		Себестоимость.Организация КАК Организация,
	|		Себестоимость.Партия КАК Партия,
	|		Себестоимость.АналитикаУчетаПартий КАК АналитикаУчетаПартий,
	|		Себестоимость.АналитикаФинансовогоУчета КАК АналитикаФинансовогоУчета,
    |		Себестоимость.НалоговоеНазначение КАК НалоговоеНазначение,
    |		Себестоимость.НалоговоеНазначение21 КАК НалоговоеНазначение21,
	|		-Себестоимость.Количество КАК Количество,
	|		-Себестоимость.Стоимость КАК Стоимость,
	|		-Себестоимость.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|		-Себестоимость.ДопРасходы КАК ДопРасходы,
	|		-Себестоимость.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|		-Себестоимость.СтоимостьРегл КАК СтоимостьРегл,
    |		-Себестоимость.СтоимостьРеглБезНДС КАК СтоимостьРеглБезНДС,
    |		-Себестоимость.НДСРегл КАК НДСРегл,
	|		-Себестоимость.ПостояннаяРазница КАК ПостояннаяРазница,
	|		-Себестоимость.ВременнаяРазница КАК ВременнаяРазница,
	|		-Себестоимость.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|		-Себестоимость.Трудозатраты КАК Трудозатраты,
	|		-Себестоимость.ПостатейныеПостоянныеСНДС КАК ПостатейныеПостоянныеСНДС,
	|		-Себестоимость.ПостатейныеПеременныеСНДС КАК ПостатейныеПеременныеСНДС,
	|		-Себестоимость.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
	|		-Себестоимость.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
	|		-Себестоимость.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
    |		-Себестоимость.ДопРасходыРегл КАК ДопРасходыРегл,
    |		-Себестоимость.ТрудозатратыРегл КАК ТрудозатратыРегл,
    |		-Себестоимость.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
    |		-Себестоимость.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,
    |		-Себестоимость.ДопРасходыРеглБезНДС КАК ДопРасходыРеглБезНДС,
    |		-Себестоимость.ПостатейныеПостоянныеРеглБезНДС КАК ПостатейныеПостоянныеРеглБезНДС,
    |		-Себестоимость.ПостатейныеПеременныеРеглБезНДС КАК ПостатейныеПеременныеРеглБезНДС,
    |		-Себестоимость.СтоимостьУпр КАК СтоимостьУпр,
    |		-Себестоимость.ДопРасходыУпр КАК ДопРасходыУпр,
    |		-Себестоимость.ТрудозатратыУпр КАК ТрудозатратыУпр,
    |		-Себестоимость.ПостатейныеПостоянныеУпр КАК ПостатейныеПостоянныеУпр,
    |		-Себестоимость.ПостатейныеПеременныеУпр КАК ПостатейныеПеременныеУпр,
    |		-Себестоимость.СтоимостьУпрБезНДС КАК СтоимостьУпрБезНДС,
    |		-Себестоимость.ДопРасходыУпрБезНДС КАК ДопРасходыУпрБезНДС,
    |		-Себестоимость.ПостатейныеПостоянныеУпрБезНДС КАК ПостатейныеПостоянныеУпрБезНДС,
    |		-Себестоимость.ПостатейныеПеременныеУпрБезНДС КАК ПостатейныеПеременныеУпрБезНДС,
	|		Себестоимость.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		Себестоимость.КорАналитикаУчетаНоменклатуры КАК КорАналитикаУчетаНоменклатуры,
	|		Себестоимость.КорРазделУчета КАК КорРазделУчета,
	|		Себестоимость.КорВидЗапасов КАК КорВидЗапасов,
	|		Себестоимость.КорОрганизация КАК КорОрганизация,
	|		Себестоимость.КорСтоимость КАК КорСтоимость,
	|		Себестоимость.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		Себестоимость.ЗаказКлиента КАК ЗаказКлиента,
	|		Себестоимость.Подразделение КАК Подразделение,
	|		Себестоимость.АналитикаРасходов КАК АналитикаРасходов,
	|		Себестоимость.СтатьяРасходовСписания КАК СтатьяРасходовСписания,
	|		Себестоимость.СтатьяДоходов КАК СтатьяДоходов,
	|		Себестоимость.АналитикаДоходов КАК АналитикаДоходов,
	|		Себестоимость.ПериодПродажи КАК ПериодПродажи,
	|		Себестоимость.СтатьяАктивовПассивов КАК СтатьяАктивовПассивов,
	|		Себестоимость.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|		Себестоимость.ДокументДвижения КАК ДокументДвижения,
	|		Себестоимость.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|		Себестоимость.ГруппаПродукции КАК ГруппаПродукции,
	|		Себестоимость.КорПартия КАК КорПартия,
	|		Себестоимость.КорАналитикаУчетаПартий КАК КорАналитикаУчетаПартий,
	|		Себестоимость.КорАналитикаФинансовогоУчета КАК КорАналитикаФинансовогоУчета,
    |		Себестоимость.КорНалоговоеНазначение КАК КорНалоговоеНазначение,
	|		Себестоимость.НДСУпр КАК НДСУпр,
	|		Себестоимость.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|		Себестоимость.ТипЗаписи КАК ТипЗаписи,
	|		Себестоимость.ДокументИсточник КАК ДокументИсточник,
	|		Себестоимость.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров КАК Себестоимость
	|	ГДЕ
	|		Себестоимость.Регистратор = &Регистратор) КАК Таблица
	|СГРУППИРОВАТЬ ПО
	|	Таблица.Период,
	|	Таблица.Регистратор,
	|	Таблица.АналитикаУчетаНоменклатуры,
	|	Таблица.РазделУчета,
	|	Таблица.ВидЗапасов,
	|	Таблица.Организация,
	|	Таблица.Партия,
	|	Таблица.АналитикаУчетаПартий,
	|	Таблица.АналитикаФинансовогоУчета,
    |	Таблица.НалоговоеНазначение,
    |	Таблица.НалоговоеНазначение21,
	|	Таблица.ХозяйственнаяОперация,
	|	Таблица.КорАналитикаУчетаНоменклатуры,
	|	Таблица.КорРазделУчета,
	|	Таблица.КорВидЗапасов,
	|	Таблица.КорОрганизация,
	|	Таблица.КорСтоимость,
	|	Таблица.АналитикаУчетаПоПартнерам,
	|	Таблица.ЗаказКлиента,
	|	Таблица.Подразделение,
	|	Таблица.АналитикаРасходов,
	|	Таблица.СтатьяРасходовСписания,
	|	Таблица.СтатьяДоходов,
	|	Таблица.АналитикаДоходов,
	|	Таблица.ПериодПродажи,
	|	Таблица.СтатьяАктивовПассивов,
	|	Таблица.АналитикаАктивовПассивов,
	|	Таблица.ДокументДвижения,
	|	Таблица.ИдентификаторСтроки,
	|	Таблица.ГруппаПродукции,
	|	Таблица.КорПартия,
	|	Таблица.КорАналитикаУчетаПартий,
	|	Таблица.КорАналитикаФинансовогоУчета,
    |	Таблица.КорНалоговоеНазначение,
	|	Таблица.НДСУпр,
	|	Таблица.СтатьяКалькуляции,
	|	Таблица.ТипЗаписи,
	|	Таблица.ДокументИсточник,
	|	Таблица.КорНаправлениеДеятельности
	|ИМЕЮЩИЕ
	|	СУММА(Таблица.Количество) <> 0
	|	ИЛИ СУММА(Таблица.Стоимость) <> 0
	|	ИЛИ СУММА(Таблица.СтоимостьБезНДС) <> 0
	|	ИЛИ СУММА(Таблица.ДопРасходы) <> 0
	|	ИЛИ СУММА(Таблица.ДопРасходыБезНДС) <> 0
	|	ИЛИ СУММА(Таблица.СтоимостьРегл) <> 0
	|	ИЛИ СУММА(Таблица.СтоимостьРеглБезНДС) <> 0
	|	ИЛИ СУММА(Таблица.НДСРегл) <> 0
	|	ИЛИ СУММА(Таблица.ПостояннаяРазница) <> 0
	|	ИЛИ СУММА(Таблица.ВременнаяРазница) <> 0
	|	ИЛИ СУММА(Таблица.СтоимостьЗабалансовая) <> 0
	|	ИЛИ СУММА(Таблица.Трудозатраты) <> 0
	|	ИЛИ СУММА(Таблица.ПостатейныеПостоянныеСНДС) <> 0
	|	ИЛИ СУММА(Таблица.ПостатейныеПеременныеСНДС) <> 0
	|	ИЛИ СУММА(Таблица.ПостатейныеПостоянныеБезНДС) <> 0
	|	ИЛИ СУММА(Таблица.ПостатейныеПеременныеБезНДС) <> 0
	|	ИЛИ СУММА(Таблица.СтоимостьЗабалансоваяРегл) <> 0
	|	ИЛИ СУММА(Таблица.ДопРасходыРегл) <> 0
	|	ИЛИ СУММА(Таблица.ТрудозатратыРегл) <> 0
	|	ИЛИ СУММА(Таблица.ПостатейныеПостоянныеРегл) <> 0
	|	ИЛИ СУММА(Таблица.ПостатейныеПеременныеРегл) <> 0
	|	ИЛИ СУММА(Таблица.СтоимостьУпр) <> 0
	|	ИЛИ СУММА(Таблица.ДопРасходыУпр) <> 0
	|	ИЛИ СУММА(Таблица.ТрудозатратыУпр) <> 0
	|	ИЛИ СУММА(Таблица.ПостатейныеПостоянныеУпр) <> 0
	|	ИЛИ СУММА(Таблица.ПостатейныеПеременныеУпр) <> 0
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СебестоимостьТоваровПередЗаписью");
	
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СохранитьНеИзмененныеПервичныеДвижения()
	
	Если РасчетСебестоимостиПовтИсп.ЗначенияТехнологическихПараметров().НеСохранятьРасчетныеДвижения
	 ИЛИ ДополнительныеСвойства.Свойство("НеСохранятьРасчетныеДвижения") Тогда
		Возврат;
	КонецЕсли;
	
	Регистратор     = Отбор.Регистратор.Значение;
	МетаРегистратор = Регистратор.Метаданные(); // ОбъектМетаданныхРегистрНакопления
	
	Если ДополнительныеСвойства.Свойство("ДатаРегистратора") Тогда
		ДатаРегистратора = ДополнительныеСвойства.ДатаРегистратора;
	Иначе
		ДатаРегистратора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Регистратор, "Дата");
	КонецЕсли;
	
	Если НЕ РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии22(НачалоМесяца(ДатаРегистратора)) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("ТочноНужноСохранитьДвижения") Тогда
		Если Не ДополнительныеСвойства.Свойство("СвойстваДокумента")
			Или ДополнительныеСвойства.СвойстваДокумента.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	#Область ДополнитьДвижениямиИзИБЗаПериод
	
	// Если при проведении документа известно, что данные какого-то периода точно не изменились,
	// то надо просто добавить их в набор записей из ИБ.
	Если ДополнительныеСвойства.Свойство("ДополнитьДвижениямиИзИБЗаПериод") Тогда
		
		Запрос.УстановитьПараметр("НачалоПериода", ДополнительныеСвойства.ДополнитьДвижениямиИзИБЗаПериод.НачалоПериода);
		Запрос.УстановитьПараметр("КонецПериода",  ДополнительныеСвойства.ДополнитьДвижениямиИзИБЗаПериод.КонецПериода);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	*
		|ИЗ
		|	РегистрНакопления.СебестоимостьТоваров КАК Т
		|ГДЕ
		|	Т.Регистратор = &Регистратор
		|	И Т.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ Т.РасчетПартий
		|	И НЕ Т.РасчетСебестоимости";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ЭтотОбъект.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КонецЦикла;
		
	КонецЕсли;
	
	#КонецОбласти
	
	ТаблицаЗаписей = ЭтотОбъект.Выгрузить();
	Запрос.УстановитьПараметр("НаборЗаписей", 				ТаблицаЗаписей);
	Запрос.УстановитьПараметр("ТипыЗаписейПервичныхПартий", РасчетСебестоимостиПрикладныеАлгоритмы.ТипыЗаписейПервичныхПартий());
	
	// Создадим ВТПравилаЗаполненияПоляТипЗаписи
	РасчетСебестоимостиПрикладныеАлгоритмы.СоздатьТаблицуПравилЗаполненияПоляТипЗаписи(
		Запрос.МенеджерВременныхТаблиц,
		РасчетСебестоимостиПовтИсп.ПравилаЗаполненияПоляТипЗаписи(МетаРегистратор.Имя));
	
	#Область ШаблоныТекстаЗапроса
	
	// Подготовим шаблоны для формирования текстов запросов.
	ПоляИсключения    = Новый Структура("НомерСтроки, Активность, Регистратор, МоментВремени");
    ПоляПартий     	  = Новый Структура("Партия, АналитикаУчетаПартий, АналитикаФинансовогоУчета, НалоговоеНазначение,
    	|КорПартия, КорАналитикаУчетаПартий, КорАналитикаФинансовогоУчета,
    	|КорАналитикаУчетаНоменклатуры, КорНалоговоеНазначение, ДокументИсточник, РасчетНеЗавершен");
	НесуммируемыеПоля = Новый Структура("КодСтроки");
    
	Если МетаРегистратор <> Метаданные.Документы.ПеремещениеТоваров
	 И МетаРегистратор <> Метаданные.Документы.КорректировкаНазначенияТоваров
	 И МетаРегистратор <> Метаданные.Документы.ВнутреннееПотреблениеТоваров
	 И МетаРегистратор <> Метаданные.Документы.ПересортицаТоваров
	 И МетаРегистратор <> Метаданные.Документы.ПорчаТоваров Тогда
        // Для перечисленных типов документов кор. налоговое назначение определяется в РасчетСебестоимостиЗаполнениеПартий.ТекстТекущиеОборотыПартийТоваров()
		// Для остальных документов этот реквизит определяется при проведении документа.
        ПоляПартий.Удалить("КорНалоговоеНазначение");
 	КонецЕсли;
 	
	ТекстПоляРегистра = "";
	ТекстПоляРегистраСМинусом = "";
	ТекстПоляРегистраБезПартий = "";
	ТекстПоляГруппировкиБезПартий = "";
	ТекстПоляСуммирования = "";
	ТекстПоляУсловия = "";
	
	Для Каждого ТекущаяКолонка Из ТаблицаЗаписей.Колонки Цикл
		
		Если ПоляИсключения.Свойство(ТекущаяКолонка.Имя) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭтоСуммируемоеПоле = Метаданные().Ресурсы.Найти(ТекущаяКолонка.Имя) <> Неопределено
			ИЛИ (Метаданные().Реквизиты.Найти(ТекущаяКолонка.Имя) <> Неопределено
					И ТекущаяКолонка.ТипЗначения.СодержитТип(Тип("Число"))
					И НЕ НесуммируемыеПоля.Свойство(ТекущаяКолонка.Имя));
		 
		ТекстПоляРегистра = ТекстПоляРегистра + ?(ТекстПоляРегистра = "", "", ",
			|	") + "Т." + ТекущаяКолонка.Имя;
		ТекстПоляРегистраСМинусом = ТекстПоляРегистраСМинусом + ?(ТекстПоляРегистраСМинусом = "", "", ",
			|	") + ?(ЭтоСуммируемоеПоле, "-", "") + "Т." + ТекущаяКолонка.Имя;
			
		Если ЭтоСуммируемоеПоле Тогда
			
			ТекстПоляСуммирования = ТекстПоляСуммирования + ?(ТекстПоляСуммирования = "", "", ",
				|	") + "СУММА(Т." + ТекущаяКолонка.Имя + ") КАК " + ТекущаяКолонка.Имя;
			ТекстПоляУсловия = ТекстПоляУсловия + ?(ТекстПоляУсловия = "", "", "
				|	ИЛИ ") + "СУММА(Т." + ТекущаяКолонка.Имя + ") <> 0";
			
		Иначе
			
			Если НЕ ПоляПартий.Свойство(ТекущаяКолонка.Имя) Тогда
				
                Если НРег(ТекущаяКолонка.Имя) = НРег("КорНалоговоеНазначение") Тогда
					
                    // Для приходных движений КорНалоговоеНазначение не заполняется при проведении документа, он заполняется при расчете партий для целей учета НДС.
                    // Для расходных движений КорНалоговоеНазначение всегда заполняется самим документом при проведении.
					ТекстПоляРегистраБезПартий = ТекстПоляРегистраБезПартий + ?(ТекстПоляРегистраБезПартий = "", "", ",
						|	") + "ВЫБОР КОГДА Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение)
						|	  И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
						|		ТОГДА НЕОПРЕДЕЛЕНО
						| ИНАЧЕ Т." + ТекущаяКолонка.Имя + " КОНЕЦ КАК " + ТекущаяКолонка.Имя;
					ТекстПоляГруппировкиБезПартий = ТекстПоляГруппировкиБезПартий + ?(ТекстПоляГруппировкиБезПартий = "", "", ",
						|	") + "ВЫБОР КОГДА Т.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.Перемещение)
						|	  И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
						|		ТОГДА НЕОПРЕДЕЛЕНО
						| ИНАЧЕ Т." + ТекущаяКолонка.Имя + " КОНЕЦ";
					
				Иначе
						
					ТекстПоляРегистраБезПартий = ТекстПоляРегистраБезПартий + ?(ТекстПоляРегистраБезПартий = "", "", ",
						|	") + "Т." + ТекущаяКолонка.Имя;
					ТекстПоляГруппировкиБезПартий = ТекстПоляГруппировкиБезПартий + ?(ТекстПоляГруппировкиБезПартий = "", "", ",
						|	") + "Т." + ТекущаяКолонка.Имя;
					
				КонецЕсли;
				
			Иначе
				
				Если НРег(ТекущаяКолонка.Имя) = НРег("ДокументИсточник") Тогда
					ДопУсловиеДляПоля =
						 "ИЛИ (Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) И Правила.ДокументИсточникВПриходе)
					|	  ИЛИ (Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) И Правила.ДокументИсточникВРасходе)
					|	  ";
                ИначеЕсли НРег(ТекущаяКолонка.Имя) = НРег("КорНалоговоеНазначение")
				 ИЛИ НРег(ТекущаяКолонка.Имя) = НРег("КорАналитикаУчетаНоменклатуры") Тогда
					ДопУсловиеДляПоля =
						 "И Т.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
					|	  ";
				Иначе
					ДопУсловиеДляПоля = "";
				КонецЕсли;
				
				ТекстПоляРегистраБезПартий = ТекстПоляРегистраБезПартий + ?(ТекстПоляРегистраБезПартий = "", "", ",
					|	") + "ВЫБОР КОГДА Т.ТипЗаписи В (&ТипыЗаписейПервичныхПартий)
					|	  " + ДопУсловиеДляПоля + "
					|		ТОГДА Т." + ТекущаяКолонка.Имя
					+ " ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ КАК " + ТекущаяКолонка.Имя;
				ТекстПоляГруппировкиБезПартий = ТекстПоляГруппировкиБезПартий + ?(ТекстПоляГруппировкиБезПартий = "", "", ",
					|	") + "ВЫБОР КОГДА Т.ТипЗаписи В (&ТипыЗаписейПервичныхПартий)
					|	  " + ДопУсловиеДляПоля + "
					|		ТОГДА Т." + ТекущаяКолонка.Имя
					+ " ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ";
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	#КонецОбласти
	
	#Область СозданиеВременныхТаблиц
	
	// Проанализируем наличие измененных первичных движений в разрезе периодов (месяцев).
	ШаблонТекстаЗапроса =
	"ВЫБРАТЬ
	|	%1
	|ПОМЕСТИТЬ ВТНаборЗаписей
	|ИЗ
	|	&НаборЗаписей КАК Т
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	%3,
	|	%4
	|ПОМЕСТИТЬ ВТИзмененныеДвижения
	|ИЗ
	|(ВЫБРАТЬ
	|	%1
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|ГДЕ
	|	Т.Регистратор = &Регистратор
	|	И НЕ Т.РасчетПартий
	|	И НЕ Т.РасчетСебестоимости
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	%2
	|ИЗ
	|	ВТНаборЗаписей КАК Т
	|ГДЕ
	|	НЕ Т.РасчетПартий
	|	И НЕ Т.РасчетСебестоимости
	|) КАК Т
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТПравилаЗаполненияПоляТипЗаписи КАК Правила
	|		ПО Правила.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
	|			ИЛИ Т.ХозяйственнаяОперация = Правила.ХозяйственнаяОперация
	|
	|СГРУППИРОВАТЬ ПО
	|	%5
	|ИМЕЮЩИЕ
	|	%6
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|
	|ВЫБРАТЬ
	|	Т.Период КАК Период,
	|	МАКСИМУМ(Т.ЕстьИзмененныеДвижения) КАК ЕстьИзмененныеДвижения
	|ПОМЕСТИТЬ ВТПериодыДвижений
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		НАЧАЛОПЕРИОДА(Т.Период, МЕСЯЦ) КАК Период,
	|		ЛОЖЬ КАК ЕстьИзмененныеДвижения
	|	ИЗ
	|		ВТНаборЗаписей КАК Т
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		НАЧАЛОПЕРИОДА(Т.Период, МЕСЯЦ) КАК Период,
	|		ИСТИНА КАК ЕстьИзмененныеДвижения
	|	ИЗ
	|		ВТИзмененныеДвижения КАК Т
	|	) КАК Т
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Период
	|;
	|";
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонТекстаЗапроса,
		ТекстПоляРегистра,
		ТекстПоляРегистраСМинусом,
		ТекстПоляРегистраБезПартий,
		ТекстПоляСуммирования,
		ТекстПоляГруппировкиБезПартий,
		ТекстПоляУсловия);
		
	Запрос.Выполнить(); // сформируем временные таблицы с описанием движений
	
	#КонецОбласти
	
	#Область ЗаполнениеНабораЗаписей
	
	// Движения не измененных периодов возьмем из ИБ,
	// а движения измененных периодов и расчетные движения - из набора записей.
	ШаблонТекстаЗапроса =
	"ВЫБРАТЬ
	|	&Регистратор КАК Регистратор,
	|	%1
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК Т
	|ГДЕ
	|	Т.Регистратор = &Регистратор
	|	И НЕ Т.РасчетПартий
	|	И НЕ Т.РасчетСебестоимости
	|	И НАЧАЛОПЕРИОДА(Т.Период, МЕСЯЦ) В
	|		(ВЫБРАТЬ Т.Период
	|		 ИЗ ВТПериодыДвижений КАК Т
	|		 ГДЕ НЕ Т.ЕстьИзмененныеДвижения)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Регистратор КАК Регистратор,
	|	%1
	|ИЗ
	|	ВТНаборЗаписей КАК Т
	|ГДЕ
	|	НЕ Т.РасчетПартий
	|	И НЕ Т.РасчетСебестоимости
	|	И НАЧАЛОПЕРИОДА(Т.Период, МЕСЯЦ) В
	|		(ВЫБРАТЬ Т.Период
	|		 ИЗ ВТПериодыДвижений КАК Т
	|		 ГДЕ Т.ЕстьИзмененныеДвижения)
	|";
	
	Запрос.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонТекстаЗапроса,
		ТекстПоляРегистра);
	
	ТаблицаЗаписей = Запрос.Выполнить().Выгрузить();
	
	ЭтотОбъект.Загрузить(ТаблицаЗаписей);
	
	#КонецОбласти
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
