#Область СлужебныеПроцедурыИФункции

// Возвращает представление документа ввода остатков.
// 
// Параметры:
// 	Документ - ДокументСсылка.ВводОстатков - Ссылка на документ ввода остатков.
// 	НомерДокумента - Строка - Номер документа ввода остатков.
// 	ДатаДокумента - Дата - Дата документа ввода остатков.
// 	ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа ввода остатков.
// Возвращаемое значение:
// 	Строка - Строковое представление документа ввода остатков.
//
Функция ЗаголовокДокументаВводОстатковПоХозяйственнойОперации(Документ, НомерДокумента, ДатаДокумента, ХозяйственнаяОперация) Экспорт
	Возврат ВводОстатковСервер.ЗаголовокДокументаВводОстатковПоХозяйственнойОперации(Документ, НомерДокумента, ДатаДокумента, ХозяйственнаяОперация);
КонецФункции

Функция ПолучитьПараметрыКопированияДокумента(ХозяйственнаяОперация) Экспорт
	Возврат ВводОстатковСервер.ПолучитьПараметрыКопированияДокумента(ХозяйственнаяОперация);
КонецФункции
	
Функция ПолучениеФормыВводаОстатковОПродажахЗаПрошлыеПериоды(ХозяйственнаяОперация) Экспорт
	Возврат ВводОстатковСервер.ПолучениеФормыВводаОстатковОПродажахЗаПрошлыеПериоды(ХозяйственнаяОперация);
КонецФункции
#КонецОбласти
