&НаКлиенте
Процедура ВестиМесячнуюНумерациюНалоговыхДокументовПриИзменении(Элемент)
	
	Если Запись.ВестиМесячнуюНумерациюНалоговыхДокументов Тогда
		Запись.ВестиДневнуюНумерациюНалоговыхДокументов = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВестиДневнуюНумерациюНалоговыхДокументовПриИзменении(Элемент)
	
	Если Запись.ВестиДневнуюНумерациюНалоговыхДокументов Тогда
		// остальные виды нумерации отключаем за ненадобностью
		Запись.ВестиМесячнуюНумерациюНалоговыхДокументов 					= Ложь;
		Запись.ВестиРаздельнуюНумерациюНалоговыхДокументовПоНеНДСОперациям = Ложь;
		Запись.ВестиНумерациюНалоговыхДокументовБезУчетаОбособленныхПодразделений = Ложь;		
	КонецЕсли;

КонецПроцедуры
