#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	ПараметрыНабора.Используется = Константы.ИспользоватьОказаниеАгентскихУслугПриЗакупке.Получить();	
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_ОтчетКомитентуОЗакупках", ПараметрыНабора);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
