
#Область ПрограммныйИнтерфейс

#Область М21

// Печатает М21
//
// Параметры:
//  ОписаниеКоманды - Структура
//
Функция ПечатьМ21(ОписаниеКоманды) Экспорт
	                    	
	ОчиститьСообщения();
	// не поддерживаем множественную печать
	Если ОписаниеКоманды.ОбъектыПечати.Количество() > 1 Тогда
        ТекстСообщения = НСтр("ru='Не поддерживается групповое формирование печатной формы ""М-21"" через список документов ""Пересчеты товаров"".';uk='Не підтримується групове формування друкованої форми ""М-21"" через список документів ""Перерахунки товарів"".'");	
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыФормирования = УправлениеПечатьюУТВызовСервера.ПолучитьПараметрыФормирования(ОписаниеКоманды.ОбъектыПечати);
	ПараметрыФормирования.Вставить("Идентификатор", ОписаниеКоманды.Идентификатор);
	
	ОткрытьФорму("Документ.ИнвентаризационнаяОпись.Форма.ФормаПечати",
		ПараметрыФормирования, ОписаниеКоманды.Форма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецФункции

#КонецОбласти


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
