
#Область СлужебныйПрограммныйИнтерфейс

// Выполняет действие при нажатии гиперссылки в отчете "Оформляемые документы" по документу расхождений.
//
// Параметры:
//  Форма               - ФормаКлиентскогоПриложения - форма, из которой происходит вызов 
//  ОписаниеКоманды     - Строка - описание выполняемого действия, "Изменить" или "Оформить"
//  АктОРасхождениях    - Документ.АктОРасхожденияхПослеОтгрузки - отрабатываемый акт о расхождениях.
//  ОснованиеАкта       - Документ.РеализацияТоваровУслуг,
//                      - Документ.ВозвратТоваровПоставщику      - основание акта о расхождениях, по которому
//                                                                 выполняются действия
//  ОформляемыйДокумент - тут лежит пока либо пустая ссылка оформляемого типа, либо структура из такой же ссылки и хоз. операции.
//
Процедура ОбработкаКомандыОтчетаОформлениеДокументов(Форма, ОписаниеКоманды, АктОРасхождениях, ОснованиеАкта, ОформляемыйДокумент) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

//++ Локализация
//-- Локализация

#КонецОбласти