#Область ПрограммныйИнтерфейс

Функция КоличествоАкцизныхМарокСоответствуетКоличествуТовара(Знач КоличествоАкцизныхМарок, Знач КоличествоТовара) Экспорт
	
	МинимальноеКоличествоАМ = 0;
	МаксимальноеКоличествоАМ = 0;
	
	ЦелоеКоличествоТовара = Цел(КоличествоТовара);
	ДробноеКоличествоТовара = КоличествоТовара - ЦелоеКоличествоТовара;
	
	Если ЗначениеЗаполнено(ЦелоеКоличествоТовара) Тогда
		МинимальноеКоличествоАМ = ЦелоеКоличествоТовара;
		МаксимальноеКоличествоАМ = ЦелоеКоличествоТовара;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДробноеКоличествоТовара) Тогда
		МаксимальноеКоличествоАМ = МаксимальноеКоличествоАМ + 1;
	КонецЕсли;
	
	Возврат КоличествоАкцизныхМарок >= МинимальноеКоличествоАМ И КоличествоАкцизныхМарок <= МаксимальноеКоличествоАМ;
	
КонецФункции

#КонецОбласти