
#Область ПрограммныйИнтерфейс

// Формирует список шаблонов заданий очереди.
//
// см. ОчередьЗаданийПереопределяемый.ПриПолученииСпискаШаблонов()
//
Процедура ПриПолученииСпискаШаблонов(ШаблоныЗаданий) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

// Заполняет соответствие имен методов их псевдонимам для вызова из очереди заданий.
//
// см. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков()
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти