
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Настройки = НСИССервер.ПолучитьНастройкиЗагрузок();
	
	ФоноваяЗагрузкаКурсыВалют = Настройки.ЗагружатьКурсыВалют;
			
	ФоноваяЗагрузкаНормативныеВеличины = Настройки.ЗагружатьНормативныеВеличины;
			
	ФоноваяЗагрузкаКлассификаторы = Настройки.ЗагружатьКлассификаторы;
	
	ФоноваяЗагрузкаНовости = Настройки.ЗагружатьНовости;
	
	ФоноваяЗагрузкаКалендарь = Настройки.ЗагружатьКалендарь;
	
	ОткрыватьИнформациюПриСтарте = Настройки.ОткрыватьИнформациюПриСтарте;
	
	КоличествоНовостей = Настройки.КоличествоНовостей;
			
	СписокРегистров = НСИССервер.ПолучитьНастройкиРегистров();
	СписокРегистровЛокальный = СписокРегистров.Скопировать();
	
	Для Каждого СтрокаСписка ИЗ СписокРегистровЛокальный Цикл
		СтрокаСписка.Представление = НСтр(СтрокаСписка.Представление);	
	КонецЦикла;
	
	СписокКлассификаторов = НСИССервер.ПолучитьНастройкиКлассификаторов();
	СписокКлассификаторовЛокальный = СписокКлассификаторов.Скопировать();
	
	Для Каждого СтрокаСписка ИЗ СписокКлассификаторовЛокальный Цикл
		СтрокаСписка.Представление = НСтр(СтрокаСписка.Представление);	
	КонецЦикла;	
		
	СписокНовостей = НСИССервер.ПолучитьНастройкиНовостей();
	СписокНовостейЛокальный = СписокНовостей.Скопировать();
	
	Для Каждого СтрокаСписка ИЗ СписокНовостейЛокальный Цикл
		СтрокаСписка.Представление = НСтр(СтрокаСписка.Представление);	
	КонецЦикла;
	
	Если Настройки.УчетныеДанные <> Неопределено Тогда
		УчетныеДанные = Настройки.УчетныеДанные.Получить();
		Если УчетныеДанные <> Неопределено Тогда
			Логин = УчетныеДанные.Логин;
			Пароль = УчетныеДанные.Пароль;
		КонецЕсли;	
	КонецЕсли;
	
	ЗагружатьДанныеПриСтарте = Настройки.ЗагружатьДанныеПриСтарте;
	
	Если ОбщегоНазначения.РазделениеВключено() И ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Элементы.ПараметрыДоступа.Видимость = Истина;
		Элементы.ФормаПроверитьДоступ.Видимость = Ложь;
		Элементы.ЗагружатьДанныеПриСтарте.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗакрытьНаСервере()
	
	Счетчик = 0;
	Пока Счетчик < СписокРегистров.Количество() Цикл
		
		СтрокаСписка = СписокРегистровЛокальный.НайтиПоЗначению(СписокРегистров[Счетчик].Значение);
		Если СтрокаСписка <> Неопределено Тогда
			СписокРегистров[Счетчик].Пометка = СтрокаСписка.Пометка; 
		КонецЕсли;
		Счетчик = Счетчик + 1;
		
	КонецЦикла;		
			
	Счетчик = 0;
	Пока Счетчик < СписокКлассификаторов.Количество() Цикл
		
		СтрокаСписка = СписокКлассификаторовЛокальный.НайтиПоЗначению(СписокКлассификаторов[Счетчик].Значение);
		Если СтрокаСписка <> Неопределено Тогда
			СписокКлассификаторов[Счетчик].Пометка = СтрокаСписка.Пометка; 
		КонецЕсли;
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
	Счетчик = 0;
	Пока Счетчик < СписокНовостей.Количество() Цикл
		
		СтрокаСписка = СписокНовостейЛокальный.НайтиПоЗначению(СписокНовостей[Счетчик].Значение);
		Если СтрокаСписка <> Неопределено Тогда
			СписокНовостей[Счетчик].Пометка = СтрокаСписка.Пометка; 
		КонецЕсли;
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
			
	Настройки = РегистрыСведений.НСИСНастройки.СоздатьМенеджерЗаписи();
	
	Настройки.ЗагружатьНормативныеВеличины = ФоноваяЗагрузкаНормативныеВеличины;
	Настройки.ЗагружатьКлассификаторы = ФоноваяЗагрузкаКлассификаторы;
	Настройки.ЗагружатьКурсыВалют = ФоноваяЗагрузкаКурсыВалют;
	Настройки.ЗагружатьНовости = ФоноваяЗагрузкаНовости;
	Настройки.ЗагружатьКалендарь = ФоноваяЗагрузкаКалендарь;
	Настройки.ОткрыватьИнформациюПриСтарте = ОткрыватьИнформациюПриСтарте;
	
	Настройки.КоличествоНовостей = КоличествоНовостей;
	
	ХранилищеРегистров = Новый ХранилищеЗначения(СписокРегистров);
	Настройки.СписокРегистров = ХранилищеРегистров;
	
	ХранилищеКлассификаторов = Новый ХранилищеЗначения(СписокКлассификаторов);
	Настройки.СписокКлассификаторов = ХранилищеКлассификаторов;
	
	ХранилищеНовостей = Новый ХранилищеЗначения(СписокНовостей);
	Настройки.СписокНовостей = ХранилищеНовостей;
	
	Настройки.УчетныеДанные = Новый ХранилищеЗначения(Новый Структура("Логин, Пароль", Логин, Пароль));
	
	Настройки.ЗагружатьДанныеПриСтарте = ЗагружатьДанныеПриСтарте;
	
	Настройки.Записать(Истина);
	
		
			
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗакрыть(Команда)
	
	ЗаписатьЗакрытьНаСервере();
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьДоступНаСервере()
	
	ПараметрыЗагрузки = Новый Структура;
	ПараметрыЗагрузки.Вставить("ВыводитьПротокол",  Истина);
	ПараметрыЗагрузки.Вставить("ВФоне",  Ложь);
	
	Обработки.НСИСЗапускСервисов.ПроверитьДоступ(ПараметрыЗагрузки);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДоступ(Команда)
	ПроверитьДоступНаСервере();
КонецПроцедуры
