////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ СОДЕРЖИТ ПРОЦЕДУРЫ ПОЛУЧЕНИЯ ПЕРЕМЕННЫХ ДЛЯ ФОРМИРОВАНИЯ УПР. ОТЧ.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает макет электронной формы анализа показателя
//
// Возвращаемое значение:
//  ТабличныйДокумент - макет табличного документа.
//
Функция МакетСтраницыПоказателя() Экспорт
	
	Перем МакетСтраницыПоказателя;
	
	МакетСтраницыПоказателя = Отчеты.МониторЦелевыхПоказателей.ПолучитьМакет("МакетСтраницыПоказателя");
	
	Возврат МакетСтраницыПоказателя;
	
КонецФункции

// Возвращает макет электронной формы анализа показателя
//
// Возвращаемое значение:
//  ТабличныйДокумент - макет табличного документа.
//
Функция ПолучитьМатрицуСостояний() Экспорт
	
	Перем МакетМатрицаСостоянийПоказателей;
	
	МакетМатрицаСостоянийПоказателей = Отчеты.МониторЦелевыхПоказателей.ПолучитьМакет("UK_МатрицаСостоянийПоказателей");
	МакетМатрицаСостоянийПоказателей.КодЯзыка = КодЯзыкаКонфигурации();
	
	Возврат МакетМатрицаСостоянийПоказателей;
	
КонецФункции

// Возвращает строковое представление пояснения к тренду на языке текущего пользователя.
//
// Параметры:
//  ПояснениеКТренду - Строка - Строка пояснения к тренду из макета матрицы состояний.
// 
// Возвращаемое значение:
//  Строка - Строка пояснения к тренду на языке текущего пользователя.
//
Функция ПредставлениеПоясненияКТрендуМатрицыСостояния(ПояснениеКТренду) Экспорт
	Представление = "";
	Если ПояснениеКТренду = "БезИзмененийПоСравнениюСПредыдущимЗначением" Тогда
		Представление = НСтр("ru='Без изменений по сравнению с предыдущим значением';uk='Без змін у порівнянні з попереднім значенням'");
	ИначеЕсли ПояснениеКТренду = "ЗначенияУменьшаютсяНаправлениеПротивоположноеУстановленномуТренду" Тогда
		Представление = НСтр("ru='Значения уменьшаются. Направление противоположное установленному тренду';uk='Значення зменшуються. Напрямок протилежний встановленим тренду'");
	ИначеЕсли ПояснениеКТренду = "ЗначенияУвеличиваютсяНаправлениеСоответствуетУстановленномуТренду" Тогда
		Представление = НСтр("ru='Значения увеличиваются. Направление соответствует установленному тренду';uk='Значення збільшуються. Напрямок відповідає встановленому тренду'");
	ИначеЕсли ПояснениеКТренду = "ЗначенияУменьшаются" Тогда
		Представление = НСтр("ru='Значения уменьшаются';uk='Значення зменшуються'");
	ИначеЕсли ПояснениеКТренду = "ЗначенияУвеличиваются" Тогда
		Представление = НСтр("ru='Значения увеличиваются';uk='Значення збільшуються'");
	ИначеЕсли ПояснениеКТренду = "ХарактерИзмененийНеопределен" Тогда
		Представление = НСтр("ru='Характер изменений неопределен';uk='Характер змін невизначений'");
	ИначеЕсли ПояснениеКТренду = "ЗначенияУменьшаютсяНаправлениеСоответствуетУстановленномуТренду" Тогда
		Представление = НСтр("ru='Значения уменьшаются. Направление соответствует установленному тренду';uk='Значення зменшуються. Напрямок відповідаєвстановленому тренду'");
	ИначеЕсли ПояснениеКТренду = "ЗначенияУвеличиваютсяНаправлениеПротивоположноеУстановленномуТренду" Тогда
		Представление = НСтр("ru='Значения увеличиваются. Направление противоположное установленному тренду';uk='Значення збільшуються. Напрямок протилежний встановленим тренду'");
	ИначеЕсли ПояснениеКТренду = "ЗначенияУменьшаютсяВПределахЦелевогоДиапазона" Тогда
		Представление = НСтр("ru='Значения уменьшаются в пределах целевого диапазона';uk='Значення зменшуються у межах цільового діапазону'");
	ИначеЕсли ПояснениеКТренду = "ЗначенияУвеличиваютсяВПределахЦелевогоДиапазона" Тогда
		Представление = НСтр("ru='Значения увеличиваются в пределах целевого диапазона';uk='Значення збільшуються в межах цільового діапазону'");
	КонецЕсли;
	
	Возврат Представление;
КонецФункции

// Возвращает строковое представление пояснения к статусу на языке текущего пользователя.
//
// Параметры:
//  ПояснениеКСтатусу - Строка - Строка пояснения к статусу из макета матрицы состояний.
// 
// Возвращаемое значение:
//  Строка - Строка пояснения к статусу на языке текущего пользователя.
//
Функция ПредставлениеПоясненияКСтатусуМатрицыСостояния(ПояснениеКСтатусу) Экспорт
	Представление = "";
	Если ПояснениеКСтатусу = "ЦельДостигнута" Тогда
		Представление = НСтр("ru='Цель достигнута';uk='Ціль досягнута'");
	ИначеЕсли ПояснениеКСтатусу = "ПриемлемоеСостояниеПоказателя" Тогда
		Представление = НСтр("ru='Приемлемое состояние показателя';uk='Прийнятний стан показника'");
	ИначеЕсли ПояснениеКСтатусу = "НеприемлемоеСостояниеПоказателя" Тогда
		Представление = НСтр("ru='Неприемлемое состояние показателя';uk='Неприйнятний стан показника'");
	ИначеЕсли ПояснениеКСтатусу = "СостояниеПоказателяНеОпределено" Тогда
		Представление = НСтр("ru='Состояние показателя не определено';uk='Стан показника не визначено'");
	ИначеЕсли ПояснениеКСтатусу = "РассчитаноСОшибками" Тогда
		Представление = НСтр("ru='Рассчитано с ошибками';uk='Розраховано з помилками'");
	КонецЕсли;
	
	Возврат Представление;
КонецФункции

// Возвращает область "РазделительБлоков" макета электронной формы анализа показателя.
//
// Возвращаемое значение:
//  ТабличныйДокумент - макет области табличного документа документа, для разделения блоков информации.
//
Функция ПолучитьРазделительПечатнойФормыВариантаАнализа() Экспорт
	
	Перем РазделительБлоков;
	
	МакетПечатнойФормыВариантаАнализа = МакетСтраницыПоказателя();
	РазделительБлоков = МакетПечатнойФормыВариантаАнализа.ПолучитьОбласть("РазделительБлоков");
	
	Возврат РазделительБлоков;
	
КонецФункции

#Область ПреобразованиеЦветовRGBHSV

// Возвращает таблицу соответствия web цветов и составляющих цветов - красного, зеленого, синего.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица соответствия web цветов и составляющих цветов.
//   *ВебЦвет - WebЦвета - цвет.
//   *ИмяВебЦвета - Строка - Имя веб цвета.
//   *Красный - Число - Тон красного цвета по RGB.
//   *Зеленый - Число - Тон зеленого цвета по RGB.
//   *Синий   - Число - Тон синего цвета по RGB.
//
Функция СоставляющиеВебЦветов() Экспорт
	
	Таблица = Новый ТаблицаЗначений();
	Таблица.Колонки.Добавить("ВебЦвет",     Новый ОписаниеТипов("Цвет"));
	Таблица.Колонки.Добавить("ИмяВебЦвета", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(100, ДопустимаяДлина.Переменная)));
	Таблица.Колонки.Добавить("Красный",     Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный)));
	Таблица.Колонки.Добавить("Зеленый",     Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный)));
	Таблица.Колонки.Добавить("Синий",       Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(3, 0, ДопустимыйЗнак.Неотрицательный)));
	
	ВебЦветаВRGB = Отчеты.МониторЦелевыхПоказателей.ПолучитьМакет("ВебЦветаВRGB");
	ВебЦветаВRGB.КодЯзыка = КодЯзыкаКонфигурации();
	ОбластьСоответствиеWebЦветов = ВебЦветаВRGB.Области.СоответствиеWebЦветов;
	
	СоответствиеВебЦветов = ИменаВебЦветов();
	
	Для НомерСтроки = ОбластьСоответствиеWebЦветов.Верх По ОбластьСоответствиеWebЦветов.Низ Цикл
		
		ИмяВебЦвета = СокрЛП(ВебЦветаВRGB.Область("R"+НомерСтроки+"C3:R"+НомерСтроки+"C2").Текст);
		ВебЦвет = СоответствиеВебЦветов.Получить(ИмяВебЦвета);
		Если ВебЦвет = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Таблица.добавить();
		НоваяСтрока.ИмяВебЦвета = ИмяВебЦвета;
		НоваяСтрока.Красный     = Число(ВебЦветаВRGB.Область("R"+НомерСтроки+"C3:R"+НомерСтроки+"C3").Текст);
		НоваяСтрока.Зеленый     = Число(ВебЦветаВRGB.Область("R"+НомерСтроки+"C4:R"+НомерСтроки+"C4").Текст);
		НоваяСтрока.Синий       = Число(ВебЦветаВRGB.Область("R"+НомерСтроки+"C5:R"+НомерСтроки+"C5").Текст);
		НоваяСтрока.ВебЦвет     = ВебЦвет;
		
	КонецЦикла;
	Таблица.Индексы.Добавить("ВебЦвет");
	
	Возврат Таблица;
КонецФункции

#КонецОбласти

#КонецОбласти



#Область СлужебныеПроцедурыИФункции

Функция КодЯзыкаКонфигурации()
	Если Метаданные.ВариантВстроенногоЯзыка = Метаданные.СвойстваОбъектов.ВариантВстроенногоЯзыка.Русский Тогда
		Язык = "Русский";
	Иначе
		Язык = "Английский";
	КонецЕсли;
	КодЯзыка = Метаданные.Языки[Язык].КодЯзыка;
	Возврат КодЯзыка;
КонецФункции

Функция ИменаВебЦветов()
	
	СоответствиеWebЦвета = Новый Соответствие;
	
	СоответствиеWebЦвета.Вставить("АкварельноСиний", WebЦвета.АкварельноСиний);
	СоответствиеWebЦвета.Вставить("АнтикБелый", WebЦвета.АнтикБелый);
	СоответствиеWebЦвета.Вставить("ЦианАкварельный", WebЦвета.ЦианАкварельный);
	СоответствиеWebЦвета.Вставить("Аквамарин", WebЦвета.Аквамарин);
	СоответствиеWebЦвета.Вставить("Лазурный", WebЦвета.Лазурный);
	СоответствиеWebЦвета.Вставить("Бежевый", WebЦвета.Бежевый);
	СоответствиеWebЦвета.Вставить("СветлоКоричневый", WebЦвета.СветлоКоричневый);
	СоответствиеWebЦвета.Вставить("Черный", WebЦвета.Черный);
	СоответствиеWebЦвета.Вставить("БледноМиндальный", WebЦвета.БледноМиндальный);
	СоответствиеWebЦвета.Вставить("Синий", WebЦвета.Синий);
	СоответствиеWebЦвета.Вставить("СинеФиолетовый", WebЦвета.СинеФиолетовый);
	СоответствиеWebЦвета.Вставить("Коричневый", WebЦвета.Коричневый);
	СоответствиеWebЦвета.Вставить("Древесный", WebЦвета.Древесный);
	СоответствиеWebЦвета.Вставить("СероСиний", WebЦвета.СероСиний);
	СоответствиеWebЦвета.Вставить("ЗеленоватоЖелтый", WebЦвета.ЗеленоватоЖелтый);
	СоответствиеWebЦвета.Вставить("Шоколадный", WebЦвета.Шоколадный);
	СоответствиеWebЦвета.Вставить("Коралловый", WebЦвета.Коралловый);
	СоответствиеWebЦвета.Вставить("Васильковый", WebЦвета.Васильковый);
	СоответствиеWebЦвета.Вставить("ШелковыйОттенок", WebЦвета.ШелковыйОттенок);
	СоответствиеWebЦвета.Вставить("Кремовый", WebЦвета.Кремовый);
	СоответствиеWebЦвета.Вставить("Малиновый", WebЦвета.Малиновый);
	СоответствиеWebЦвета.Вставить("Циан", WebЦвета.Циан);
	СоответствиеWebЦвета.Вставить("ТемноСиний", WebЦвета.ТемноСиний);
	СоответствиеWebЦвета.Вставить("ЦианТемный", WebЦвета.ЦианТемный);
	СоответствиеWebЦвета.Вставить("ТемноЗолотистый", WebЦвета.ТемноЗолотистый);
	СоответствиеWebЦвета.Вставить("ТемноСерый", WebЦвета.ТемноСерый);
	СоответствиеWebЦвета.Вставить("ТемноЗеленый", WebЦвета.ТемноЗеленый);
	СоответствиеWebЦвета.Вставить("ХакиТемный", WebЦвета.ХакиТемный);
	СоответствиеWebЦвета.Вставить("ФуксинТемный", WebЦвета.ФуксинТемный);
	СоответствиеWebЦвета.Вставить("ТемноОливковоЗеленый", WebЦвета.ТемноОливковоЗеленый);
	СоответствиеWebЦвета.Вставить("ТемноОранжевый", WebЦвета.ТемноОранжевый);
	СоответствиеWebЦвета.Вставить("ОрхидеяТемный", WebЦвета.ОрхидеяТемный);
	СоответствиеWebЦвета.Вставить("ТемноКрасный", WebЦвета.ТемноКрасный);
	СоответствиеWebЦвета.Вставить("ЛососьТемный", WebЦвета.ЛососьТемный);
	СоответствиеWebЦвета.Вставить("ЦветМорскойВолныТемный", WebЦвета.ЦветМорскойВолныТемный);
	СоответствиеWebЦвета.Вставить("ТемноГрифельноСиний", WebЦвета.ТемноГрифельноСиний);
	СоответствиеWebЦвета.Вставить("ТемноГрифельноСерый", WebЦвета.ТемноГрифельноСерый);
	СоответствиеWebЦвета.Вставить("ТемноБирюзовый", WebЦвета.ТемноБирюзовый);
	СоответствиеWebЦвета.Вставить("ТемноФиолетовый", WebЦвета.ТемноФиолетовый);
	СоответствиеWebЦвета.Вставить("НасыщенноРозовый", WebЦвета.НасыщенноРозовый);
	СоответствиеWebЦвета.Вставить("НасыщенноНебесноГолубой", WebЦвета.НасыщенноНебесноГолубой);
	СоответствиеWebЦвета.Вставить("ТусклоСерый", WebЦвета.ТусклоСерый);
	СоответствиеWebЦвета.Вставить("СинеСерый", WebЦвета.СинеСерый);
	СоответствиеWebЦвета.Вставить("Кирпичный", WebЦвета.Кирпичный);
	СоответствиеWebЦвета.Вставить("ЦветокБелый", WebЦвета.ЦветокБелый);
	СоответствиеWebЦвета.Вставить("ЗеленыйЛес", WebЦвета.ЗеленыйЛес);
	СоответствиеWebЦвета.Вставить("Фуксия", WebЦвета.Фуксия);
	СоответствиеWebЦвета.Вставить("СеребристоСерый", WebЦвета.СеребристоСерый);
	СоответствиеWebЦвета.Вставить("ПризрачноБелый", WebЦвета.ПризрачноБелый);
	СоответствиеWebЦвета.Вставить("Золотой", WebЦвета.Золотой);
	СоответствиеWebЦвета.Вставить("Золотистый", WebЦвета.Золотистый);
	СоответствиеWebЦвета.Вставить("Серый", WebЦвета.Серый);
	СоответствиеWebЦвета.Вставить("Зеленый", WebЦвета.Зеленый);
	СоответствиеWebЦвета.Вставить("ЗеленоЖелтый", WebЦвета.ЗеленоЖелтый);
	СоответствиеWebЦвета.Вставить("Роса", WebЦвета.Роса);
	СоответствиеWebЦвета.Вставить("ТеплоРозовый", WebЦвета.ТеплоРозовый);
	СоответствиеWebЦвета.Вставить("Киноварь", WebЦвета.Киноварь);
	СоответствиеWebЦвета.Вставить("Индиго", WebЦвета.Индиго);
	СоответствиеWebЦвета.Вставить("СлоноваяКость", WebЦвета.СлоноваяКость);
	СоответствиеWebЦвета.Вставить("Хаки", WebЦвета.Хаки);
	СоответствиеWebЦвета.Вставить("БледноЛиловый", WebЦвета.БледноЛиловый);
	СоответствиеWebЦвета.Вставить("ГолубойСКраснымОттенком", WebЦвета.ГолубойСКраснымОттенком);
	СоответствиеWebЦвета.Вставить("ЗеленаяЛужайка", WebЦвета.ЗеленаяЛужайка);
	СоответствиеWebЦвета.Вставить("Лимонный", WebЦвета.Лимонный);
	СоответствиеWebЦвета.Вставить("Голубой", WebЦвета.Голубой);
	СоответствиеWebЦвета.Вставить("СветлоКоралловый", WebЦвета.СветлоКоралловый);
	СоответствиеWebЦвета.Вставить("ЦианСветлый", WebЦвета.ЦианСветлый);
	СоответствиеWebЦвета.Вставить("СветлоЗолотистый", WebЦвета.СветлоЗолотистый);
	СоответствиеWebЦвета.Вставить("СветлоЖелтыйЗолотистый", WebЦвета.СветлоЖелтыйЗолотистый);
	СоответствиеWebЦвета.Вставить("СветлоСерый", WebЦвета.СветлоСерый);
	СоответствиеWebЦвета.Вставить("СветлоЗеленый", WebЦвета.СветлоЗеленый);
	СоответствиеWebЦвета.Вставить("СветлоРозовый", WebЦвета.СветлоРозовый);
	СоответствиеWebЦвета.Вставить("ЛососьСветлый", WebЦвета.ЛососьСветлый);
	СоответствиеWebЦвета.Вставить("ЦветМорскойВолныСветлый", WebЦвета.ЦветМорскойВолныСветлый);
	СоответствиеWebЦвета.Вставить("СветлоНебесноГолубой", WebЦвета.СветлоНебесноГолубой);
	СоответствиеWebЦвета.Вставить("СветлоГрифельноСиний", WebЦвета.СветлоГрифельноСиний);
	СоответствиеWebЦвета.Вставить("СветлоГрифельноСерый", WebЦвета.СветлоГрифельноСерый);
	СоответствиеWebЦвета.Вставить("ГолубойСоСтальнымОттенком", WebЦвета.ГолубойСоСтальнымОттенком);
	СоответствиеWebЦвета.Вставить("СветлоЖелтый", WebЦвета.СветлоЖелтый);
	СоответствиеWebЦвета.Вставить("ЗеленоватоЛимонный", WebЦвета.ЗеленоватоЛимонный);
	СоответствиеWebЦвета.Вставить("ЛимонноЗеленый", WebЦвета.ЛимонноЗеленый);
	СоответствиеWebЦвета.Вставить("Льняной", WebЦвета.Льняной);
	СоответствиеWebЦвета.Вставить("Фуксин", WebЦвета.Фуксин);
	СоответствиеWebЦвета.Вставить("ТемноБордовый", WebЦвета.ТемноБордовый);
	СоответствиеWebЦвета.Вставить("НейтральноАквамариновый", WebЦвета.НейтральноАквамариновый);
	СоответствиеWebЦвета.Вставить("НейтральноСиний", WebЦвета.НейтральноСиний);
	СоответствиеWebЦвета.Вставить("НейтральноСерый", WebЦвета.НейтральноСерый);
	СоответствиеWebЦвета.Вставить("НейтральноЗеленый", WebЦвета.НейтральноЗеленый);
	СоответствиеWebЦвета.Вставить("ОрхидеяНейтральный", WebЦвета.ОрхидеяНейтральный);
	СоответствиеWebЦвета.Вставить("НейтральноПурпурный", WebЦвета.НейтральноПурпурный);
	СоответствиеWebЦвета.Вставить("ЦветМорскойВолныНейтральный", WebЦвета.ЦветМорскойВолныНейтральный);
	СоответствиеWebЦвета.Вставить("НейтральноГрифельноСиний", WebЦвета.НейтральноГрифельноСиний);
	СоответствиеWebЦвета.Вставить("НейтральноВесеннеЗеленый", WebЦвета.НейтральноВесеннеЗеленый);
	СоответствиеWebЦвета.Вставить("НейтральноБирюзовый", WebЦвета.НейтральноБирюзовый);
	СоответствиеWebЦвета.Вставить("НейтральноФиолетовоКрасный", WebЦвета.НейтральноФиолетовоКрасный);
	СоответствиеWebЦвета.Вставить("ПолночноСиний", WebЦвета.ПолночноСиний);
	СоответствиеWebЦвета.Вставить("МятныйКрем", WebЦвета.МятныйКрем);
	СоответствиеWebЦвета.Вставить("ТусклоРозовый", WebЦвета.ТусклоРозовый);
	СоответствиеWebЦвета.Вставить("ЗамшаСветлый", WebЦвета.ЗамшаСветлый);
	СоответствиеWebЦвета.Вставить("НавахоБелый", WebЦвета.НавахоБелый);
	СоответствиеWebЦвета.Вставить("Ультрамарин", WebЦвета.Ультрамарин);
	СоответствиеWebЦвета.Вставить("СтароеКружево", WebЦвета.СтароеКружево);
	СоответствиеWebЦвета.Вставить("Оливковый", WebЦвета.Оливковый);
	СоответствиеWebЦвета.Вставить("ТусклоОливковый", WebЦвета.ТусклоОливковый);
	СоответствиеWebЦвета.Вставить("Оранжевый", WebЦвета.Оранжевый);
	СоответствиеWebЦвета.Вставить("ОранжевоКрасный", WebЦвета.ОранжевоКрасный);
	СоответствиеWebЦвета.Вставить("Орхидея", WebЦвета.Орхидея);
	СоответствиеWebЦвета.Вставить("БледноЗолотистый", WebЦвета.БледноЗолотистый);
	СоответствиеWebЦвета.Вставить("БледноЗеленый", WebЦвета.БледноЗеленый);
	СоответствиеWebЦвета.Вставить("БледноБирюзовый", WebЦвета.БледноБирюзовый);
	СоответствиеWebЦвета.Вставить("БледноКрасноФиолетовый", WebЦвета.БледноКрасноФиолетовый);
	СоответствиеWebЦвета.Вставить("ТопленоеМолоко", WebЦвета.ТопленоеМолоко);
	СоответствиеWebЦвета.Вставить("Персиковый", WebЦвета.Персиковый);
	СоответствиеWebЦвета.Вставить("НейтральноКоричневый", WebЦвета.НейтральноКоричневый);
	СоответствиеWebЦвета.Вставить("Розовый", WebЦвета.Розовый);
	СоответствиеWebЦвета.Вставить("Сливовый", WebЦвета.Сливовый);
	СоответствиеWebЦвета.Вставить("СинийСПороховымОттенком", WebЦвета.СинийСПороховымОттенком);
	СоответствиеWebЦвета.Вставить("Пурпурный", WebЦвета.Пурпурный);
	СоответствиеWebЦвета.Вставить("Красный", WebЦвета.Красный);
	СоответствиеWebЦвета.Вставить("РозовоКоричневый", WebЦвета.РозовоКоричневый);
	СоответствиеWebЦвета.Вставить("КоролевскиГолубой", WebЦвета.КоролевскиГолубой);
	СоответствиеWebЦвета.Вставить("КожаноКоричневый", WebЦвета.КожаноКоричневый);
	СоответствиеWebЦвета.Вставить("Лосось", WebЦвета.Лосось);
	СоответствиеWebЦвета.Вставить("ПесочноКоричневый", WebЦвета.ПесочноКоричневый);
	СоответствиеWebЦвета.Вставить("ЦветМорскойВолны", WebЦвета.ЦветМорскойВолны);
	СоответствиеWebЦвета.Вставить("Перламутровый", WebЦвета.Перламутровый);
	СоответствиеWebЦвета.Вставить("Охра", WebЦвета.Охра);
	СоответствиеWebЦвета.Вставить("Серебряный", WebЦвета.Серебряный);
	СоответствиеWebЦвета.Вставить("НебесноГолубой", WebЦвета.НебесноГолубой);
	СоответствиеWebЦвета.Вставить("ГрифельноСиний", WebЦвета.ГрифельноСиний);
	СоответствиеWebЦвета.Вставить("ГрифельноСерый", WebЦвета.ГрифельноСерый);
	СоответствиеWebЦвета.Вставить("Белоснежный", WebЦвета.Белоснежный);
	СоответствиеWebЦвета.Вставить("ВесеннеЗеленый", WebЦвета.ВесеннеЗеленый);
	СоответствиеWebЦвета.Вставить("СинийСоСтальнымОттенком", WebЦвета.СинийСоСтальнымОттенком);
	СоответствиеWebЦвета.Вставить("РыжеватоКоричневый", WebЦвета.РыжеватоКоричневый);
	СоответствиеWebЦвета.Вставить("ЦианНейтральный", WebЦвета.ЦианНейтральный);
	СоответствиеWebЦвета.Вставить("БледноСиреневый", WebЦвета.БледноСиреневый);
	СоответствиеWebЦвета.Вставить("Томатный", WebЦвета.Томатный);
	СоответствиеWebЦвета.Вставить("Бирюзовый", WebЦвета.Бирюзовый);
	СоответствиеWebЦвета.Вставить("Фиолетовый", WebЦвета.Фиолетовый);
	СоответствиеWebЦвета.Вставить("КрасноФиолетовый", WebЦвета.КрасноФиолетовый);
	СоответствиеWebЦвета.Вставить("Пшеничный", WebЦвета.Пшеничный);
	СоответствиеWebЦвета.Вставить("Белый", WebЦвета.Белый);
	СоответствиеWebЦвета.Вставить("ДымчатоБелый", WebЦвета.ДымчатоБелый);
	СоответствиеWebЦвета.Вставить("Желтый", WebЦвета.Желтый);
	СоответствиеWebЦвета.Вставить("ЖелтоЗеленый", WebЦвета.ЖелтоЗеленый);
	
	Возврат СоответствиеWebЦвета;
	
КонецФункции

#КонецОбласти
