#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка
		Или РасчетСебестоимостиПрикладныеАлгоритмы.ДвиженияЗаписываютсяРасчетомПартийИСебестоимости(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если НЕ РасчетСебестоимостиПрикладныеАлгоритмы.ФормироватьДвиженияРегистровУчетаСебестоимости(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	РасчетСебестоимостиПрикладныеАлгоритмы.СохранитьДвиженияСформированныеРасчетомПартийИСебестоимости(ЭтотОбъект, Замещение);
	
	Если Не ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства)
		Или ПланыОбмена.ГлавныйУзел() <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ПартииРасходов.Период                       КАК Период,
	|	ПартииРасходов.Регистратор                  КАК Регистратор,
	|	ПартииРасходов.Организация                  КАК Организация,
	|	ПартииРасходов.Подразделение                КАК Подразделение,
	|	ПартииРасходов.СтатьяРасходов               КАК СтатьяРасходов,
	|	ПартииРасходов.АналитикаРасходов            КАК АналитикаРасходов,
	|	ПартииРасходов.АналитикаАктивовПассивов     КАК АналитикаАктивовПассивов,
	|	ПартииРасходов.ДокументПоступленияРасходов  КАК ДокументПоступленияРасходов,
	|	ПартииРасходов.АналитикаУчетаПартий         КАК АналитикаУчетаПартий,
	|	ПартииРасходов.НаправлениеДеятельности      КАК НаправлениеДеятельности,
	|	ПартииРасходов.АналитикаУчетаНоменклатуры   КАК АналитикаУчетаНоменклатуры,
    |	ПартииРасходов.НалоговоеНазначение          КАК НалоговоеНазначение,
	|	ПартииРасходов.Стоимость                    КАК Стоимость,
	|	ПартииРасходов.СтоимостьБезНДС              КАК СтоимостьБезНДС,
	|	ПартииРасходов.СтоимостьРегл                КАК СтоимостьРегл,
	|	ПартииРасходов.НДСРегл                      КАК НДСРегл,
	|	ПартииРасходов.ПостояннаяРазница            КАК ПостояннаяРазница,
	|	ПартииРасходов.ВременнаяРазница             КАК ВременнаяРазница,
	|	ПартииРасходов.НДСУпр                       КАК НДСУпр
	|
	|ПОМЕСТИТЬ ПартииПрочихРасходовПередЗаписью
	|ИЗ
	|	РегистрНакопления.ПартииПрочихРасходов КАК ПартииРасходов
	|ГДЕ
	|	ПартииРасходов.Регистратор = &Регистратор
	|	И (ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) ИЛИ &ЭтоОтменаПроведения)
	|");
	
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	ЭтоОтменаПроведения = ДополнительныеСвойства.СвойстваДокумента.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
	Запрос.УстановитьПараметр("ЭтоОтменаПроведения", ЭтоОтменаПроведения);
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Или Не ПроведениеДокументов.КонтролироватьИзменения(ДополнительныеСвойства)
		Или ПланыОбмена.ГлавныйУзел() <> Неопределено
		Или РасчетСебестоимостиПрикладныеАлгоритмы.ДвиженияЗаписываютсяРасчетомПартийИСебестоимости(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ РасчетСебестоимостиПрикладныеАлгоритмы.ФормироватьДвиженияРегистровУчетаСебестоимости(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	МассивТекстовЗапроса = Новый Массив;
	
	ТекстТаблицыИзменений = 
	"ВЫБРАТЬ
	|	Таблица.Период                           КАК Период,
	|	Таблица.Регистратор                      КАК Регистратор,
	|	Таблица.Подразделение                    КАК Подразделение,
	|	Таблица.Организация                      КАК Организация,
	|	Таблица.СтатьяРасходов                   КАК СтатьяРасходов,
	|	Таблица.ВариантРаспределенияРасходовУпр  КАК ВариантРаспределенияРасходовУпр,
	|	Таблица.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияРасходовРегл,
    |	Таблица.ВидЦенности                      КАК ВидЦенности,
	|	Таблица.АналитикаРасходов                КАК АналитикаРасходов,
	|	Таблица.ДокументПоступленияРасходов      КАК ДокументПоступленияРасходов,
	|	Таблица.АналитикаУчетаПартий             КАК АналитикаУчетаПартий,
	|	Таблица.АналитикаУчетаНоменклатуры       КАК АналитикаУчетаНоменклатуры,
	|	Таблица.НаправлениеДеятельности          КАК НаправлениеДеятельности,
    |	Таблица.НалоговоеНазначение              КАК НалоговоеНазначение,
	|	СУММА(Таблица.Стоимость)                 КАК Стоимость,
	|	СУММА(Таблица.СтоимостьБезНДС)           КАК СтоимостьБезНДС,
	|	СУММА(Таблица.СтоимостьРегл)             КАК СтоимостьРегл,
	|	СУММА(Таблица.НДСРегл)                   КАК НДСРегл,
	|	СУММА(Таблица.ПостояннаяРазница)         КАК ПостояннаяРазница,
	|	СУММА(Таблица.ВременнаяРазница)          КАК ВременнаяРазница,
	|	СУММА(Таблица.НДСУпр)                    КАК НДСУпр
	|ПОМЕСТИТЬ ТаблицаИзмененийПартииПрочихРасходов
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таблица.Период                         			КАК Период,
	|		Таблица.Регистратор                     		КАК Регистратор,
	|		Таблица.Подразделение                   		КАК Подразделение,
	|		Таблица.Организация                     		КАК Организация,
	|		Таблица.СтатьяРасходов                  		КАК СтатьяРасходов,
	|		СтатьиРасходов.ВариантРаспределенияРасходовУпр 	КАК ВариантРаспределенияРасходовУпр,
	|		СтатьиРасходов.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияРасходовРегл,
    |		СтатьиРасходов.ВидЦенности           		    КАК ВидЦенности,
	|		Таблица.АналитикаРасходов               		КАК АналитикаРасходов,
	|		Таблица.ДокументПоступленияРасходов     		КАК ДокументПоступленияРасходов,
	|		Таблица.АналитикаУчетаПартий            		КАК АналитикаУчетаПартий,
	|		Таблица.АналитикаУчетаНоменклатуры      		КАК АналитикаУчетаНоменклатуры,
	|		Таблица.НаправлениеДеятельности      			КАК НаправлениеДеятельности,
    |		ВЫБОР
    |			КОГДА Таблица.НалоговоеНазначение <> ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка)
    |				ТОГДА Таблица.НалоговоеНазначение
    |			ИНАЧЕ Таблица.АналитикаУчетаПартий.НалоговоеНазначение
    |		КОНЕЦ                                           КАК НалоговоеНазначение,
	|		Таблица.Стоимость                               КАК Стоимость,
	|		Таблица.СтоимостьБезНДС                         КАК СтоимостьБезНДС,
	|		Таблица.СтоимостьРегл                   		КАК СтоимостьРегл,
	|		Таблица.НДСРегл                         		КАК НДСРегл,
	|		Таблица.ПостояннаяРазница                       КАК ПостояннаяРазница,
	|		Таблица.ВременнаяРазница                        КАК ВременнаяРазница,
	|		Таблица.НДСУпр                         			КАК НДСУпр
	|	ИЗ
	|		ПартииПрочихРасходовПередЗаписью КАК Таблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|		ПО
	|			Таблица.СтатьяРасходов =  СтатьиРасходов.Ссылка
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПартииРасходов.Период                       	КАК Период,
	|		ПартииРасходов.Регистратор                  	КАК Регистратор,
	|		ПартииРасходов.Подразделение                	КАК Подразделение,
	|		ПартииРасходов.Организация                  	КАК Организация,
	|		ПартииРасходов.СтатьяРасходов               	КАК СтатьяРасходов,
	|		СтатьиРасходов.ВариантРаспределенияРасходовУпр 	КАК ВариантРаспределенияРасходовУпр,
	|		СтатьиРасходов.ВариантРаспределенияРасходовРегл КАК ВариантРаспределенияРасходовРегл,
    |		СтатьиРасходов.ВидЦенности               	    КАК ВидЦенности,
	|		ПартииРасходов.АналитикаРасходов            	КАК АналитикаРасходов,
	|		ПартииРасходов.ДокументПоступленияРасходов  	КАК ДокументПоступленияРасходов,
	|		ПартииРасходов.АналитикаУчетаПартий         	КАК АналитикаУчетаПартий,
	|		ПартииРасходов.АналитикаУчетаНоменклатуры   	КАК АналитикаУчетаНоменклатуры,
	|		ПартииРасходов.НаправлениеДеятельности      	КАК НаправлениеДеятельности,
    |		ВЫБОР
    |			КОГДА ПартииРасходов.НалоговоеНазначение <> ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка)
    |				ТОГДА ПартииРасходов.НалоговоеНазначение
    |			ИНАЧЕ ПартииРасходов.АналитикаУчетаПартий.НалоговоеНазначение
    |		КОНЕЦ                                           КАК НалоговоеНазначение,
	|		-ПартииРасходов.Стоимость                       КАК Стоимость,
	|		-ПартииРасходов.СтоимостьБезНДС                 КАК СтоимостьБезНДС,
	|		-ПартииРасходов.СтоимостьРегл               	КАК СтоимостьРегл,
	|		-ПартииРасходов.НДСРегл                    		КАК НДСРегл,
	|		-ПартииРасходов.ПостояннаяРазница               КАК ПостояннаяРазница,
	|		-ПартииРасходов.ВременнаяРазница                КАК ВременнаяРазница,
	|		-ПартииРасходов.НДСУпр                         	КАК НДСУпр
	|	ИЗ
	|		РегистрНакопления.ПартииПрочихРасходов КАК ПартииРасходов
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|		ПО
	|			ПартииРасходов.СтатьяРасходов =  СтатьиРасходов.Ссылка
	|	ГДЕ
	|		ПартииРасходов.Регистратор = &Регистратор
	|		И ПартииРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|
	|) КАК Таблица
	|
	|СГРУППИРОВАТЬ ПО
	|	Таблица.Период,
	|	Таблица.Регистратор,
	|	Таблица.Организация,
	|	Таблица.Подразделение,
	|	Таблица.СтатьяРасходов,
	|	Таблица.ВариантРаспределенияРасходовУпр,
	|	Таблица.ВариантРаспределенияРасходовРегл,
    |	Таблица.ВидЦенности,
	|	Таблица.АналитикаРасходов,
	|	Таблица.ДокументПоступленияРасходов,
	|	Таблица.АналитикаУчетаПартий,
	|	Таблица.АналитикаУчетаНоменклатуры,
	|	Таблица.НаправлениеДеятельности,
    |	Таблица.НалоговоеНазначение 
	|ИМЕЮЩИЕ
	|	СУММА(Таблица.Стоимость) <> 0
	|	ИЛИ СУММА(Таблица.СтоимостьБезНДС) <> 0
	|	ИЛИ СУММА(Таблица.СтоимостьРегл) <> 0
	|	ИЛИ СУММА(Таблица.НДСРегл) <> 0
	|	ИЛИ СУММА(Таблица.ПостояннаяРазница) <> 0
	|	ИЛИ СУММА(Таблица.ВременнаяРазница) <> 0
	|	ИЛИ СУММА(Таблица.НДСУпр) <> 0
	|";
	МассивТекстовЗапроса.Добавить(ТекстТаблицыИзменений);
	МассивТекстовЗапроса.Добавить("УНИЧТОЖИТЬ ПартииПрочихРасходовПередЗаписью");
	
	Запрос = Новый Запрос();
	Запрос.Текст = СтрСоединить(МассивТекстовЗапроса, ОбщегоНазначенияУТ.РазделительЗапросовВПакете());
	
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
