// ПриСозданииНаСервере()
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
				
	ФильтроватьВидыОтчетовПоПериоду   = Параметры.мФильтроватьВидыОтчетовПоПериоду;
	НеОтображатьНапоминания  		  = Параметры.НеОтображатьНапоминания;
	ЗапоминатьВыбранныйПериод 		  = Параметры.ЗапоминатьВыбранныйПериод;
	
	ИнтервалНапоминаний = РегламентированнаяОтчетность.ЗначениеИнтервалаНапоминанийРегламентированнойОтчетности();
	Если ИнтервалНапоминаний = 0 Тогда
		ФлажокНапоминатьЗа = Ложь;
		Элементы.НастройкаНапоминаний.Доступность = Ложь;
	КонецЕсли;
	ФлажокНапоминатьЗа = (ИнтервалНапоминаний <> 0);
	Если ИнтервалНапоминаний = 0 Тогда
		ИнтервалНапоминаний = 5;
	КонецЕсли;
	
	мЗадаватьВопросПриЗакрытии = Истина;
	
	Элементы.НастройкиКалендаря.Видимость = Ложь;
	
КонецПроцедуры // ПриСозданииНаСервере()

// ПриОткрытии()
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Возврат;
		
КонецПроцедуры // ПриОткрытии()

// ПередЗакрытием()
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Модифицированность И мЗадаватьВопросПриЗакрытии Тогда
		Отказ = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Сохранить настройки?';uk='Зберегти настройки?'"), РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Если СохранитьНастройки() Тогда
			мЗадаватьВопросПриЗакрытии = Ложь;
			Закрыть(Истина);
		КонецЕсли;
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		мЗадаватьВопросПриЗакрытии = Ложь;
		Закрыть();
	КонецЕсли;

КонецПроцедуры // ПередЗакрытием()

// СохранитьНастройки()
//
&НаКлиенте
Функция СохранитьНастройки()
	
	ВладелецФормы.мФильтроватьВидыОтчетовПоПериоду = ФильтроватьВидыОтчетовПоПериоду;
	СохранитьНаСервере();
		
	Возврат Истина;
	
КонецФункции // СохранитьНастройки()

&НаСервере
Процедура СохранитьНаСервере()
	
	ХранилищеНастроекДанныхФорм.Сохранить("Обработка.ОбщиеОбъектыРегламентированнойОтчетности.Форма.УправлениеОтчетностьюФормаНастройки", "ИнтервалНапоминанийРегламентированнойОтчетности", ИнтервалНапоминаний);	
	
КонецПроцедуры

// СохранитьИЗакрыть()
//
&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	Если НЕ СохранитьНастройки() Тогда
		Возврат;
	КонецЕсли;
	
	мЗадаватьВопросПриЗакрытии = Ложь;
	Закрыть(Истина);
	
КонецПроцедуры // СохранитьИЗакрыть()