
#Область ОбработчикиСобытийФормы
    
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ИдентификаторФайла = Запись.ИдентификаторФайла;
    
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОповещение(Команда)
    ОтправитьОповещениеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИдентификаторФайлаОткрытие(Элемент, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    Если ЗначениеЗаполнено(Запись.ИдентификаторФайла) Тогда
        ОписаниеПередаваемогоФайла = ОписаниеПередаваемогоФайла(Запись.ИдентификаторФайла);
        Оповещение = Новый ОписаниеОповещения("НачатьПолучениеФайловЗавершение", ЭтотОбъект);
        ПолучаемыеФайлы = Новый Массив;
        ПолучаемыеФайлы.Добавить(ОписаниеПередаваемогоФайла);
    	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
    	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
        ДиалогВыбораФайла.Фильтр = НСтр("ru='Все файлы (*.*)|*.*';uk='Всі файли (*.*)|*.*'"); 
        НачатьПолучениеФайлов(Оповещение, ПолучаемыеФайлы, ДиалогВыбораФайла);
    КонецЕсли; 
    
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
    
&НаСервере
Процедура ОтправитьОповещениеНаСервере()
    
    ИнтеграцияОбъектовОбластейДанных.ОповеститьОбИзмененииОбъекта(
        Запись.УчетнаяСистема, Запись.ИдентификаторОбъекта, Истина);
    
КонецПроцедуры

&НаКлиенте 
Процедура НачатьПолучениеФайловЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
    
    Если ЗначениеЗаполнено(ПолученныеФайлы) Тогда
    	ОписаниеФайла = ПолученныеФайлы[0]; // ОписаниеПередаваемогоФайла
    	ИмяФайла = ОписаниеФайла.Имя;
        Оповещение = Новый ОписаниеОповещения("ПриНажатииОповещенияПолученияФайла", ЭтотОбъект, ИмяФайла);
        ПоказатьОповещениеПользователя(НСтр("ru='Файл сохранен';uk='Файл збережено'"), Оповещение, ИмяФайла, БиблиотекаКартинок.Информация32);     
    КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ОписаниеПередаваемогоФайла(ИдентификаторФайла)
    
    Возврат ФайлыОбластейДанных.ОписаниеПередаваемогоФайла(ИдентификаторФайла, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ПриНажатииОповещенияПолученияФайла(ПолноеИмяФайла) Экспорт
    
	ФайловаяСистемаКлиент.ОткрытьФайл(ПолноеИмяФайла);
	
КонецПроцедуры

#КонецОбласти 
