#Область ПрограммныйИнтерфейс

#Область ФормированиеОбщихПараметровЧека

// Инициализирует параметры фискального чека
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
// 	ДокументСсылка - ДокументСсылка - Документ, по которому требуется распечатать чек 
// 	Организация - СправочникСсылка.Организации - Организация по документу
Процедура ПараметрыОперацииФискализацииЧека(ПараметрыФискальногоЧека, ДокументСсылка, Организация) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

// Заполняется основные параметры фискального чека
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
// 	ДокументСсылка - ДокументСсылка - Документ, по которому формируются параметры фискального чека
// 	Организация - СправочникСсылка.Организации - Организация документа, по которому формируются параметры фискального чека
Процедура ПараметрыОперацииФискализацииЧекаПоДокументу(ПараметрыФискальногоЧека, ДокументСсылка, Организация) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

// Обновляет параметр "ДокументОснование" в параметрах фискального чека 
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
// 	ДокументОснование - ДокументСсылка - новое значение параметра "ДокументОснование"
Процедура ОбновитьПараметрыФискальногоЧекаДокументОснование(ПараметрыФискальногоЧека, ДокументОснование) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Обновляет параметр "ЕдиныйЧек" в параметрах фискального чека 
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
// 	ФлагЕдиныйЧек - Булево - новое значение параметра "ЕдиныйЧек"
Процедура ОбновитьПараметрыФискальногоЧекаЕдиныйЧек(ПараметрыФискальногоЧека, ФлагЕдиныйЧек) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Обновляет параметр "ТипРасчета" в параметрах фискального чека 
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
// 	ТипРасчета - ПеречислениеСсылка.ТипыРасчетаДенежнымиСредствами - новое значение параметра "ТипРасчета"
Процедура ПараметрыФискальногоЧекаЗаполнитьТипРасчета(ПараметрыФискальногоЧека, ТипРасчета) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Обновляет параметр "СерийныйНомер" в параметрах фискального чека 
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
// 	СерийныйНомерОборудования - Строка - новое значение параметра "СерийныйНомер"
Процедура ПараметрыФискальногоЧекаЗаполнитьСерийныйНомерОборудования(ПараметрыФискальногоЧека, СерийныйНомерОборудования) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Обновляет параметры получателя в параметрах фискального чека
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
// 	Получатель - Строка - новое значение параметра "Получатель" 
// 	ПолучательИНН - Строка - новое значение параметра "ПолучательИНН"
Процедура ПараметрыФискальногоЧекаЗаполнитьПараметрыПокупателя(ПараметрыФискальногоЧека, Получатель, ПолучательИНН) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Обновляет параметр "ТорговыйОбъект" в параметрах фискального чека 
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
// 	МестоРасчетов - Структура - содержит структуру значений по торговому объекту
Процедура ПараметрыФискальногоЧекаЗаполнитьМестоРасчетов(ПараметрыФискальногоЧека, МестоРасчетов) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Обновляет параметры отправки электронного чека в параметрах фискального чека
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
// 	ВариантОтправки - ПеречислениеСсылка.ВариантыОтправкиЭлектронногоЧекаПокупателю - вариант отправки электронного чека (email, sms)
// 	КонтактПолучателя - Строка - email или номер телефона
Процедура ПараметрыФискальногоЧекаЗаполнитьПараметрыОтправкиЭлектронногоЧека(ПараметрыФискальногоЧека, ВариантОтправки, КонтактПолучателя) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Обновляет персональные данные в параметрах фискального чека
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
// 	ЕстьПерсональныеДанные - Булево - Параметры фискального чека содержат/не содержат персональные данные
// 	Получатель - Строка - ФИО получателя и паспортные данные в случае отсутствия ИНН
// 	ПолучательИНН - Строка - ИНН получателя
Процедура ПараметрыФискальногоЧекаЗаполнитьПерсональныеДанные(ПараметрыФискальногоЧека, ЕстьПерсональныеДанные, Получатель, ПолучательИНН) Экспорт
	
	ПараметрыФискальногоЧека.Вставить("ЕстьПерсональныеДанные", ЕстьПерсональныеДанные);
	ПараметрыФискальногоЧека.Вставить("Получатель"   , СокрЛП(Получатель));
	ПараметрыФискальногоЧека.Вставить("ПолучательИНН", СокрЛП(ПолучательИНН));
	
КонецПроцедуры

// Обновляет параметры чека коррекции в параметрах фискального чека
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
// 	КорректируемыйДокумент - ДокументСсылка - Основание, по которому введен документ печати чека
// 	ВидКоррекции - ПеречислениеСсылка.ВидыЧековКоррекции - вид чека коррекции
// 	ДанныеКоррекции - Массив - Дополнительные данные коррекции
Процедура ПараметрыФискальногоЧекаЗаполнитьПараметрыКоррекции(ПараметрыФискальногоЧека, КорректируемыйДокумент, ВидКоррекции, ДанныеКоррекции) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Очищает параметры чека коррекции в параметрах фискального чека 
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
Процедура ПараметрыФискальногоЧекаУдалитьПараметрыКоррекции(ПараметрыФискальногоЧека) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Обновляет параметр "ПозицииЧека" в параметрах фискального чека
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
// 	ПозицииЧека - Массив - новое значение параметра "ПозицииЧека"
Процедура ПараметрыФискальногоЧекаЗаполнитьПозицииЧека(ПараметрыФискальногоЧека, ПозицииЧека) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Обновляет параметр "ТаблицаОплат" в параметрах фискального чека 
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
// 	ТаблицаОплат - Массив - новое значение параметра "ТаблицаОплат"
Процедура ПараметрыФискальногоЧекаЗаполнитьТаблицуОплат(ПараметрыФискальногоЧека, ТаблицаОплат) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Добавляет дополнительные данные к параметрам фискального чека в случае оплаты подарочным сертификатом
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека, состоит из:
// 	* ПозицииЧека - Массив - Массив структур позиции чека
// 	* ТаблицаОплат - Массив - Массив структур видов оплат с суммами
// 	ПодарочныеСертификаты - ТаблицаЗначений - Список подарочных сертификатов с суммовыми данными
Процедура ДобавитьДанныеПоПодарочнымСертификатам(ПараметрыФискальногоЧека, ПодарочныеСертификаты) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Возвращает таблицу товаров для заполнения позиций строк в параметрах чека
// 
// Параметры:
// 	ДокументСсылка - ДокументСсылка - Документ для получения товарных позиций
// Возвращаемое значение:
// 	ТаблицаЗначений - Таблицу с товарными позициями с количественными и суммовыми показателями
Функция ПозицииНоменклатурыПоДокументу(ДокументСсылка) Экспорт
	//++ Локализация
	//-- Локализация
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область ФормированиеПараметровЧекаККМ

// Обновляет данные торгового объекта в параметрах чека
//
// Параметры:
// 	ПараметрыОперацииФискализацииЧека - Структура - Параметры фискального чека
// 	ТорговыйОбъект - СправочникСсылка.Склады - Ссылка на склад, к которому привязана ККТ
//  ККТ - СправочникСсылка.ПодключаемоеОборудование - Ссылка на ККТ
Процедура ОбновитьПараметрыФискальногоЧекаМестоРасчетов(ПараметрыОперацииФискализацииЧека, ТорговыйОбъект, ККТ) Экспорт
	
	ТорговыйОбъектНаименование = "";
	ТорговыйОбъектАдресРасчетов = "";
	ТорговыйОбъектМестоРасчетов = "";
	
	Если ЗначениеЗаполнено(ТорговыйОбъект) Тогда
		ТорговыйОбъектНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТорговыйОбъект, "Наименование");
	КонецЕсли;
	
	ПараметрыРегистрацииККТ = МенеджерОборудованияВызовСервера.ПолучитьПараметрыРегистрацииУстройства(ККТ);
	Если ТипЗнч(ПараметрыРегистрацииККТ) = Тип("Структура") Тогда
		Если ПараметрыРегистрацииККТ.Свойство("АдресПроведенияРасчетов") Тогда
			ТорговыйОбъектАдресРасчетов = ПараметрыРегистрацииККТ.АдресПроведенияРасчетов;
		КонецЕсли;
		
		Если ПараметрыРегистрацииККТ.Свойство("МестоПроведенияРасчетов") Тогда
			ТорговыйОбъектМестоРасчетов = ПараметрыРегистрацииККТ.МестоПроведенияРасчетов;
		КонецЕсли;
	КонецЕсли;
	
	МестоРасчетов = Новый Структура("ТорговыйОбъект, МестоРасчетов, АдресРасчетов", "", "", ""); 
	МестоРасчетов.ТорговыйОбъект = ТорговыйОбъектНаименование;
	МестоРасчетов.АдресРасчетов = ТорговыйОбъектАдресРасчетов;
	МестоРасчетов.МестоРасчетов = ТорговыйОбъектМестоРасчетов;
	
	ПараметрыФискальногоЧекаЗаполнитьМестоРасчетов(ПараметрыОперацииФискализацииЧека, МестоРасчетов);
	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеПозицийЧекаККМ

// Рассчитывает и обновляет параметр позиций чека ККМ (ЧекККМ, ЧекККМВозврат)
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
// 	ДокументСсылка - ДокументСсылка - Ссылка на чек ККМ
Процедура ОбновитьПараметрыФискальногоЧекаПозицийЧекаККМ(ПараметрыФискальногоЧека, ДокументСсылка) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Рассчитывает и обновляет параметр таблицы оплат чека ККМ (ЧекККМ, ЧекККМВозврат)
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
// 	ИнформацияОбОплате - Структура - Суммы оплат по видам оплат
Процедура ОбновитьПараметрыФискальногоЧекаТаблицаОплатЧекаККМ(ПараметрыФискальногоЧека, ИнформацияОбОплате) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область ФормированиеПозицийЕдиногоЧека

// Рассчитывает и обновляет параметр позиций единого чека
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
// 	ДокументыЕдиногоЧека - Массив - Документы, входящие в единый чек
Процедура ОбновитьПараметрыФискальногоЧекаПозицийЧекаЕдиныйЧек(ПараметрыФискальногоЧека, ДокументыЕдиногоЧека) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Рассчитывает и обновляет параметр таблицы оплат единого чека
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
// 	ДокументыЕдиногоЧека - Массив - Документы, входящие в единый чек
Процедура ОбновитьПараметрыФискальногоЧекаТаблицаОплатЕдиныйЧек(ПараметрыФискальногоЧека, ДокументыЕдиногоЧека) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область ФормированиеПозицийДокументаПоставки

// Рассчитывает и обновляет параметр позиций чека для документа поставки
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
// 	ОбъектыРасчетовСПризнакамиСпособаРасчетов - ТаблицаЗначений - таблица сумм поставки по объектам расчетов
// 		документа печати чека с детализацией по признакам способа расчета.
Процедура ОбновитьПараметрыФискальногоЧекаПозицийЧекаПоДокументуПоставки(ПараметрыФискальногоЧека, ОбъектыРасчетовСПризнакамиСпособаРасчетов) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Рассчитывает и обновляет параметр таблицы оплат чека для документа поставки
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
// 	СтруктуруОплатДокументаПоставки - Структура - Суммы оплат по видам оплат
Процедура ОбновитьПараметрыФискальногоЧекаТаблицыОплатПоДокументуПоставки(ПараметрыФискальногоЧека, СтруктуруОплатДокументаПоставки) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область ФормированиеПозицийДокументаОплаты

// Рассчитывает и обновляет параметр позиций чека для документа оплаты
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
// 	ОбъектыРасчетовСПризнакамиСпособаРасчетов - ТаблицаЗначений - таблица сумм поставки по объектам расчетов документа
// 		печати чека с детализацией по признакам способа расчета.
// 	ИмяКомандыПробитияЧека - Строка - Имя команды пробития чека
Процедура ОбновитьПараметрыФискальногоЧекаПозицийЧекаПоДокументуОплаты(ПараметрыФискальногоЧека, ОбъектыРасчетовСПризнакамиСпособаРасчетов, ИмяКомандыПробитияЧека) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Рассчитывает и обновляет параметр таблицы оплат чека для документа оплаты
// 
// Параметры:
// 	ПараметрыФискальногоЧека - Структура - Параметры фискального чека
// 	СуммаДокумента - Структура - Суммы оплат по видам оплат
Процедура ОбновитьПараметрыФискальногоЧекаТаблицыОплатПоДокументуОплаты(ПараметрыФискальногоЧека, СуммаДокумента) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//++ Локализация
//-- Локализация

#КонецОбласти