
#Область СлужебныйПрограммныйИнтерфейс

// Описывает учетные механизмы используемые в локализуемой конфигурации.
//
// Параметры:
//  МеханизмыКонфигурации - Структура - список учетных механизмов,
//              где Ключ - имя механизма, а Значение - модуль реализующий интерфейс проведения.
//
Процедура ДополнитьУчетныеМеханизмыКонфигурации(МеханизмыКонфигурации) Экспорт
	
	//++ Локализация
	
	МеханизмыКонфигурации.Вставить("ТМЦВЭксплуатации", "ТМЦВЭксплуатации");
	МеханизмыКонфигурации.Вставить("УчетАкцизногоНалога", "УчетАкцизногоНалога");
	
	//-- Локализация
	
КонецПроцедуры

// Формирует задания на отложенные движения исходя из выполненных движений по регистрам.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - менеджер временных таблиц,
//      используемый для хранения таблиц контроля изменений регистров.
//
Процедура СформироватьЗаданияНаОтложенныеДвижения(Документ, МенеджерВременныхТаблиц) Экспорт
	
	//++ Локализация
    
	
	НДСИсходящийСервер.ОтразитьЗаданияКФормированиюИсходящихНалоговыхДокументов(Документ, МенеджерВременныхТаблиц)
	
	//-- Локализация
	
КонецПроцедуры

// Заменяет стандартный модуль менеджера документа при получении данных для проведения,
// для случаев, когда стандартный модуль менеджера не может быть использован
// (например, при интеграции проведения в библиотечные документы).
// 
// Параметры:
//  МодульДокумента - ДокументМенеджер - модуль менеджера документа по умолчанию.
//
Процедура ПереназначитьМодульПолученияДанныхДокумента(МодульДокумента) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

#Область ДополнениеМеханизмовЛокализуемымиДокументами

// Дополняет параметры для проведения документа по регистрам учетного механизма.
//
// Параметры:
//   ДополнительныеДокументы - Структура - регистры и документы по которым требуются движения и контроль
//
Процедура ЗаполнитьЛокальныеДокументыОбеспечения(ДополнительныеДокументы) Экспорт
	
	//++ Локализация
	//-- Локализация
	Возврат;
	
КонецПроцедуры

// Дополняет параметры для проведения документа по регистрам учетного механизма.
//
// Параметры:
//   ДополнительныеДокументы - Структура - регистры и документы по которым требуются движения и контроль
//
Процедура ЗаполнитьЛокальныеДокументыДвиженияТоваров(ДополнительныеДокументы) Экспорт
	
	//++ Локализация
	//-- Локализация
	Возврат;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
