#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает массив видов ценностей, относящихся к услугам и доп. расходам.
//
// Возвращаемое значение: 
//     Массив - массив значений вида ПеречислениеСсылка.ВидыЦенностей.
//
Функция МассивВидовЦенностиУслугДляУчетаСебестоимости() Экспорт
	
	ВидыЦенностей = Новый Массив;
	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.ПрочиеРаботыИУслуги);
//	ВидыЦенностей.Добавить(Перечисления.ВидыЦенностей.ЭлектронныеУслуги);
	
	Возврат ВидыЦенностей;
	
КонецФункции

#КонецОбласти

#КонецЕсли