///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
	МодульВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Ложь);
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПросмотрОтветовПростыеВопросы");
	НастройкиВарианта.Описание = НСтр("ru='Информация о том, как отвечали респонденты на простые вопросы.';uk='Інформація про те, як респонденти відповідали на прості запитання.'");
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПросмотрТабличныхВопросовПлоскийВид");
	НастройкиВарианта.Описание = 
		НСтр("ru='Информация о том, как отвечали респонденты на табличные вопросы.
        |Выводится в виде списка с группировками.'
        |;uk='Інформація про те, як респонденти відповідали на табличні питання.
        |Виводиться у вигляді списку з групуваннями.'");
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПросмотрТабличныхВопросовТабличныйВид");
	НастройкиВарианта.Описание = 
		НСтр("ru='Информация о том, как  отвечали респонденты на табличные вопросы.
        |Каждый ответ респондента представлен в виде таблицы.'
        |;uk='Інформація про те, як респонденти відповідали на табличні питання.
        |Кожна відповідь респондента представлена у вигляді таблиці.'");
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПростыеВопросыКоличествоОтветов");
	НастройкиВарианта.Описание = НСтр("ru='Информация о том, сколько раз был дан вариант ответа на простой вопрос.';uk='Інформація про те, скільки разів був даний варіант відповіді на просте питання.'");
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПростыеВопросыАгрегируемыеПоказатели");
	НастройкиВарианта.Описание = 
		НСтр("ru='Информация о среднем, минимальном, максимальном ответе на простой вопрос,
        |который требует числового ответа.'
        |;uk='Інформація про середню, мінімальну, максимальну відповіді на просте питання,
        |яке вимагає числової відповіді.'");
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ТабличныеВопросыКоличествоОтветов");
	НастройкиВарианта.Описание = 
		НСтр("ru='Информация о том, сколько раз был дан варианта ответа для табличных вопросов,
        |который требует указания числового значения.'
        |;uk='Інформація про те, скільки разів було дано варіант відповіді для табличних питань,
        |який вимагає зазначення числового значення.'");
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ТабличныеВопросыАгрегируемыеПоказатели");
	НастройкиВарианта.Описание = 
		НСтр("ru='Информация о среднем, минимальном, максимальном ответе в ячейке табличного вопроса,
        |который требует указания числового значения.'
        |;uk='Інформація про середню, мінімальну, максимальну відповіді в комірці табличного питання,
        |яке вимагає зазначення числового значення.'");
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ПростыеВопросыКоличествоОтветовСравнениеПоОпросам");
	НастройкиВарианта.Описание = 
		НСтр("ru='Сравнительный анализ количества данных вариантов ответов 
        |на простые вопросы в разных опросах.'
        |;uk='Порівняльний аналіз кількості даних варіантів відповідей 
        |на прості запитання в різних опитуваннях.'");
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ТабличныеВопросыАгрегируемыеПоказателиСравнениеПоОпросам");
	НастройкиВарианта.Описание = 
		НСтр("ru='Сравнительный анализ агрегируемых показателей ответов в ячейках
        |табличных вопросов разных опросов.'
        |;uk='Порівняльний аналіз показників відповідей, які агрегуються, у комірках
        |табличних питань різних опитувань.'");
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#КонецЕсли