
#Область ПрограммныйИнтерфейс


// Процедура из таблицы значений выбирает наиболее раннюю актуальную информацию.
// Например, имеем:
// 	1.01.2013 - А
//  1.02.2013 - Б
//  1.03.2013 - А  <--
//  1.04.2013 - А
//  1.05.2013 - А
// В данном случае будет выбрана третья строка, поскольку информация в ней актуальна по сравнению с последней записью,
// и между выбранной и последней строками информация одинакова.
//
// Параметры
//	ТаблицаЗначений - ТаблицаЗначений - таблица значений с данными, из которых будет производиться выбор
//	ПриемникДанных - Произвольный - содержит в себе объект-приемник выбранных данных (например, форма, строка таблицы значений и т.д.)
//	ПараметрСравнения - Строка - параметр, по которому будет идти сравнение на актуальность.
Процедура ЗагрузитьНаиболееРанниеДанныеВРеквизитыФормы(ТаблицаЗначений, ПриемникДанных, ПараметрыСравнения) Экспорт
	
	СтрокаНайдена = Ложь;

	ПредыдущаяСтрока = Неопределено;
	
	Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
		Для Каждого ПараметрСравнения Из ПараметрыСравнения Цикл
			Если ПредыдущаяСтрока <> Неопределено 
				И СтрокаТаблицы[ПараметрСравнения] <> ПредыдущаяСтрока[ПараметрСравнения] Тогда
				СтрокаНайдена = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если СтрокаНайдена Тогда
			Прервать;
		КонецЕсли;
		ПредыдущаяСтрока = СтрокаТаблицы;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ПредыдущаяСтрока) Тогда
		ЗаполнитьЗначенияСвойств(ПриемникДанных, ПредыдущаяСтрока);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ДополнитьСписокРеквизитовОрганизации(Реквизиты) Экспорт
	//++ Локализация
    Реквизиты.Вставить("КодПоЕДРПОУ", "");
    Реквизиты.Вставить("КодКВЕД", "");
    Реквизиты.Вставить("ВЭД", "");
    Реквизиты.Вставить("КодОПФГ", "");
    Реквизиты.Вставить("ОПФГ", "");
    Реквизиты.Вставить("НалоговаяИнспекция", "");
	//-- Локализация
КонецПроцедуры

Процедура ДополнитьРеквизитыОрганизации(Организация, СтруктураРеквизитов, ВыборкаПоОрганизации, Период = '00010101') Экспорт  
	//++ Локализация
	//++ НЕ БЗК
	ПараметрыСистемыНалогообложения = НастройкиНалоговУчетныхПолитик.ДействующиеПараметрыНалоговУчетныхПолитик(
			"НастройкиСистемыНалогообложения",
			Организация,
			Период
    );
	Если ПараметрыСистемыНалогообложения <> Неопределено Тогда
		ИнформацияОСтатусеПлательщикаНалогов = ПараметрыСистемыНалогообложения.ИнформацияОСтатусеПлательщикаНалогов;
	Иначе
		ИнформацияОСтатусеПлательщикаНалогов = "";
    КонецЕсли;
    СтруктураРеквизитов.Вставить("ИнформацияОСтатусеПлательщикаНалогов", ИнформацияОСтатусеПлательщикаНалогов);
    
	ПараметрыНастройкиУчетаНДС = НастройкиНалоговУчетныхПолитик.ДействующиеПараметрыНалоговУчетныхПолитик(
			"НастройкиУчетаНДС",
			Организация,
			Период
    );
	Если ПараметрыНастройкиУчетаНДС <> Неопределено Тогда
		ИННПлательщикаНДС                = ПараметрыНастройкиУчетаНДС.ИННПлательщикаНДС;
        НомерСвидетельстваПлательщикаНДС = ПараметрыНастройкиУчетаНДС.НомерСвидетельстваПлательщикаНДС;
		КодФилиала                       = Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ОбособленноеПодразделениеПоУмолчанию.Префикс"));
	Иначе
		ИННПлательщикаНДС                = "";
        НомерСвидетельстваПлательщикаНДС = "";
        КодФилиала                       = "";
    КонецЕсли;
    СтруктураРеквизитов.Вставить("ИННПлательщикаНДС", ИННПлательщикаНДС);
    СтруктураРеквизитов.Вставить("НомерСвидетельстваПлательщикаНДС", НомерСвидетельстваПлательщикаНДС);
    СтруктураРеквизитов.Вставить("КодФилиала", КодФилиала);
	//-- НЕ БЗК
	//-- Локализация
КонецПроцедуры

#Область ПодключаемыеКоманды

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//   Параметры - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	//++ Локализация
    //++ НЕ БЗК
    Отчеты.УчетныеПолитикиОрганизаций.ДобавитьКомандуОтчета(КомандыОтчетов);
    //-- НЕ БЗК
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытийФормы

// Обработчик события ПриСозданииНаСервере форм элемента справочника Организации.
//
// Параметры:
//  Форма                - ФормаКлиентскогоПриложения - форма, для которой выполняется обработчик.
//  Отказ                - Булево - признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - признак выполнения стандартной (системной) обработки события.
//
Процедура ПриСозданииНаСервереФормаЭлемента(Форма, Отказ, СтандартнаяОбработка) Экспорт
	НастройкиСистемыЛокализация.УстановитьВидимостьЭлементовЛокализации(Форма);
	//++ Локализация
	ЗаполнитьОписанияПараметров(Форма);
	УправлениеФормойНаСервере(Форма);
	//-- Локализация
КонецПроцедуры

// Обработчик события ПриЗаписи
// 
// Параметры:
// 	ОбъектЗаписи - СправочникОбъект.Организации - записываемый справочник
// 	Отказ - Булево - Признак отказа
//
Процедура ПриЗаписиОрганизации(ОбъектЗаписи, Отказ) Экспорт 
	//++ Локализация	
	//-- Локализация
КонецПроцедуры

// Обработчик события ОбработкаЗаполнения
// 
// Параметры:
// 	ОбъектЗаписи - СправочникОбъект.Организации - записываемый справочник
// 	ДанныеЗаполнения - Произвольный - данные заполнения
// 	СтандартнаяОбработка - Булево - признак стандартной обработки
//
Процедура ОбработкаЗаполненияОрганизации(ОбъектЗаписи, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	//++ Локализация
	Если ЗначениеЗаполнено(ДанныеЗаполнения) И ДанныеЗаполнения.Свойство("ВидОрганизации") Тогда
		Если ДанныеЗаполнения.ВидОрганизации = "ЮридическоеЛицо" Тогда
			ОбъектЗаписи.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо");
			ОбъектЗаписи.ОбособленноеПодразделение = Ложь;
		ИначеЕсли ДанныеЗаполнения.ВидОрганизации = "ИндивидуальныйПредприниматель" Тогда 
			ОбъектЗаписи.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ИндивидуальныйПредприниматель");
			ОбъектЗаписи.ОбособленноеПодразделение = Ложь;
		ИначеЕсли ДанныеЗаполнения.ВидОрганизации = "ОбособленноеПодразделение" Тогда
			ОбъектЗаписи.ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.ЮрФизЛицо.ЮрЛицо");
			ОбъектЗаписи.ОбособленноеПодразделение = Истина;
		Иначе ВызватьИсключение НСтр("ru='Создание организации невозможно. На форму переданы неверные параметры.
|Обратитесь к администратору.'
|;uk='Створення організації неможливо. На форму передані невірні параметри.
|Зверніться до адміністратора.'");
		КонецЕсли;
	КонецЕсли;	
	//-- Локализация	
КонецПроцедуры

// Вызывается при создании/чтении формы на сервере
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма обработчика
//
Процедура ПриСозданииЧтенииНаСервере(Форма) Экспорт
	//++ Локализация
	Форма.ПравоИзмененияОбъекта = ПравоДоступа("Изменение", Метаданные.Справочники.Организации);
	ОрганизацииКлиентСерверЛокализация.УправлениеДоступностью(Форма);
	//-- Локализация
КонецПроцедуры

// Обработчик события ПередЗаписьюНаСервере
// 
// Параметры:
// 	см. параметры платформенного обработчика ПередЗаписьюНаСервере.
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи, Форма) Экспорт
	//++ Локализация
	//-- Локализация
КонецПроцедуры

// Обработчик события ОбработкаПроверкиЗаполненияНаСервере
// 
// Параметры:
// 	Отказ - Булево - признак отказа.
// 	ПроверяемыеРеквизиты - Массив - массив путей к проверяемым реквизитам.
// 	Форма - ФормаКлиентскогоПриложения - форма обработчика.
//
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты, Форма) Экспорт
	//++ Локализация	
	//-- Локализация	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

Процедура УправлениеФормойНаСервере(Форма) Экспорт
	//++ Локализация
	ВидОрганизации =  Форма.ВидОрганизации;
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	ТолькоПросмотр = Форма.ТолькоПросмотр;
	УправлениеПредприятием = Истина; //Для БЗК
	//++ НЕ БЗК
	УправлениеПредприятием = НЕ ПолучитьФункциональнуюОпцию("УправлениеТорговлей");
	//-- НЕ БЗК
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСтраницОсновныхКодов",
																	"ТекущаяСтраница", Элементы.ОсновныеКоды);
	ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(Элементы, "ДопускаютсяВзаиморасчетыЧерезГоловнуюОрганизацию",
																	"Видимость", (ВидОрганизации = "ОбособленноеПодразделение"));
	
	Если НЕ УправлениеПредприятием Тогда
		ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементовФормы(
				Элементы, 
                "ЛокализацияГруппаРегистрационныеДанные, ГруппаГрафикРаботыОтступ, ГруппаКадровыйУчетИРасчетЗарплатыОтступ, ГруппаБухучетИВыплатаЗарплатыОтступ, ГруппаВоинскийУчетОтступ, ГруппаРезервыОтпусковОтступ, ГруппаСпециальныеРежимыЗарплатаКадрыОтступ",
				"Видимость", 
				Ложь);
	КонецЕсли;
	
	//++ НЕ БЗК
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьОбособленныеПодразделенияВыделенныеНаБаланс")
		И НЕ ВидОрганизации = "ОбособленноеПодразделение" Тогда
		ЭлементСписка = Элементы.ВидОрганизации.СписокВыбора.НайтиПоЗначению("ОбособленноеПодразделение");
		
		Если ЭлементСписка <> Неопределено Тогда
			Элементы.ВидОрганизации.СписокВыбора.Удалить(ЭлементСписка);	
		КонецЕсли;
		
	КонецЕсли;
	ДоступностьИзмененияУчетнойПолитикиИНалогов = 
								ПравоДоступа("Изменение", Метаданные.РегистрыСведений.НастройкиСистемыНалогообложения);
	УстановитьСвойстваУчетнойПолитикиИНалогов(Форма);
	//-- НЕ БЗК
	
    
	НеУправленческаяОрганизация = Объект.Ссылка <> Справочники.Организации.УправленческаяОрганизация;
	Элементы.ВидОрганизации.Видимость                          = НеУправленческаяОрганизация;
    Элементы.КодПоЕДРПОУ.Видимость                                 = НеУправленческаяОрганизация;
    Элементы.НалоговаяИнспекция.Видимость                          = НеУправленческаяОрганизация;
	
	ВидимостьКомандПомощникаКопированияНастроек = Ложь; //Для БЗК
	//++ НЕ БЗК
	ВидимостьКомандПомощникаКопированияНастроек = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") 
												И ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.УчетнаяПолитикаФинансовогоУчета);
	//-- НЕ БЗК											
												
	Элементы.ЛокализацияГруппаКопированиеНастроек.Видимость = ВидимостьКомандПомощникаКопированияНастроек;
	Элементы.СкопироватьНастройкиУчетаИз.Видимость = ВидимостьКомандПомощникаКопированияНастроек;
	Элементы.СкопироватьНастройкиУчетаВсе.Видимость = ВидимостьКомандПомощникаКопированияНастроек;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаИУправлениеПерсоналом") Тогда
		    ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Элементы,
				"ГруппаУчетнаяПолитикаИДругиеНастройки",
				"Видимость",
				Ложь);
			ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
						Элементы,
						"ГруппаУчетНДС",
						"Видимость",
						Ложь);
			ОбщегоНазначенияУТКлиентСервер.УстановитьСвойствоЭлементаФормы(
						Элементы,
						"ВестиУчетДенежныхСредствПоОбособленнымПодразделениям",
						"Видимость",
						Ложь);	
	КонецЕсли;	
	//-- Локализация
КонецПроцедуры

Процедура УчетнаяПолитикаПриИзмененииСервер(Форма) Экспорт
	//++ Локализация
	УстановитьСвойстваУчетнойПолитикиИНалогов(Форма);
	//-- Локализация
КонецПроцедуры

Процедура ПриОкончанииИзмененияРеквизита(ИмяЭлемента, Форма, ПараметрыОбработки) Экспорт
	Если ТипЗнч(ИмяЭлемента) = Тип("Массив") Тогда
		Для каждого ТекЭлемент Из ИмяЭлемента Цикл
			ПриОкончанииИзмененияРеквизита(ТекЭлемент, Форма, ПараметрыОбработки);
		КонецЦикла;
	КонецЕсли;
	//++ Локализация
	Если ИмяЭлемента = "ВидОрганизации" Тогда
		ИзменитьВидОрганизацииНаСервере(Форма);
	КонецЕсли;
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

Процедура ВыполнитьКомандуЛокализации(Форма, ИмяКоманды, ПараметрыОбработки) Экспорт
	
	Если ТипЗнч(ИмяКоманды) = Тип("Массив") Тогда
		Для каждого ТекЭлемент Из ИмяКоманды Цикл
			ВыполнитьКомандуЛокализации(Форма, ТекЭлемент, ПараметрыОбработки);
		КонецЦикла;
	КонецЕсли;
	//++ Локализация	
	Если ИмяКоманды = "ЗаполнитьОписаниеГосРегистрации"
	Тогда
		ЗаполнитьОписанияПараметров(Форма, ИмяКоманды);
	КонецЕсли;
	Если ИмяКоманды = "ЗаполнитьОписанияПараметров" Тогда
		ЗаполнитьОписанияПараметров(Форма);
	КонецЕсли;
	Если ИмяКоманды = "УстановитьСвойстваУчетнойПолитикиИНалогов" Тогда
		УстановитьСвойстваУчетнойПолитикиИНалогов(Форма);
	КонецЕсли;
	//-- Локализация
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиМодуляОбъекта

Процедура ОбработкаПроверкиЗаполнения(ОрганизацияОбъект, Отказ, ПроверяемыеРеквизиты) Экспорт
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеСлужебныеМетоды

Процедура УстановитьПараметрыЗапросаПриОбработкеПолученияДанныхВыбора(Параметры, Запрос) Экспорт

	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

Процедура ДополнитьСоответствиеЭлементовФормыПараметрамНалоговУчетныхПолитик(СоответствиеЭлементов) Экспорт
	
	МассивЭлементов = Новый Массив();
	МассивЭлементов.Добавить("ГруппаНастройкиСистемыНалогообложенияОтступ");
	МассивЭлементов.Добавить("ОтступНастройкиСистемыНалогообложения");
	МассивЭлементов.Добавить("ГруппаНастройкиСистемыНалогообложения");
	МассивЭлементов.Добавить("ОписаниеНастройкиСистемыНалогообложения");
	МассивЭлементов.Добавить("ОткрытьНастройкиСистемыНалогообложения");
	
	СоответствиеЭлементов.Вставить("НастройкиСистемыНалогообложения", МассивЭлементов);
	
	МассивЭлементов = Новый Массив();
	МассивЭлементов.Добавить("ГруппаУчетнаяПолитикаБухУчетаОтступ");
	МассивЭлементов.Добавить("ОтступУчетнаяПолитикаБухУчета");
	МассивЭлементов.Добавить("ГруппаУчетнаяПолитикаБухУчета");
	МассивЭлементов.Добавить("ОписаниеУчетнаяПолитикаБухУчета");
	МассивЭлементов.Добавить("ОткрытьУчетнаяПолитикаБухУчета");
	
	СоответствиеЭлементов.Вставить("УчетнаяПолитикаБухУчета", МассивЭлементов);

	МассивЭлементов = Новый Массив();
	МассивЭлементов.Добавить("ГруппаНастройкиУчетаНалогаНаПрибыльОтступ");
	МассивЭлементов.Добавить("ОтступНастройкиУчетаНалогаНаПрибыль");
	МассивЭлементов.Добавить("ГруппаНастройкиУчетаНалогаНаПрибыль");
	МассивЭлементов.Добавить("ОписаниеНастройкиУчетаНалогаНаПрибыль");
	МассивЭлементов.Добавить("ОткрытьНастройкиУчетаНалогаНаПрибыль");
	
	СоответствиеЭлементов.Вставить("НастройкиУчетаНалогаНаПрибыль", МассивЭлементов);

	МассивЭлементов = Новый Массив();
	МассивЭлементов.Добавить("ГруппаНастройкиУчетаЕНОтступ");
	МассивЭлементов.Добавить("ОтступНастройкиУчетаЕН");
	МассивЭлементов.Добавить("ГруппаНастройкиУчетаЕН");
	МассивЭлементов.Добавить("ОписаниеНастройкиУчетаЕН");
	МассивЭлементов.Добавить("ОткрытьНастройкиУчетаЕН");
	
	СоответствиеЭлементов.Вставить("НастройкиУчетаЕН", МассивЭлементов);
КонецПроцедуры

Процедура ЗаполнитьОписаниеДействующихПараметровУчетныхПолитикПриИзмененииГоловнойОрганизации(Форма, ИмяРегистра = "") Экспорт
	СоответствиеЭлементов = Справочники.Организации.СоответствиеЭлементовФормыПараметрамНалоговУчетныхПолитик();
	//++ НЕ БЗК
	НастройкиНалоговУчетныхПолитик.УправлениеВидимостьюЭлементовУчетныхПолитик(Форма, СоответствиеЭлементов, Форма.Объект.ГоловнаяОрганизация);
	НастройкиНалоговУчетныхПолитик.ЗаполнитьОписаниеДействующихПараметров(Форма, Форма.Объект.ГоловнаяОрганизация, ИмяРегистра);
	//-- НЕ БЗК
	ОрганизацииЛокализация.УчетнаяПолитикаПриИзмененииСервер(Форма);
КонецПроцедуры

//++ Локализация

Функция ИзменитьКодПоЕДРПОУ(СсылкаНаОбъект) Экспорт
	КодПоЕДРПОУ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "КодПоДРФО");
	Возврат КодПоЕДРПОУ
КонецФункции      

//-- Локализация

Функция ВозможнаРегистрацияДляОбособленныхПодразделений() Экспорт
	//++ Локализация
	//-- Локализация
	Возврат Ложь
КонецФункции


#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытийЭлементовШапкиФормы_Служебные
//++ Локализация
Процедура ИзменитьВидОрганизацииНаСервере(Форма)
КонецПроцедуры
//-- Локализация
#КонецОбласти
//++ Локализация

Процедура УстановитьСвойстваУчетнойПолитикиИНалогов(Форма)
КонецПроцедуры

#Область ЗаполнениеОписаний

Процедура ЗаполнитьОписанияПараметров(Форма, ИмяОписания = "")
	
    ЗаполнитьОписаниеГосРегистрации(Форма);
	
КонецПроцедуры



Процедура ЗаполнитьОписаниеГосРегистрации(Форма, ИмяОписания = "")
	
	Если ЗначениеЗаполнено(ИмяОписания)
		И ИмяОписания <> "ЗаполнитьОписаниеГосРегистрации" Тогда
		
		Возврат
		
	КонецЕсли;
	
	СтрокаОписанияРеквизитовГосРегистрации = НСтр("ru='Дата регистрации: %ДатаРегистрации%. Номер регистрации: %НомерРегистрации%. Кем зарегистрирована: %КемЗарегистрирована%';uk='Дата реєстрації: %ДатаРегистрации%. Номер реєстрації: %НомерРегистрации%. Ким зареєстрована: %КемЗарегистрирована%'");
	
	СтрокаОписанияРеквизитовГосРегистрации = СтрЗаменить(
		СтрокаОписанияРеквизитовГосРегистрации, 
		"%ДатаРегистрации%",  
		?(ЗначениеЗаполнено(Форма.Объект.ДатаРегистрации), 
			Форма.Объект.ДатаРегистрации, 
			НСтр("ru='не указано';uk='не вказано'")
		)
	);
																						
	СтрокаОписанияРеквизитовГосРегистрации = СтрЗаменить(
		СтрокаОписанияРеквизитовГосРегистрации, 
		"%НомерРегистрации%",
		?(ЗначениеЗаполнено(Форма.Объект.НомерРегистрации),
			Форма.Объект.НомерРегистрации, 
			НСтр("ru='не указано';uk='не вказано'")
		)
	);
	
	СтрокаОписанияРеквизитовГосРегистрации = СтрЗаменить(
		СтрокаОписанияРеквизитовГосРегистрации, 
		"%КемЗарегистрирована%",
		?(ЗначениеЗаполнено(Форма.Объект.КемЗарегистрирована),
			Форма.Объект.КемЗарегистрирована, 
			НСтр("ru='не указано';uk='не вказано'")
		)
	);
	
	Форма.Элементы.ДекорацияОписаниеГосРегистрация.Заголовок = СтрокаОписанияРеквизитовГосРегистрации;
	
КонецПроцедуры

#КонецОбласти
//-- Локализация

#КонецОбласти