#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// Заполняет реквизиты дополнительного упорядочивания этапов процессов продаж.
// Вызывается при первоначальном заполнении ИБ.
//
Процедура НачальноеЗаполнениеПоследовательностиЭтаповПроцессовПродаж() Экспорт
	
	Этапы = Новый Соответствие;
	Этапы.Вставить(Справочники.СостоянияПроцессов.НоваяСделка,                       1);
	Этапы.Вставить(Справочники.СостоянияПроцессов.ПервичныйКонтакт,                  2);
	Этапы.Вставить(Справочники.СостоянияПроцессов.КвалификацияКлиента,               3);
	Этапы.Вставить(Справочники.СостоянияПроцессов.ФормированиеПредложения,           4);
	Этапы.Вставить(Справочники.СостоянияПроцессов.Презентация,                       5);
	Этапы.Вставить(Справочники.СостоянияПроцессов.ДоработкаПредложения,              6);
	Этапы.Вставить(Справочники.СостоянияПроцессов.СогласованиеУсловий,               7);
	Этапы.Вставить(Справочники.СостоянияПроцессов.ПодготовкаКВыполнениюОбязательств, 8);
	Этапы.Вставить(Справочники.СостоянияПроцессов.ВыполнениеОбязательств,            9);
	
	Для Каждого Этап Из Этапы Цикл
		ЭтапОбъект = Этап.Ключ.ПолучитьОбъект();
		ЭтапОбъект.РеквизитДопУпорядочивания = Этап.Значение;
		ЭтапОбъект.Описание                  = ОписаниеПредопределенногоСостоянияПроцесса(Этап.Ключ);
		ЭтапОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ОписаниеПредопределенногоСостоянияПроцесса(ЭтапПроцесса);
	
	Если ЭтапПроцесса = Справочники.СостоянияПроцессов.НоваяСделка Тогда
	
		Возврат НСтр("ru='Данный этап отражает факт того, что сделка была зарегистрирована, но никаких других работ по не не проводилось';uk='Даний етап відображає факт того, що угода була зареєстрована, але жодних інших робіт не проводилося'");
	
	ИначеЕсли ЭтапПроцесса = Справочники.СостоянияПроцессов.ПервичныйКонтакт Тогда
	
		Возврат НСтр("ru='На данном этапе необходимо зарегистрировать первичное взаимодействие с клиентом.';uk='На даному етапі необхідно зареєструвати первинну взаємодію з клієнтом.'");
		
	ИначеЕсли ЭтапПроцесса = Справочники.СостоянияПроцессов.КвалификацияКлиента Тогда
	
		Возврат НСтр("ru='На данном этапе клиент должен быть определен и зарегистрирован в качестве партнера.';uk='На даному етапі клієнт повинен бути визначений і зареєстрований в якості партнера.'");
		
	ИначеЕсли ЭтапПроцесса = Справочники.СостоянияПроцессов.ФормированиеПредложения Тогда
	
		Возврат НСтр("ru='Данный этап посвящен формированию коммерческого предложения.';uk='Даний етап присвячений формуванню комерційної пропозиції.'");
		
	ИначеЕсли ЭтапПроцесса = Справочники.СостоянияПроцессов.Презентация Тогда
	
		Возврат НСтр("ru='Данный этап посвящен презентации, если таковая необходима.';uk='Даний етап присвячений презентації, якщо така необхідна.'");
		
	ИначеЕсли ЭтапПроцесса = Справочники.СостоянияПроцессов.ДоработкаПредложения Тогда
	
		Возврат НСтр("ru='Данный этап посвящен доработке коммерческого предложения, если таковая необходима.';uk='Даний етап присвячений доопрацюванню комерційної пропозиції, якщо таке необхідно.'");
		
	ИначеЕсли ЭтапПроцесса = Справочники.СостоянияПроцессов.СогласованиеУсловий Тогда
	
		Возврат НСтр("ru='На данном этапе должно быть определено соглашение с клиентом, определяющее условия продаж.';uk='На даному етапі повинна бути визначена оферта клієнту, що визначає умови продажів.'");
		
	ИначеЕсли ЭтапПроцесса = Справочники.СостоянияПроцессов.ПодготовкаКВыполнениюОбязательств Тогда
	
		Возврат НСтр("ru='Данный этап посвящен подготовке к выполнению обязательств по сделке.';uk='Даний етап присвячений підготовці до виконання зобов''язань по угоді.'");
		
	ИначеЕсли ЭтапПроцесса = Справочники.СостоянияПроцессов.ВыполнениеОбязательств Тогда
	
		Возврат НСтр("ru='На данном этапе должны быть оплачены и отгружены все товары по сделке.';uk='На даному етапі повинні бути оплачені і відвантажені всі товари за угодою.'");
	
	Иначе
	
		Возврат "";
	
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли