
&НаСервере
Процедура УстановитьНаСервере()
	
	Объект.Устанавливался = Справочники.НСИСДополнительныеФайлы.УстановитьДополнительныйФайл(Объект.Ссылка);
	Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПоместитьНаСервере()
	
	АдресДанных = ПоместитьВоВременноеХранилище(ДанныеФормыВзначение(Объект, Тип("СправочникОбъект.НСИСДополнительныеФайлы")).Файл.Получить(), Новый УникальныйИдентификатор)
	
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	УстановитьНаСервере();
	ОбновитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступность()
	
	Элементы.ФормаУстановить.Доступность = НЕ Объект.Устанавливался И Объект.ДанныеЗагружены;
	Элементы.Выгрузить.Доступность = Объект.ДанныеЗагружены;
	Элементы.Очистить.Доступность = Объект.ДанныеЗагружены;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановленПриИзменении(Элемент)
	
	ОбновитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	ПоместитьНаСервере();
	
	ПолноеИмяФайлаВыбор = "";
	#Если ВебКлиент Тогда
		
		ПолучитьФайл(АдресДанных,Объект.Идентификатор+"."+Объект.Тип, Истина);
		
	#Иначе
		
		// инициализируем диалог выбора файлов
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		Диалог.ПроверятьСуществованиеФайла = Истина;
		Диалог.Расширение = Объект.Тип;
		Диалог.Фильтр = "(*."+Объект.Тип+")|*."+Объект.Тип;
		
		Диалог.ПолноеИмяФайла = Объект.Идентификатор+"."+Объект.Тип;
		
		// показываем диалог
		Если НЕ Диалог.Выбрать() Тогда
			Возврат;
		Иначе
			ПолноеИмяФайлаВыбор = Диалог.ПолноеИмяФайла;
		КонецЕсли;
		
		ПолучитьИзВременногоХранилища(АдресДанных).Записать(ПолноеИмяФайлаВыбор);
		
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере()
	
	ОбъектФайл = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.НСИСДополнительныеФайлы"));
	ОбъектФайл.Файл = Неопределено;
	ЗначениеВДанныеФормы(ОбъектФайл, Объект);
	Объект.ДанныеЗагружены = Ложь;	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьНаСервере();
	ОбновитьДоступность();
КонецПроцедуры
