#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Соответствие со списком реквизитов, по которым определяется уникальность ключа
// 
// Возвращаемое значение:
//   Соответствие - ключ - имя реквизита 
//
Функция КлючевыеРеквизиты() Экспорт
	
	Возврат ОбщегоНазначенияУТ.КлючевыеРеквизитыСправочникаКлючейПоРегиструСведений(Метаданные.РегистрыСведений.АналитикаУчетаНоменклатуры);
	
КонецФункции

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

#Область ЗаменаДублейКлючейАналитики

Процедура ЗаменитьДублиКлючейАналитики() Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ДанныеСправочника.Ссылка КАК Ссылка,
	|	ДанныеСправочника.ПометкаУдаления КАК ПометкаУдаления,
	|	Аналитика.КлючАналитики КАК КлючАналитики
	|ИЗ
	|	Справочник.КлючиАналитикиУчетаНоменклатуры КАК ДанныеСправочника
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаНоменклатуры КАК ДанныеРегистра
	|	ПО
	|		ДанныеСправочника.Ссылка = ДанныеРегистра.КлючАналитики
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|	ПО
	|		ДанныеСправочника.Номенклатура		= Аналитика.Номенклатура
	|		И ДанныеСправочника.Характеристика	= Аналитика.Характеристика
	|		И ДанныеСправочника.Серия			= Аналитика.Серия
	|		И ДанныеСправочника.МестоХранения	= Аналитика.МестоХранения
	|		И ДанныеСправочника.Назначение		= Аналитика.Назначение
	|		И ДанныеСправочника.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|ГДЕ
	|	ДанныеРегистра.КлючАналитики ЕСТЬ NULL
	|");
	
	// Сформируем соответствие ключей аналитики.
	СоответствиеАналитик = Новый Соответствие;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
	
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СоответствиеАналитик.Вставить(Выборка.Ссылка, Выборка.КлючАналитики);
			
			Если Не Выборка.ПометкаУдаления Тогда
				СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
				Попытка
					СправочникОбъект.УстановитьПометкуУдаления(Истина, Ложь);
				Исключение
					ВызватьИсключение;
				КонецПопытки;
			КонецЕсли;

		КонецЦикла;
		Исключения = Новый Массив;
		Исключения.Добавить(Метаданные.РегистрыСведений.СтоимостьТоваров);
		ОбщегоНазначенияУТ.ЗаменитьСсылки(СоответствиеАналитик, Исключения);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы


// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
//  Обработчики - ТаблицаЗначений - описание полей, см. в процедуре
//                ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия              = "1.1.0.0";
//  Обработчик.Процедура           = "ОбновлениеИБ.ПерейтиНаВерсию_1_1_0_0";
//  Обработчик.МонопольныйРежим    = Ложь;
//
// Параметры:
// 	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ОписаниеОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.5.4.400";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("8540cd6e-6715-4db9-bdaa-efbdd707f9e7");
	Обработчик.Процедура = "Справочники.КлючиАналитикиУчетаНоменклатуры.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "Справочники.КлючиАналитикиУчетаНоменклатуры.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.ЗапускатьТолькоВГлавномУзле = Истина;
	Обработчик.ЧитаемыеОбъекты = ""
		+ "РегистрНакопления.ТоварыОрганизацийКПередаче,"
		+ "Справочник.Назначения,"
		+ "РегистрНакопления.ПартииПроизводственныхЗатрат,"
		+ "РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров,"
		+ "РегистрСведений.АналитикаУчетаНоменклатуры,"
		+ "РегистрНакопления.ТоварыОрганизаций,"
		+ "РегистрНакопления.ПартииТоваровОрганизаций,"
		+ "РегистрНакопления.ДвиженияНоменклатураДоходыРасходы,"
		+ "РегистрНакопления.СебестоимостьТоваров,"
		+ "РегистрСведений.СтоимостьТоваров,"
		+ "Справочник.КлючиАналитикиУчетаНоменклатуры,"
		+ "РегистрНакопления.Закупки,"
		+ "РегистрНакопления.МатериалыИРаботыВПроизводстве,"
		+ "РегистрНакопления.ВыручкаИСебестоимостьПродаж,"
		+ "Справочник.ВидыЗапасов,"
		+ "РегистрНакопления.ДвиженияНоменклатураНоменклатура,"
		+ "РегистрНакопления.ПартииЗатратНаВыпуск";
	Обработчик.ИзменяемыеОбъекты = "Справочник.КлючиАналитикиУчетаНоменклатуры,"
		+ "РегистрСведений.АналитикаУчетаНоменклатуры";
	Обработчик.БлокируемыеОбъекты = "РегистрСведений.АналитикаУчетаНоменклатуры,"
		+ "Справочник.КлючиАналитикиУчетаНоменклатуры";
	Обработчик.Комментарий = НСтр("ru='Создает новые ключи аналитики учета номенклатуры с заполненным полем Назначение.
                                   |Выполняет заполнение реквизитов ""Тип места хранения"", ""Складская территория"", ""Подразделение"", ""Партнер"", ""Контрагент"" и ""Договор"".
                                   |Также выполняет синхронизацию записей регистра сведений ""Аналитики учета номенклатуры"" в соответствие с изменениями, внесенными в данные справочника ""Ключей аналитики учета номенклатуры"".'
                                   |;uk='Створює нові ключі аналітики обліку номенклатури із заповненим полем Призначення.
                                   |Виконує заповнення реквізитів ""Тип місця зберігання"", ""Складська територія"", ""Підрозділ"", ""Партнер"", ""Контрагент"" та ""Договір"".
                                   |Також виконує синхронізацію записів регістру відомостей ""Аналітики обліку номенклатури"" у відповідність до змін, внесених у дані довідника ""Ключої аналітики обліку номенклатури"".'");
	
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ВнутреннееПотреблениеТоваров.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ВводОстатков.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";
	
	
	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ВнутреннееПотреблениеТоваров.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ВозвратТоваровМеждуОрганизациями.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ВозвратТоваровОтКлиента.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ВозвратТоваровПоставщику.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.КорректировкаНазначенияТоваров.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ОприходованиеИзлишковТоваров.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ПередачаТоваровМеждуОрганизациями.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ПеремещениеТоваров.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ПересортицаТоваров.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ПорчаТоваров.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ПриобретениеТоваровУслуг.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ПрочееОприходованиеТоваров.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.РеализацияТоваровУслуг.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.РеализацияТоваровУслуг.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.СборкаТоваров.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.СписаниеНедостачТоваров.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";
	
	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Документы.ТаможеннаяДекларацияИмпорт.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыНакопления.ВыручкаИСебестоимостьПродаж.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыНакопления.ДвиженияНоменклатураНоменклатура.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";
	
	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыНакопления.Закупки.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыНакопления.МатериалыИРаботыВПроизводстве.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыНакопления.ПартииЗатратНаВыпуск.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыНакопления.ПартииПроизводственныхЗатрат.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыНакопления.ПартииРасходовНаСебестоимостьТоваров.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыНакопления.ПартииТоваровОрганизаций.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыНакопления.СебестоимостьТоваров.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыНакопления.ТоварыОрганизаций.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";
	
	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыНакопления.ТоварыОрганизаций.СгенерироватьДокументыДляПереброскиОстатковСПустогоНазначенияПоДавальческойСхеме";
	НоваяСтрока.Порядок = "Любой";

	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыНакопления.ТоварыОрганизацийКОформлению.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";
	
	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыНакопления.ТоварыОрганизацийКПередаче.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";
	
	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "РегистрыСведений.СтоимостьТоваров.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "До";


	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Справочники.Назначения.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";
	

	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	НоваяСтрока = Обработчик.ПриоритетыВыполнения.Добавить();
	НоваяСтрока.Процедура = "Справочники.Партнеры.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	НоваяСтрока.Порядок = "После";    
	
	ОбновлениеИнформационнойБазыПереопределяемый.ДобавитьПриоритетыОбработатьДанныеДляГенерацииНазначений(
		Обработчик.ПриоритетыВыполнения,
		"После"
	);
	
	Исключения = ОбновлениеИнформационнойБазыПереопределяемый.ИсключенияПриДобавленииПриоритетов();
	ОбновлениеИнформационнойБазыПереопределяемый.ДобавитьПриоритетыСгенерироватьКлючиАналитикиНоменклатуры(
		Обработчик.ПриоритетыВыполнения,
		"До",
		Исключения
	);
	
КонецПроцедуры

// Обработчик обновления УТ 3.5.4
// Регистрирует к обновлению ключи аналитики учета номенклатуры, которые надо пересоздать
// с учетом назначения из вида запасов.
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	
	Запрос = Новый Запрос();
	ТекстЗапроса = ТекстЗапросаГенерацииКлючейКОбработке();
	Запрос.Текст = СтрЗаменить(ТекстЗапроса, "//ВыбиратьВсеКлючи", "И ЛОЖЬ");
	
	УстановитьПараметрыЗапросаКлючей(Запрос);
	
	Ключи = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Ключи);
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлючиАналитикиУчетаНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|ГДЕ
	|	КлючиАналитикиУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.ПустаяСсылка)";
	
	Ключи = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Ключи);
	
КонецПроцедуры

// Метод возвращает текст запроса для выборки ключей к обновлению.
// Используется в обработчиках обновления.
Функция ТекстЗапросаГенерацииКлючейКОбработке() Экспорт
	Возврат "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ключи.Аналитика КАК Ссылка,
	|	Ключи.Назначение КАК Назначение
	|//ПоместитьВТ
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры КАК Аналитика,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ДвиженияНоменклатураДоходыРасходы КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО ДанныеРегистра.ВидЗапасов = СпрВидыЗапасов.Ссылка
	|	ГДЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Назначение <> СпрВидыЗапасов.УстарелоНазначение
	|		И СпрВидыЗапасов.УстарелоНазначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И &ИспользуютсяВидыЗапасов
	|		И &ОтборПоРегистратору
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры КАК Аналитика,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ДвиженияНоменклатураНоменклатура КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО ДанныеРегистра.ВидЗапасов = СпрВидыЗапасов.Ссылка
	|	ГДЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Назначение <> СпрВидыЗапасов.УстарелоНазначение
	|		И СпрВидыЗапасов.УстарелоНазначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И &ИспользуютсяВидыЗапасов
	|		И &ОтборПоРегистратору
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.КорАналитикаУчетаНоменклатуры КАК Аналитика,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ДвиженияНоменклатураНоменклатура КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО ДанныеРегистра.КорВидЗапасов = СпрВидыЗапасов.Ссылка
	|	ГДЕ
	|		ДанныеРегистра.КорАналитикаУчетаНоменклатуры.Назначение <> СпрВидыЗапасов.УстарелоНазначение
	|		И СпрВидыЗапасов.УстарелоНазначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И &ИспользуютсяВидыЗапасов
	|		И &ОтборПоРегистратору
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры КАК Аналитика,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровОрганизаций КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО ДанныеРегистра.ВидЗапасов = СпрВидыЗапасов.Ссылка
	|	ГДЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Назначение <> СпрВидыЗапасов.УстарелоНазначение
	|		И СпрВидыЗапасов.УстарелоНазначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И &ОтборПоРегистратору
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.КорАналитикаУчетаНоменклатуры КАК Аналитика,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровОрганизаций КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО ДанныеРегистра.КорВидЗапасов = СпрВидыЗапасов.Ссылка
	|	ГДЕ
	|		ДанныеРегистра.КорАналитикаУчетаНоменклатуры.Назначение <> СпрВидыЗапасов.УстарелоНазначение
	|		И СпрВидыЗапасов.УстарелоНазначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И &ОтборПоРегистратору
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры КАК Аналитика,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ТоварыОрганизаций КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО ДанныеРегистра.ВидЗапасов = СпрВидыЗапасов.Ссылка
	|	ГДЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Назначение <> СпрВидыЗапасов.УстарелоНазначение
	|		И СпрВидыЗапасов.УстарелоНазначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И &ОтборПоРегистратору
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.КорАналитикаУчетаНоменклатуры КАК Аналитика,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ТоварыОрганизаций КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО ДанныеРегистра.КорВидЗапасов = СпрВидыЗапасов.Ссылка
	|	ГДЕ
	|		ДанныеРегистра.КорАналитикаУчетаНоменклатуры.Назначение <> СпрВидыЗапасов.УстарелоНазначение
	|		И СпрВидыЗапасов.УстарелоНазначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И &ОтборПоРегистратору
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры КАК Аналитика,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ТоварыОрганизацийКПередаче КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО ДанныеРегистра.ВидЗапасовПродавца = СпрВидыЗапасов.Ссылка
	|	ГДЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Назначение <> СпрВидыЗапасов.УстарелоНазначение
	|		И СпрВидыЗапасов.УстарелоНазначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И &ОтборПоРегистратору

	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры КАК Аналитика,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО ДанныеРегистра.ВидЗапасов = СпрВидыЗапасов.Ссылка
	|	ГДЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Назначение <> СпрВидыЗапасов.УстарелоНазначение
	|		И СпрВидыЗапасов.УстарелоНазначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И &ИспользуютсяВидыЗапасов
	|		И &ОтборПоРегистратору
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры КАК Аналитика,
	|		ДанныеРегистра.Назначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.МатериалыИРаботыВПроизводстве КАК ДанныеРегистра
	|	ГДЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Назначение <> ДанныеРегистра.Назначение
	|		И ДанныеРегистра.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И ДанныеРегистра.АналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|		И &ОтборПоРегистратору
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.АналитикаУчетаПродукции КАК Аналитика,
	|		ДанныеРегистра.Назначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.МатериалыИРаботыВПроизводстве КАК ДанныеРегистра
	|	ГДЕ
	|		ДанныеРегистра.АналитикаУчетаПродукции.Назначение <> ДанныеРегистра.Назначение
	|		И ДанныеРегистра.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И ДанныеРегистра.АналитикаУчетаПродукции <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|		И &ОтборПоРегистратору
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры КАК Аналитика,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ПартииЗатратНаВыпуск КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО ДанныеРегистра.ВидЗапасов = СпрВидыЗапасов.Ссылка
	|	ГДЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Назначение <> СпрВидыЗапасов.УстарелоНазначение
	|		И СпрВидыЗапасов.УстарелоНазначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И ДанныеРегистра.АналитикаУчетаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|		И &ОтборПоРегистратору
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.КорАналитикаУчетаПродукции КАК Аналитика,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ПартииЗатратНаВыпуск КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО ДанныеРегистра.КорВидЗапасов = СпрВидыЗапасов.Ссылка
	|	ГДЕ
	|		ДанныеРегистра.КорАналитикаУчетаПродукции.Назначение <> СпрВидыЗапасов.УстарелоНазначение
	|		И СпрВидыЗапасов.УстарелоНазначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И ДанныеРегистра.КорАналитикаУчетаПродукции <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаНоменклатуры.ПустаяСсылка)
	|		И &ОтборПоРегистратору
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры КАК Аналитика,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ПартииПроизводственныхЗатрат КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО ДанныеРегистра.ВидЗапасов = СпрВидыЗапасов.Ссылка
	|	ГДЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Назначение <> СпрВидыЗапасов.УстарелоНазначение
	|		И СпрВидыЗапасов.УстарелоНазначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И &ОтборПоРегистратору
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.КорАналитикаУчетаНоменклатуры КАК Аналитика,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ПартииПроизводственныхЗатрат КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО ДанныеРегистра.ВидЗапасов = СпрВидыЗапасов.Ссылка
	|	ГДЕ
	|		ДанныеРегистра.КорАналитикаУчетаНоменклатуры.Назначение <> СпрВидыЗапасов.УстарелоНазначение
	|		И СпрВидыЗапасов.УстарелоНазначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И &ОтборПоРегистратору
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры КАК Аналитика,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО ДанныеРегистра.ВидЗапасов = СпрВидыЗапасов.Ссылка
	|	ГДЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Назначение <> СпрВидыЗапасов.УстарелоНазначение
	|		И СпрВидыЗапасов.УстарелоНазначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И &ОтборПоРегистратору
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры КАК Аналитика,
	|		ВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрСведений.СтоимостьТоваров КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасов
	|		ПО ДанныеРегистра.ВидЗапасов = ВидыЗапасов.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО ДанныеРегистра.АналитикаУчетаНоменклатуры = Ключи.Ссылка
	|	ГДЕ
	|		ВидыЗапасов.УстарелоНазначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И ВидыЗапасов.УстарелоНазначение <> Ключи.Назначение
	|		И &ИспользуютсяВидыЗапасов
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры КАК Аналитика,
	|		ВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасов
	|		ПО ДанныеРегистра.ВидЗапасов = ВидыЗапасов.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО ДанныеРегистра.АналитикаУчетаНоменклатуры = Ключи.Ссылка
	|	ГДЕ
	|		ВидыЗапасов.УстарелоНазначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И ВидыЗапасов.УстарелоНазначение <> Ключи.Назначение
	|		И &ИспользуютсяВидыЗапасов
	|		И &ОтборПоРегистратору
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.КорАналитикаУчетаНоменклатуры КАК Аналитика,
	|		КорВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК КорВидыЗапасов
	|		ПО ДанныеРегистра.КорВидЗапасов = КорВидыЗапасов.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорКлючи
	|		ПО ДанныеРегистра.КорАналитикаУчетаНоменклатуры = КорКлючи.Ссылка
	|	ГДЕ
	|		КорВидыЗапасов.УстарелоНазначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И КорВидыЗапасов.УстарелоНазначение <> КорКлючи.Назначение
	|		И &ИспользуютсяВидыЗапасов
	|		И &ОтборПоРегистратору
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры КАК Аналитика,
	|		ВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.Закупки КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасов
	|		ПО ДанныеРегистра.ВидЗапасов = ВидыЗапасов.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО ДанныеРегистра.АналитикаУчетаНоменклатуры = Ключи.Ссылка
	|	ГДЕ
	|		ВидыЗапасов.УстарелоНазначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И ВидыЗапасов.УстарелоНазначение <> Ключи.Назначение
	|		И &ОтборПоРегистратору
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры КАК Аналитика,
	|		ВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ТоварыКОформлениюТаможенныхДеклараций КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК ВидыЗапасов
	|		ПО ДанныеРегистра.ВидЗапасов = ВидыЗапасов.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО ДанныеРегистра.АналитикаУчетаНоменклатуры = Ключи.Ссылка
	|	ГДЕ
	|		ВидыЗапасов.УстарелоНазначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|		И ВидыЗапасов.УстарелоНазначение <> Ключи.Назначение
	|		И &ОтборПоРегистратору
	|	) КАК Ключи
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК СпрКлючи
	|	ПО Ключи.Аналитика = СпрКлючи.Ссылка
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаСНазначением
	|	ПО АналитикаСНазначением.Номенклатура = СпрКлючи.Номенклатура
	|		И АналитикаСНазначением.Характеристика = СпрКлючи.Характеристика
	|		И АналитикаСНазначением.Серия = СпрКлючи.Серия
	|		И АналитикаСНазначением.МестоХранения = СпрКлючи.МестоХранения
	|		И АналитикаСНазначением.СтатьяКалькуляции = СпрКлючи.СтатьяКалькуляции
	|		И АналитикаСНазначением.Назначение = Ключи.Назначение
	|ГДЕ
	|	АналитикаСНазначением.КлючАналитики ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КлючиБезНазначения.Ссылка КАК Ссылка,
	|	Ключи.Назначение КАК Назначение
	|ИЗ
	|	Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиБезНазначения
	|	ПО КлючиБезНазначения.Номенклатура = Ключи.Номенклатура
	|		И КлючиБезНазначения.Характеристика = Ключи.Характеристика
	|		И КлючиБезНазначения.Серия = Ключи.Серия
	|		И КлючиБезНазначения.МестоХранения = Ключи.МестоХранения
	|		И КлючиБезНазначения.СтатьяКалькуляции = Ключи.СтатьяКалькуляции
	|		И КлючиБезНазначения.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|ГДЕ
	|	Ключи.Назначение <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|	//ВыбиратьВсеКлючи
	|;
	|////////////////////////////////////////////
	|";
КонецФункции

Функция ТекстЗапросаГенерацииКлючейАналитикиУчетаНоменклатуры() Экспорт
	ТекстЗапроса = "
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ             
	|       Движения.АналитикаУчетаНоменклатуры КАК КлючАналитики,
	|		Ключи.Номенклатура             КАК Номенклатура,
	|		Ключи.Характеристика           КАК Характеристика,
	|		Ключи.Серия                    КАК Серия,
	|		Ключи.МестоХранения            КАК МестоХранения,
	|		ЕСТЬNULL(Движения.ВидЗапасов.УстарелоНазначение, 
	|			ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначение
	|ПОМЕСТИТЬ КлючиДляЗаполненияНазначений
	|	ИЗ
	|		РегистрНакопления.ДвиженияНоменклатураДоходыРасходы КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Движения.АналитикаУчетаНоменклатуры
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО СпрВидыЗапасов.Ссылка = Движения.ВидЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|			И Ключи.Характеристика = Аналитика.Характеристика
	|			И Ключи.Серия = Аналитика.Серия
	|			И Ключи.МестоХранения = Аналитика.МестоХранения
	|			И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|			И СпрВидыЗапасов.УстарелоНазначение = Аналитика.Назначение
	|	ГДЕ
	|		Движения.АналитикаУчетаНоменклатуры В (ВЫБРАТЬ ВТСсылкиДляОбработки.Ссылка ИЗ ВТСсылкиДляОбработки) 
	|		И Аналитика.КлючАналитики ЕСТЬ NULL
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|       Движения.АналитикаУчетаНоменклатуры КАК КлючАналитки,
	|		Ключи.Номенклатура             КАК Номенклатура,
	|		Ключи.Характеристика           КАК Характеристика,
	|		Ключи.Серия                    КАК Серия,
	|		Ключи.МестоХранения            КАК МестоХранения,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ДвиженияНоменклатураНоменклатура КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Движения.АналитикаУчетаНоменклатуры
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО СпрВидыЗапасов.Ссылка = Движения.ВидЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|			И Ключи.Характеристика = Аналитика.Характеристика
	|			И Ключи.Серия = Аналитика.Серия
	|			И Ключи.МестоХранения = Аналитика.МестоХранения
	|			И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|			И СпрВидыЗапасов.УстарелоНазначение = Аналитика.Назначение
	|	ГДЕ
	|		Аналитика.КлючАналитики ЕСТЬ NULL
	|		И Движения.АналитикаУчетаНоменклатуры В (ВЫБРАТЬ ВТСсылкиДляОбработки.Ссылка ИЗ ВТСсылкиДляОбработки) 
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|       Движения.КорАналитикаУчетаНоменклатуры КАК КлючАналитки,
	|		Ключи.Номенклатура             КАК Номенклатура,
	|		Ключи.Характеристика           КАК Характеристика,
	|		Ключи.Серия                    КАК Серия,
	|		Ключи.МестоХранения            КАК МестоХранения,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ДвиженияНоменклатураНоменклатура КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Движения.КорАналитикаУчетаНоменклатуры
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО СпрВидыЗапасов.Ссылка = Движения.КорВидЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|			И Ключи.Характеристика = Аналитика.Характеристика
	|			И Ключи.Серия = Аналитика.Серия
	|			И Ключи.МестоХранения = Аналитика.МестоХранения
	|			И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|			И СпрВидыЗапасов.УстарелоНазначение = Аналитика.Назначение
	|	ГДЕ
	|		Аналитика.КлючАналитики ЕСТЬ NULL
	|		И Движения.КорАналитикаУчетаНоменклатуры В (ВЫБРАТЬ ВТСсылкиДляОбработки.Ссылка ИЗ ВТСсылкиДляОбработки) 
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|       Движения.АналитикаУчетаНоменклатуры КАК КлючАналитки,
	|		Ключи.Номенклатура             КАК Номенклатура,
	|		Ключи.Характеристика           КАК Характеристика,
	|		Ключи.Серия                    КАК Серия,
	|		Ключи.МестоХранения            КАК МестоХранения,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Движения.АналитикаУчетаНоменклатуры
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО СпрВидыЗапасов.Ссылка = Движения.ВидЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|			И Ключи.Характеристика = Аналитика.Характеристика
	|			И Ключи.Серия = Аналитика.Серия
	|			И Ключи.МестоХранения = Аналитика.МестоХранения
	|			И СпрВидыЗапасов.УстарелоНазначение = Аналитика.Назначение
	|			И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|	ГДЕ
	|		Аналитика.КлючАналитики ЕСТЬ NULL
	|		И Движения.АналитикаУчетаНоменклатуры В (ВЫБРАТЬ ВТСсылкиДляОбработки.Ссылка ИЗ ВТСсылкиДляОбработки) 
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|       Движения.КорАналитикаУчетаНоменклатуры КАК КлючАналитки,
	|		Ключи.Номенклатура                КАК Номенклатура,
	|		Ключи.Характеристика              КАК Характеристика,
	|		Ключи.Серия                       КАК Серия,
	|		Ключи.МестоХранения               КАК МестоХранения,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Движения.КорАналитикаУчетаНоменклатуры
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО СпрВидыЗапасов.Ссылка = Движения.КорВидЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|			И Ключи.Характеристика = Аналитика.Характеристика
	|			И Ключи.Серия = Аналитика.Серия
	|			И Ключи.МестоХранения = Аналитика.МестоХранения
	|			И СпрВидыЗапасов.УстарелоНазначение = Аналитика.Назначение
	|			И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|	ГДЕ
	|		Аналитика.КлючАналитики ЕСТЬ NULL
	|		И Движения.КорАналитикаУчетаНоменклатуры В (ВЫБРАТЬ ВТСсылкиДляОбработки.Ссылка ИЗ ВТСсылкиДляОбработки) 
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|       Движения.АналитикаУчетаНоменклатуры КАК КлючАналитки,
	|		Ключи.Номенклатура             КАК Номенклатура,
	|		Ключи.Характеристика           КАК Характеристика,
	|		Ключи.Серия                    КАК Серия,
	|		Ключи.МестоХранения            КАК МестоХранения,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровОрганизаций КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Движения.АналитикаУчетаНоменклатуры
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО СпрВидыЗапасов.Ссылка = Движения.ВидЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|			И Ключи.Характеристика = Аналитика.Характеристика
	|			И Ключи.Серия = Аналитика.Серия
	|			И Ключи.МестоХранения = Аналитика.МестоХранения
	|			И СпрВидыЗапасов.УстарелоНазначение = Аналитика.Назначение
	|			И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|	ГДЕ
	|		Аналитика.КлючАналитики ЕСТЬ NULL
	|		И Движения.АналитикаУчетаНоменклатуры В (ВЫБРАТЬ ВТСсылкиДляОбработки.Ссылка ИЗ ВТСсылкиДляОбработки) 
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|       Движения.КорАналитикаУчетаНоменклатуры КАК КлючАналитки,
	|		Ключи.Номенклатура             КАК Номенклатура,
	|		Ключи.Характеристика           КАК Характеристика,
	|		Ключи.Серия                    КАК Серия,
	|		Ключи.МестоХранения            КАК МестоХранения,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ПартииТоваровОрганизаций КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Движения.КорАналитикаУчетаНоменклатуры
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО СпрВидыЗапасов.Ссылка = Движения.КорВидЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|			И Ключи.Характеристика = Аналитика.Характеристика
	|			И Ключи.Серия = Аналитика.Серия
	|			И Ключи.МестоХранения = Аналитика.МестоХранения
	|			И СпрВидыЗапасов.УстарелоНазначение = Аналитика.Назначение
	|			И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|	ГДЕ
	|		Аналитика.КлючАналитики ЕСТЬ NULL
	|		И Движения.КорАналитикаУчетаНоменклатуры В (ВЫБРАТЬ ВТСсылкиДляОбработки.Ссылка ИЗ ВТСсылкиДляОбработки) 
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|       Движения.АналитикаУчетаНоменклатуры КАК КлючАналитки,
	|		Ключи.Номенклатура             КАК Номенклатура,
	|		Ключи.Характеристика           КАК Характеристика,
	|		Ключи.Серия                    КАК Серия,
	|		Ключи.МестоХранения            КАК МестоХранения,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ТоварыОрганизаций КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Движения.АналитикаУчетаНоменклатуры
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО СпрВидыЗапасов.Ссылка = Движения.ВидЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|			И Ключи.Характеристика = Аналитика.Характеристика
	|			И Ключи.Серия = Аналитика.Серия
	|			И Ключи.МестоХранения = Аналитика.МестоХранения
	|			И СпрВидыЗапасов.УстарелоНазначение = Аналитика.Назначение
	|			И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|	ГДЕ
	|		Аналитика.КлючАналитики ЕСТЬ NULL
	|		И Движения.АналитикаУчетаНоменклатуры В (ВЫБРАТЬ ВТСсылкиДляОбработки.Ссылка ИЗ ВТСсылкиДляОбработки) 
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|       Движения.КорАналитикаУчетаНоменклатуры КАК КлючАналитки,
	|		Ключи.Номенклатура             КАК Номенклатура,
	|		Ключи.Характеристика           КАК Характеристика,
	|		Ключи.Серия                    КАК Серия,
	|		Ключи.МестоХранения            КАК МестоХранения,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ТоварыОрганизаций КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Движения.КорАналитикаУчетаНоменклатуры
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО СпрВидыЗапасов.Ссылка = Движения.КорВидЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|			И Ключи.Характеристика = Аналитика.Характеристика
	|			И Ключи.Серия = Аналитика.Серия
	|			И Ключи.МестоХранения = Аналитика.МестоХранения
	|			И СпрВидыЗапасов.УстарелоНазначение = Аналитика.Назначение
	|			И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|	ГДЕ
	|		Аналитика.КлючАналитики ЕСТЬ NULL
	|		И Движения.КорАналитикаУчетаНоменклатуры В (ВЫБРАТЬ ВТСсылкиДляОбработки.Ссылка ИЗ ВТСсылкиДляОбработки) 
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|       Движения.АналитикаУчетаНоменклатуры КАК КлючАналитки,
	|		Ключи.Номенклатура             КАК Номенклатура,
	|		Ключи.Характеристика           КАК Характеристика,
	|		Ключи.Серия                    КАК Серия,
	|		Ключи.МестоХранения            КАК МестоХранения,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ТоварыОрганизацийКПередаче КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Движения.АналитикаУчетаНоменклатуры
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО СпрВидыЗапасов.Ссылка = Движения.ВидЗапасовПродавца
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|			И Ключи.Характеристика = Аналитика.Характеристика
	|			И Ключи.Серия = Аналитика.Серия
	|			И Ключи.МестоХранения = Аналитика.МестоХранения
	|			И СпрВидыЗапасов.УстарелоНазначение = Аналитика.Назначение
	|			И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|	ГДЕ
	|		Аналитика.КлючАналитики ЕСТЬ NULL
	|		И Движения.АналитикаУчетаНоменклатуры В (ВЫБРАТЬ ВТСсылкиДляОбработки.Ссылка ИЗ ВТСсылкиДляОбработки) 
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|       Движения.АналитикаУчетаНоменклатуры КАК КлючАналитки,
	|		Ключи.Номенклатура             КАК Номенклатура,
	|		Ключи.Характеристика           КАК Характеристика,
	|		Ключи.Серия                    КАК Серия,
	|		Ключи.МестоХранения            КАК МестоХранения,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Движения.АналитикаУчетаНоменклатуры
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО СпрВидыЗапасов.Ссылка = Движения.ВидЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|			И Ключи.Характеристика = Аналитика.Характеристика
	|			И Ключи.Серия = Аналитика.Серия
	|			И Ключи.МестоХранения = Аналитика.МестоХранения
	|			И СпрВидыЗапасов.УстарелоНазначение = Аналитика.Назначение
	|			И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|	ГДЕ
	|		Аналитика.КлючАналитики ЕСТЬ NULL
	|		И Движения.АналитикаУчетаНоменклатуры В (ВЫБРАТЬ ВТСсылкиДляОбработки.Ссылка ИЗ ВТСсылкиДляОбработки) 
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|       Движения.АналитикаУчетаНоменклатуры КАК КлючАналитки,
	|		Ключи.Номенклатура             КАК Номенклатура,
	|		Ключи.Характеристика           КАК Характеристика,
	|		Ключи.Серия                    КАК Серия,
	|		Ключи.МестоХранения            КАК МестоХранения,
	|		Движения.Назначение            КАК Назначение
	|	ИЗ
	|		РегистрНакопления.МатериалыИРаботыВПроизводстве КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Движения.АналитикаУчетаНоменклатуры
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|			И Ключи.Характеристика = Аналитика.Характеристика
	|			И Ключи.Серия = Аналитика.Серия
	|			И Ключи.МестоХранения = Аналитика.МестоХранения
	|			И Движения.Назначение = Аналитика.Назначение
	|			И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|	ГДЕ
	|		Аналитика.КлючАналитики ЕСТЬ NULL
	|		И Движения.АналитикаУчетаНоменклатуры В (ВЫБРАТЬ ВТСсылкиДляОбработки.Ссылка ИЗ ВТСсылкиДляОбработки) 
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|       Движения.АналитикаУчетаПродукции КАК КлючАналитки,
	|		Ключи.Номенклатура             КАК Номенклатура,
	|		Ключи.Характеристика           КАК Характеристика,
	|		Ключи.Серия                    КАК Серия,
	|		Ключи.МестоХранения            КАК МестоХранения,
	|		Движения.Назначение            КАК Назначение
	|	ИЗ
	|		РегистрНакопления.МатериалыИРаботыВПроизводстве КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Движения.АналитикаУчетаПродукции
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|			И Ключи.Характеристика = Аналитика.Характеристика
	|			И Ключи.Серия = Аналитика.Серия
	|			И Ключи.МестоХранения = Аналитика.МестоХранения
	|			И Движения.Назначение = Аналитика.Назначение
	|			И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|	ГДЕ
	|		Аналитика.КлючАналитики ЕСТЬ NULL
	|		И Движения.АналитикаУчетаПродукции В (ВЫБРАТЬ ВТСсылкиДляОбработки.Ссылка ИЗ ВТСсылкиДляОбработки) 
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|       Движения.АналитикаУчетаНоменклатуры КАК КлючАналитки,
	|		Ключи.Номенклатура             КАК Номенклатура,
	|		Ключи.Характеристика           КАК Характеристика,
	|		Ключи.Серия                    КАК Серия,
	|		Ключи.МестоХранения            КАК МестоХранения,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ПартииЗатратНаВыпуск КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Движения.АналитикаУчетаНоменклатуры
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО СпрВидыЗапасов.Ссылка = Движения.ВидЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|			И Ключи.Характеристика = Аналитика.Характеристика
	|			И Ключи.Серия = Аналитика.Серия
	|			И Ключи.МестоХранения = Аналитика.МестоХранения
	|			И СпрВидыЗапасов.УстарелоНазначение = Аналитика.Назначение
	|			И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|	ГДЕ
	|		Аналитика.КлючАналитики ЕСТЬ NULL
	|		И Движения.АналитикаУчетаНоменклатуры В (ВЫБРАТЬ ВТСсылкиДляОбработки.Ссылка ИЗ ВТСсылкиДляОбработки) 
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|                     
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|       Движения.КорАналитикаУчетаПродукции КАК КлючАналитки,
	|		Ключи.Номенклатура                КАК Номенклатура,
	|		Ключи.Характеристика              КАК Характеристика,
	|		Ключи.Серия                       КАК Серия,
	|		Ключи.МестоХранения               КАК МестоХранения,
	|		Движения.КорВидЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ПартииЗатратНаВыпуск КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Движения.КорАналитикаУчетаПродукции
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО СпрВидыЗапасов.Ссылка = Движения.КорВидЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|			И Ключи.Характеристика = Аналитика.Характеристика
	|			И Ключи.Серия = Аналитика.Серия
	|			И Ключи.МестоХранения = Аналитика.МестоХранения
	|			И СпрВидыЗапасов.УстарелоНазначение = Аналитика.Назначение
	|			И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|	ГДЕ
	|		Аналитика.КлючАналитики ЕСТЬ NULL
	|		И Движения.КорАналитикаУчетаПродукции В (ВЫБРАТЬ ВТСсылкиДляОбработки.Ссылка ИЗ ВТСсылкиДляОбработки) 
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|                     
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|       Движения.АналитикаУчетаПродукции  КАК КлючАналитки,
	|		Ключи.Номенклатура                КАК Номенклатура,
	|		Ключи.Характеристика              КАК Характеристика,
	|		Ключи.Серия                       КАК Серия,
	|		Ключи.МестоХранения               КАК МестоХранения,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ПартииЗатратНаВыпуск КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Движения.АналитикаУчетаПродукции
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО СпрВидыЗапасов.Ссылка = Движения.ВидЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|			И Ключи.Характеристика = Аналитика.Характеристика
	|			И Ключи.Серия = Аналитика.Серия
	|			И Ключи.МестоХранения = Аналитика.МестоХранения
	|			И СпрВидыЗапасов.УстарелоНазначение = Аналитика.Назначение
	|			И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|	ГДЕ
	|		Аналитика.КлючАналитики ЕСТЬ NULL
	|		И Движения.АналитикаУчетаПродукции В (ВЫБРАТЬ ВТСсылкиДляОбработки.Ссылка ИЗ ВТСсылкиДляОбработки) 
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|       Движения.АналитикаУчетаНоменклатуры КАК КлючАналитки,
	|		Ключи.Номенклатура             КАК Номенклатура,
	|		Ключи.Характеристика           КАК Характеристика,
	|		Ключи.Серия                    КАК Серия,
	|		Ключи.МестоХранения            КАК МестоХранения,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ПартииПроизводственныхЗатрат КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Движения.АналитикаУчетаНоменклатуры
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО СпрВидыЗапасов.Ссылка = Движения.ВидЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|			И Ключи.Характеристика = Аналитика.Характеристика
	|			И Ключи.Серия = Аналитика.Серия
	|			И Ключи.МестоХранения = Аналитика.МестоХранения
	|			И СпрВидыЗапасов.УстарелоНазначение = Аналитика.Назначение
	|			И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|	ГДЕ
	|		Аналитика.КлючАналитики ЕСТЬ NULL
	|		И Движения.АналитикаУчетаНоменклатуры В (ВЫБРАТЬ ВТСсылкиДляОбработки.Ссылка ИЗ ВТСсылкиДляОбработки) 
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|       Движения.КорАналитикаУчетаНоменклатуры КАК КлючАналитки,
	|		Ключи.Номенклатура             КАК Номенклатура,
	|		Ключи.Характеристика           КАК Характеристика,
	|		Ключи.Серия                    КАК Серия,
	|		Ключи.МестоХранения            КАК МестоХранения,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ПартииПроизводственныхЗатрат КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Движения.КорАналитикаУчетаНоменклатуры
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО СпрВидыЗапасов.Ссылка = Движения.ВидЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|			И Ключи.Характеристика = Аналитика.Характеристика
	|			И Ключи.Серия = Аналитика.Серия
	|			И Ключи.МестоХранения = Аналитика.МестоХранения
	|			И СпрВидыЗапасов.УстарелоНазначение = Аналитика.Назначение
	|			И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|	ГДЕ
	|		Аналитика.КлючАналитики ЕСТЬ NULL
	|		И Движения.КорАналитикаУчетаНоменклатуры В (ВЫБРАТЬ ВТСсылкиДляОбработки.Ссылка ИЗ ВТСсылкиДляОбработки) 
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|       Движения.АналитикаУчетаНоменклатуры КАК КлючАналитки,
	|		Ключи.Номенклатура             КАК Номенклатура,
	|		Ключи.Характеристика           КАК Характеристика,
	|		Ключи.Серия                    КАК Серия,
	|		Ключи.МестоХранения            КАК МестоХранения,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Движения.АналитикаУчетаНоменклатуры
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО СпрВидыЗапасов.Ссылка = Движения.ВидЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|			И Ключи.Характеристика = Аналитика.Характеристика
	|			И Ключи.Серия = Аналитика.Серия
	|			И Ключи.МестоХранения = Аналитика.МестоХранения
	|			И СпрВидыЗапасов.УстарелоНазначение = Аналитика.Назначение
	|			И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|	ГДЕ
	|		Аналитика.КлючАналитики ЕСТЬ NULL
	|		И Движения.АналитикаУчетаНоменклатуры В (ВЫБРАТЬ ВТСсылкиДляОбработки.Ссылка ИЗ ВТСсылкиДляОбработки) 
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|       Движения.АналитикаУчетаНоменклатуры КАК КлючАналитки,
	|		Ключи.Номенклатура                    КАК Номенклатура,
	|		Ключи.Характеристика                  КАК Характеристика,
	|		Ключи.Серия                           КАК Серия,
	|		Ключи.МестоХранения                   КАК МестоХранения,
	|		СпрВидыЗапасов.УстарелоНазначение     КАК Назначение
	|	ИЗ
	|		РегистрСведений.СтоимостьТоваров КАК Движения
	|	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Движения.АналитикаУчетаНоменклатуры
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО СпрВидыЗапасов.Ссылка = Движения.ВидЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|			И Ключи.Характеристика = Аналитика.Характеристика
	|			И Ключи.Серия = Аналитика.Серия
	|			И Ключи.МестоХранения = Аналитика.МестоХранения
	|			И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|			И СпрВидыЗапасов.УстарелоНазначение = Аналитика.Назначение
	|	ГДЕ
	|		Аналитика.КлючАналитики ЕСТЬ NULL
	|		И Движения.АналитикаУчетаНоменклатуры В (ВЫБРАТЬ ВТСсылкиДляОбработки.Ссылка ИЗ ВТСсылкиДляОбработки) 
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|       Движения.АналитикаУчетаНоменклатуры КАК КлючАналитки,
	|		Ключи.Номенклатура             КАК Номенклатура,
	|		Ключи.Характеристика           КАК Характеристика,
	|		Ключи.Серия                    КАК Серия,
	|		Ключи.МестоХранения            КАК МестоХранения,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.Закупки КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Движения.АналитикаУчетаНоменклатуры
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО СпрВидыЗапасов.Ссылка = Движения.ВидЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|			И Ключи.Характеристика = Аналитика.Характеристика
	|			И Ключи.Серия = Аналитика.Серия
	|			И Ключи.МестоХранения = Аналитика.МестоХранения
	|			И СпрВидыЗапасов.УстарелоНазначение = Аналитика.Назначение
	|			И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|	ГДЕ
	|		Аналитика.КлючАналитики ЕСТЬ NULL
	|		И Движения.АналитикаУчетаНоменклатуры В (ВЫБРАТЬ ВТСсылкиДляОбработки.Ссылка ИЗ ВТСсылкиДляОбработки) 
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ РАЗЛИЧНЫЕ
	|       Движения.АналитикаУчетаНоменклатуры КАК КлючАналитки,
	|		Ключи.Номенклатура             КАК Номенклатура,
	|		Ключи.Характеристика           КАК Характеристика,
	|		Ключи.Серия                    КАК Серия,
	|		Ключи.МестоХранения            КАК МестоХранения,
	|		СпрВидыЗапасов.УстарелоНазначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.ТоварыКОформлениюТаможенныхДеклараций КАК Движения
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Ключи
	|		ПО Ключи.Ссылка = Движения.АналитикаУчетаНоменклатуры
	|
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЗапасов КАК СпрВидыЗапасов
	|		ПО СпрВидыЗапасов.Ссылка = Движения.ВидЗапасов
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|		ПО Ключи.Номенклатура = Аналитика.Номенклатура
	|			И Ключи.Характеристика = Аналитика.Характеристика
	|			И Ключи.Серия = Аналитика.Серия
	|			И Ключи.МестоХранения = Аналитика.МестоХранения
	|			И СпрВидыЗапасов.УстарелоНазначение = Аналитика.Назначение
	|			И Ключи.СтатьяКалькуляции = Аналитика.СтатьяКалькуляции
	|	ГДЕ
	|		Аналитика.КлючАналитики ЕСТЬ NULL
	|		И Движения.АналитикаУчетаНоменклатуры В (ВЫБРАТЬ ВТСсылкиДляОбработки.Ссылка ИЗ ВТСсылкиДляОбработки) 
	|	
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ключи.КлючАналитики КАК КлючАналитики,
	|	Ключи.Номенклатура КАК Номенклатура,
	|	Ключи.Характеристика КАК Характеристика,
	|	Ключи.Серия КАК Серия,
	|	Ключи.МестоХранения КАК МестоХранения,
	|	Ключи.Назначение КАК Назначение
	|
	|ПОМЕСТИТЬ ТаблицаГенерацииКлючей
	|ИЗ 
	|	КлючиДляЗаполненияНазначений КАК Ключи 
	|
	|ОБЪЕДИНИТЬ ВСЕ    
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ключи.КлючАналитики КАК КлючАналитики,
	|	Ключи.Номенклатура КАК Номенклатура,
	|	Ключи.Характеристика КАК Характеристика,
	|	Ключи.Серия КАК Серия,
	|	Ключи.МестоХранения КАК МестоХранения,
	|	ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка) КАК Назначение
	|ИЗ 
	|	КлючиДляЗаполненияНазначений КАК Ключи
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючАналитики
	|"; 
	
	Возврат ТекстЗапроса; 
	
КонецФункции

Функция ТекстЗапросаПоискаКлючаАналитики() Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ключи.Номенклатура КАК Номенклатура,
	|	Ключи.Характеристика КАК Характеристика,
	|	Ключи.Серия КАК Серия,
	|	Ключи.МестоХранения КАК МестоХранения,
	|	Ключи.Назначение КАК Назначение
	|ИЗ 
	|	ТаблицаГенерацииКлючей КАК Ключи 
	|ГДЕ 
	|	Ключи.КлючАналитики = &КлючАналитики
	|";
	
	Возврат ТекстЗапроса; 
	
КонецФункции

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяСправочника = Метаданные.Справочники.КлючиАналитикиУчетаНоменклатуры.ПолноеИмя();
	ПолноеИмяРегистра = Метаданные.РегистрыСведений.АналитикаУчетаНоменклатуры.ПолноеИмя();
	
	ДополнительныеПараметрыВыборкиДанных = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляОбработки();
	ДополнительныеПараметрыВыборкиДанных.ВыбиратьПорциями = Ложь;
	ДополнительныеПараметрыВыборкиДанных.ИмяВременнойТаблицы = "ВТСсылкиДляОбработки";
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Результат = ОбновлениеИнформационнойБазы.СоздатьВременнуюТаблицуСсылокДляОбработки(
		Параметры.Очередь, 
		ПолноеИмяСправочника,
		МенеджерВременныхТаблиц, 
		ДополнительныеПараметрыВыборкиДанных
	);
	
	Если Не Результат.ЕстьДанныеДляОбработки Тогда
		Параметры.ОбработкаЗавершена = Истина;
		Возврат;
	КонецЕсли;
	Если Не Результат.ЕстьЗаписиВоВременнойТаблице Тогда
		Параметры.ОбработкаЗавершена = Ложь;
		Возврат;
	КонецЕсли;            
	
	
	// 
	ЗапросГенерацииКлючей = Новый Запрос();  
	ЗапросГенерацииКлючей.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросГенерацииКлючей.Текст = ТекстЗапросаГенерацииКлючейАналитикиУчетаНоменклатуры();
	ЗапросГенерацииКлючей.Выполнить();
	
	ЗапросПоискаКлюча = Новый Запрос();
	ЗапросПоискаКлюча.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	ЗапросПоискаКлюча.Текст = ТекстЗапросаПоискаКлючаАналитики();
	
	ЗапросЗаполненияРеквизитовПриОбновлении = Новый Запрос();
	ЗапросЗаполненияРеквизитовПриОбновлении.Текст = ТекстЗапросаЗаполненияРеквизитовПриОбновлении();
	// 
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьСсылкиДляОбработки(
		Параметры.Очередь, 
		ПолноеИмяСправочника, 
		ДополнительныеПараметрыВыборкиДанных
	);
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
		НачатьТранзакцию();
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяСправочника);
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		
		Блокировка.Заблокировать();
		
        ОбновитьРеквизитыКлюча = Ложь;
		
		ЗапросПоискаКлюча.УстановитьПараметр("КлючАналитики", Выборка.Ссылка);
		
		РезультатКлючи = ЗапросПоискаКлюча.Выполнить();
		Если НЕ РезультатКлючи.Пустой() Тогда 
			Ключи = РезультатКлючи.Выбрать();
			Пока Ключи.Следующий() Цикл
				Если ЗначениеЗаполнено(Ключи.Назначение) Тогда
					РегистрыСведений.АналитикаУчетаНоменклатуры.СоздатьКлючАналитики(Ключи);
				Иначе 
					ОбновитьРеквизитыКлюча = Истина;
				КонецЕсли;
			КонецЦикла;  
			Если НЕ ОбновитьРеквизитыКлюча Тогда
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(Выборка.Ссылка);
			КонецЕсли;
		Иначе 
			ОбновитьРеквизитыКлюча = Истина;
		КонецЕсли;
		
		Если ОбновитьРеквизитыКлюча Тогда
				
			ЗапросЗаполненияРеквизитовПриОбновлении.УстановитьПараметр("КлючАналитики", Выборка.Ссылка);
			Ключи = ЗапросЗаполненияРеквизитовПриОбновлении.Выполнить().Выбрать();
			
			Пока Ключи.Следующий() Цикл
				
				СправочникОбъект = ОбновлениеИнформационнойБазыУТ.ПроверитьПолучитьОбъект(
					Выборка.Ссылка, 
					Ключи.ВерсияДанных, 
					Параметры.Очередь
				);
				
				Если СправочникОбъект <> Неопределено Тогда
					
					ЗаполняемыеПоля = "ТипМестаХранения, СкладскаяТерритория, Подразделение, Партнер, Контрагент, Договор, Организация";
					ЗаполнитьЗначенияСвойств(СправочникОбъект, Ключи, ЗаполняемыеПоля);
					
					ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
					
				КонецЕсли;
			
			КонецЦикла;
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
		Исключение
			
			ОтменитьТранзакцию();
			
			ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), Выборка.Ссылка);
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = Не ОбновлениеИнформационнойБазы.ЕстьДанныеДляОбработки(Параметры.Очередь, ПолноеИмяСправочника);
	
КонецПроцедуры

// Устанавливает обязательные параметры для запроса из метода ТекстЗапросаГенерацииКлючейКОбработке
Процедура УстановитьПараметрыЗапросаКлючей(Запрос) Экспорт
	Запрос.УстановитьПараметр("ИспользуютсяВидыЗапасов", Константы.УчитыватьСебестоимостьТоваровПоНазначениям.Получить());
	Запрос.УстановитьПараметр("ОтборПоРегистратору", Истина);
КонецПроцедуры

Функция ТекстЗапросаЗаполненияРеквизитовПриОбновлении()
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	КОбработке.Ссылка КАК Ссылка,
	|	КОбработке.Ссылка.ВерсияДанных КАК ВерсияДанных,
	|	КОбработке.Ссылка.Номенклатура КАК Номенклатура,
	|	КОбработке.Ссылка.Характеристика КАК Характеристика,
	|	КОбработке.Ссылка.Серия КАК Серия,
	|	КОбработке.Ссылка.МестоХранения КАК МестоХранения,
	|	КОбработке.Ссылка.Назначение КАК Назначение,
	|	КОбработке.Ссылка.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(КОбработке.Ссылка.МестоХранения) = ТИП(Справочник.Склады)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|		КОГДА ТИПЗНАЧЕНИЯ(КОбработке.Ссылка.МестоХранения) = ТИП(Справочник.СтруктураПредприятия)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|		КОГДА ТИПЗНАЧЕНИЯ(КОбработке.Ссылка.МестоХранения) = ТИП(Справочник.Партнеры)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер)
	|		КОГДА ТИПЗНАЧЕНИЯ(КОбработке.Ссылка.МестоХранения) = ТИП(Справочник.Организации)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Организация)
	|		КОГДА ТИПЗНАЧЕНИЯ(КОбработке.Ссылка.МестоХранения) = ТИП(Справочник.ДоговорыКонтрагентов)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.ДоговорКонтрагента)
	|	КОНЕЦ КАК ТипМестаХранения,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(КОбработке.Ссылка.МестоХранения) = ТИП(Справочник.Склады) ТОГДА
	|		КОбработке.Ссылка.МестоХранения
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|	КОНЕЦ КАК СкладскаяТерритория,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(КОбработке.Ссылка.МестоХранения) = ТИП(Справочник.СтруктураПредприятия) ТОГДА
	|		КОбработке.Ссылка.МестоХранения
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(КОбработке.Ссылка.МестоХранения) = ТИП(Справочник.Партнеры) ТОГДА
	|			КОбработке.Ссылка.МестоХранения
	|		КОГДА ТИПЗНАЧЕНИЯ(КОбработке.Ссылка.МестоХранения) = ТИП(Справочник.ДоговорыКонтрагентов) ТОГДА
	|			ВЫРАЗИТЬ(КОбработке.Ссылка.МестоХранения КАК Справочник.ДоговорыКонтрагентов).Партнер
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|	КОНЕЦ КАК Партнер,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(КОбработке.Ссылка.МестоХранения) = ТИП(Справочник.ДоговорыКонтрагентов) ТОГДА
	|		ВЫРАЗИТЬ(КОбработке.Ссылка.МестоХранения КАК Справочник.ДоговорыКонтрагентов).Контрагент
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(КОбработке.Ссылка.МестоХранения) = ТИП(Справочник.ДоговорыКонтрагентов) ТОГДА
	|		КОбработке.Ссылка.Ссылка
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(КОбработке.Ссылка.МестоХранения) = ТИП(Справочник.Организации) ТОГДА
	|		КОбработке.Ссылка.Ссылка
	|	ИНАЧЕ
	|		ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	КОНЕЦ КАК Организация
	|ИЗ
	|	Справочник.КлючиАналитикиУчетаНоменклатуры КАК КОбработке
	|	ГДЕ КОбработке.Ссылка = &КлючАналитики
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции



#КонецОбласти

#КонецОбласти

#КонецЕсли